[
  {
    "patterns": [
      "What are the best dog sledding spots in Jackson?",
      "Can you recommend dog sledding options near Jackson?",
      "Any good dog sledding tours around Jackson?",
      "Tell me about dog sledding experiences in Jackson",
      "Are there scenic or family-friendly dog sledding areas near Jackson?"
    ],
    "response": "Here’s a local guide to dog sledding around Jackson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "dog sledding"
    ],
    "tags": [
      "dog_sledding",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best dog sledding spots in Driggs?",
      "Can you recommend dog sledding options near Driggs?",
      "Any good dog sledding tours around Driggs?",
      "Tell me about dog sledding experiences in Driggs",
      "Are there scenic or family-friendly dog sledding areas near Driggs?"
    ],
    "response": "Here’s a local guide to dog sledding around Driggs. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "dog sledding"
    ],
    "tags": [
      "dog_sledding",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best dog sledding spots in Teton Village?",
      "Can you recommend dog sledding options near Teton Village?",
      "Any good dog sledding tours around Teton Village?",
      "Tell me about dog sledding experiences in Teton Village",
      "Are there scenic or family-friendly dog sledding areas near Teton Village?"
    ],
    "response": "Here’s a local guide to dog sledding around Teton Village. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "dog sledding"
    ],
    "tags": [
      "dog_sledding",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best dog sledding spots in Snow King?",
      "Can you recommend dog sledding options near Snow King?",
      "Any good dog sledding tours around Snow King?",
      "Tell me about dog sledding experiences in Snow King",
      "Are there scenic or family-friendly dog sledding areas near Snow King?"
    ],
    "response": "Here’s a local guide to dog sledding around Snow King. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "dog sledding"
    ],
    "tags": [
      "dog_sledding",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best dog sledding spots in Grand Targhee?",
      "Can you recommend dog sledding options near Grand Targhee?",
      "Any good dog sledding tours around Grand Targhee?",
      "Tell me about dog sledding experiences in Grand Targhee",
      "Are there scenic or family-friendly dog sledding areas near Grand Targhee?"
    ],
    "response": "Here’s a local guide to dog sledding around Grand Targhee. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "dog sledding"
    ],
    "tags": [
      "dog_sledding",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best dog sledding spots in Hoback?",
      "Can you recommend dog sledding options near Hoback?",
      "Any good dog sledding tours around Hoback?",
      "Tell me about dog sledding experiences in Hoback",
      "Are there scenic or family-friendly dog sledding areas near Hoback?"
    ],
    "response": "Here’s a local guide to dog sledding around Hoback. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "dog sledding"
    ],
    "tags": [
      "dog_sledding",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best dog sledding spots in Wilson?",
      "Can you recommend dog sledding options near Wilson?",
      "Any good dog sledding tours around Wilson?",
      "Tell me about dog sledding experiences in Wilson",
      "Are there scenic or family-friendly dog sledding areas near Wilson?"
    ],
    "response": "Here’s a local guide to dog sledding around Wilson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "dog sledding"
    ],
    "tags": [
      "dog_sledding",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best dog sledding spots in Alpine?",
      "Can you recommend dog sledding options near Alpine?",
      "Any good dog sledding tours around Alpine?",
      "Tell me about dog sledding experiences in Alpine",
      "Are there scenic or family-friendly dog sledding areas near Alpine?"
    ],
    "response": "Here’s a local guide to dog sledding around Alpine. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "dog sledding"
    ],
    "tags": [
      "dog_sledding",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best dog sledding spots in Victor?",
      "Can you recommend dog sledding options near Victor?",
      "Any good dog sledding tours around Victor?",
      "Tell me about dog sledding experiences in Victor",
      "Are there scenic or family-friendly dog sledding areas near Victor?"
    ],
    "response": "Here’s a local guide to dog sledding around Victor. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "dog sledding"
    ],
    "tags": [
      "dog_sledding",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best dog sledding spots in Kelly?",
      "Can you recommend dog sledding options near Kelly?",
      "Any good dog sledding tours around Kelly?",
      "Tell me about dog sledding experiences in Kelly",
      "Are there scenic or family-friendly dog sledding areas near Kelly?"
    ],
    "response": "Here’s a local guide to dog sledding around Kelly. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "dog sledding"
    ],
    "tags": [
      "dog_sledding",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best sleigh rides spots in Jackson?",
      "Can you recommend sleigh rides options near Jackson?",
      "Any good sleigh rides tours around Jackson?",
      "Tell me about sleigh rides experiences in Jackson",
      "Are there scenic or family-friendly sleigh rides areas near Jackson?"
    ],
    "response": "Here’s a local guide to sleigh rides around Jackson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "sleigh rides"
    ],
    "tags": [
      "sleigh_rides",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best sleigh rides spots in Driggs?",
      "Can you recommend sleigh rides options near Driggs?",
      "Any good sleigh rides tours around Driggs?",
      "Tell me about sleigh rides experiences in Driggs",
      "Are there scenic or family-friendly sleigh rides areas near Driggs?"
    ],
    "response": "Here’s a local guide to sleigh rides around Driggs. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "sleigh rides"
    ],
    "tags": [
      "sleigh_rides",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best sleigh rides spots in Teton Village?",
      "Can you recommend sleigh rides options near Teton Village?",
      "Any good sleigh rides tours around Teton Village?",
      "Tell me about sleigh rides experiences in Teton Village",
      "Are there scenic or family-friendly sleigh rides areas near Teton Village?"
    ],
    "response": "Here’s a local guide to sleigh rides around Teton Village. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "sleigh rides"
    ],
    "tags": [
      "sleigh_rides",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best sleigh rides spots in Snow King?",
      "Can you recommend sleigh rides options near Snow King?",
      "Any good sleigh rides tours around Snow King?",
      "Tell me about sleigh rides experiences in Snow King",
      "Are there scenic or family-friendly sleigh rides areas near Snow King?"
    ],
    "response": "Here’s a local guide to sleigh rides around Snow King. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "sleigh rides"
    ],
    "tags": [
      "sleigh_rides",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best sleigh rides spots in Grand Targhee?",
      "Can you recommend sleigh rides options near Grand Targhee?",
      "Any good sleigh rides tours around Grand Targhee?",
      "Tell me about sleigh rides experiences in Grand Targhee",
      "Are there scenic or family-friendly sleigh rides areas near Grand Targhee?"
    ],
    "response": "Here’s a local guide to sleigh rides around Grand Targhee. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "sleigh rides"
    ],
    "tags": [
      "sleigh_rides",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best sleigh rides spots in Hoback?",
      "Can you recommend sleigh rides options near Hoback?",
      "Any good sleigh rides tours around Hoback?",
      "Tell me about sleigh rides experiences in Hoback",
      "Are there scenic or family-friendly sleigh rides areas near Hoback?"
    ],
    "response": "Here’s a local guide to sleigh rides around Hoback. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "sleigh rides"
    ],
    "tags": [
      "sleigh_rides",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best sleigh rides spots in Wilson?",
      "Can you recommend sleigh rides options near Wilson?",
      "Any good sleigh rides tours around Wilson?",
      "Tell me about sleigh rides experiences in Wilson",
      "Are there scenic or family-friendly sleigh rides areas near Wilson?"
    ],
    "response": "Here’s a local guide to sleigh rides around Wilson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "sleigh rides"
    ],
    "tags": [
      "sleigh_rides",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best sleigh rides spots in Alpine?",
      "Can you recommend sleigh rides options near Alpine?",
      "Any good sleigh rides tours around Alpine?",
      "Tell me about sleigh rides experiences in Alpine",
      "Are there scenic or family-friendly sleigh rides areas near Alpine?"
    ],
    "response": "Here’s a local guide to sleigh rides around Alpine. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "sleigh rides"
    ],
    "tags": [
      "sleigh_rides",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best sleigh rides spots in Victor?",
      "Can you recommend sleigh rides options near Victor?",
      "Any good sleigh rides tours around Victor?",
      "Tell me about sleigh rides experiences in Victor",
      "Are there scenic or family-friendly sleigh rides areas near Victor?"
    ],
    "response": "Here’s a local guide to sleigh rides around Victor. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "sleigh rides"
    ],
    "tags": [
      "sleigh_rides",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best sleigh rides spots in Kelly?",
      "Can you recommend sleigh rides options near Kelly?",
      "Any good sleigh rides tours around Kelly?",
      "Tell me about sleigh rides experiences in Kelly",
      "Are there scenic or family-friendly sleigh rides areas near Kelly?"
    ],
    "response": "Here’s a local guide to sleigh rides around Kelly. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "sleigh rides"
    ],
    "tags": [
      "sleigh_rides",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best snowshoeing spots in Jackson?",
      "Can you recommend snowshoeing options near Jackson?",
      "Any good snowshoeing tours around Jackson?",
      "Tell me about snowshoeing experiences in Jackson",
      "Are there scenic or family-friendly snowshoeing areas near Jackson?"
    ],
    "response": "Here’s a local guide to snowshoeing around Jackson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "snowshoeing"
    ],
    "tags": [
      "snowshoeing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best snowshoeing spots in Driggs?",
      "Can you recommend snowshoeing options near Driggs?",
      "Any good snowshoeing tours around Driggs?",
      "Tell me about snowshoeing experiences in Driggs",
      "Are there scenic or family-friendly snowshoeing areas near Driggs?"
    ],
    "response": "Here’s a local guide to snowshoeing around Driggs. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "snowshoeing"
    ],
    "tags": [
      "snowshoeing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best snowshoeing spots in Teton Village?",
      "Can you recommend snowshoeing options near Teton Village?",
      "Any good snowshoeing tours around Teton Village?",
      "Tell me about snowshoeing experiences in Teton Village",
      "Are there scenic or family-friendly snowshoeing areas near Teton Village?"
    ],
    "response": "Here’s a local guide to snowshoeing around Teton Village. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "snowshoeing"
    ],
    "tags": [
      "snowshoeing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best snowshoeing spots in Snow King?",
      "Can you recommend snowshoeing options near Snow King?",
      "Any good snowshoeing tours around Snow King?",
      "Tell me about snowshoeing experiences in Snow King",
      "Are there scenic or family-friendly snowshoeing areas near Snow King?"
    ],
    "response": "Here’s a local guide to snowshoeing around Snow King. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "snowshoeing"
    ],
    "tags": [
      "snowshoeing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best snowshoeing spots in Grand Targhee?",
      "Can you recommend snowshoeing options near Grand Targhee?",
      "Any good snowshoeing tours around Grand Targhee?",
      "Tell me about snowshoeing experiences in Grand Targhee",
      "Are there scenic or family-friendly snowshoeing areas near Grand Targhee?"
    ],
    "response": "Here’s a local guide to snowshoeing around Grand Targhee. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "snowshoeing"
    ],
    "tags": [
      "snowshoeing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best snowshoeing spots in Hoback?",
      "Can you recommend snowshoeing options near Hoback?",
      "Any good snowshoeing tours around Hoback?",
      "Tell me about snowshoeing experiences in Hoback",
      "Are there scenic or family-friendly snowshoeing areas near Hoback?"
    ],
    "response": "Here’s a local guide to snowshoeing around Hoback. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "snowshoeing"
    ],
    "tags": [
      "snowshoeing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best snowshoeing spots in Wilson?",
      "Can you recommend snowshoeing options near Wilson?",
      "Any good snowshoeing tours around Wilson?",
      "Tell me about snowshoeing experiences in Wilson",
      "Are there scenic or family-friendly snowshoeing areas near Wilson?"
    ],
    "response": "Here’s a local guide to snowshoeing around Wilson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "snowshoeing"
    ],
    "tags": [
      "snowshoeing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best snowshoeing spots in Alpine?",
      "Can you recommend snowshoeing options near Alpine?",
      "Any good snowshoeing tours around Alpine?",
      "Tell me about snowshoeing experiences in Alpine",
      "Are there scenic or family-friendly snowshoeing areas near Alpine?"
    ],
    "response": "Here’s a local guide to snowshoeing around Alpine. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "snowshoeing"
    ],
    "tags": [
      "snowshoeing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best snowshoeing spots in Victor?",
      "Can you recommend snowshoeing options near Victor?",
      "Any good snowshoeing tours around Victor?",
      "Tell me about snowshoeing experiences in Victor",
      "Are there scenic or family-friendly snowshoeing areas near Victor?"
    ],
    "response": "Here’s a local guide to snowshoeing around Victor. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "snowshoeing"
    ],
    "tags": [
      "snowshoeing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best snowshoeing spots in Kelly?",
      "Can you recommend snowshoeing options near Kelly?",
      "Any good snowshoeing tours around Kelly?",
      "Tell me about snowshoeing experiences in Kelly",
      "Are there scenic or family-friendly snowshoeing areas near Kelly?"
    ],
    "response": "Here’s a local guide to snowshoeing around Kelly. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "snowshoeing"
    ],
    "tags": [
      "snowshoeing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best après-ski spots in Jackson?",
      "Can you recommend après-ski options near Jackson?",
      "Any good après-ski tours around Jackson?",
      "Tell me about après-ski experiences in Jackson",
      "Are there scenic or family-friendly après-ski areas near Jackson?"
    ],
    "response": "Here’s a local guide to après-ski around Jackson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "après-ski"
    ],
    "tags": [
      "apres_ski",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best après-ski spots in Driggs?",
      "Can you recommend après-ski options near Driggs?",
      "Any good après-ski tours around Driggs?",
      "Tell me about après-ski experiences in Driggs",
      "Are there scenic or family-friendly après-ski areas near Driggs?"
    ],
    "response": "Here’s a local guide to après-ski around Driggs. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "après-ski"
    ],
    "tags": [
      "apres_ski",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best après-ski spots in Teton Village?",
      "Can you recommend après-ski options near Teton Village?",
      "Any good après-ski tours around Teton Village?",
      "Tell me about après-ski experiences in Teton Village",
      "Are there scenic or family-friendly après-ski areas near Teton Village?"
    ],
    "response": "Here’s a local guide to après-ski around Teton Village. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "après-ski"
    ],
    "tags": [
      "apres_ski",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best après-ski spots in Snow King?",
      "Can you recommend après-ski options near Snow King?",
      "Any good après-ski tours around Snow King?",
      "Tell me about après-ski experiences in Snow King",
      "Are there scenic or family-friendly après-ski areas near Snow King?"
    ],
    "response": "Here’s a local guide to après-ski around Snow King. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "après-ski"
    ],
    "tags": [
      "apres_ski",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best après-ski spots in Grand Targhee?",
      "Can you recommend après-ski options near Grand Targhee?",
      "Any good après-ski tours around Grand Targhee?",
      "Tell me about après-ski experiences in Grand Targhee",
      "Are there scenic or family-friendly après-ski areas near Grand Targhee?"
    ],
    "response": "Here’s a local guide to après-ski around Grand Targhee. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "après-ski"
    ],
    "tags": [
      "apres_ski",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best après-ski spots in Hoback?",
      "Can you recommend après-ski options near Hoback?",
      "Any good après-ski tours around Hoback?",
      "Tell me about après-ski experiences in Hoback",
      "Are there scenic or family-friendly après-ski areas near Hoback?"
    ],
    "response": "Here’s a local guide to après-ski around Hoback. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "après-ski"
    ],
    "tags": [
      "apres_ski",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best après-ski spots in Wilson?",
      "Can you recommend après-ski options near Wilson?",
      "Any good après-ski tours around Wilson?",
      "Tell me about après-ski experiences in Wilson",
      "Are there scenic or family-friendly après-ski areas near Wilson?"
    ],
    "response": "Here’s a local guide to après-ski around Wilson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "après-ski"
    ],
    "tags": [
      "apres_ski",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best après-ski spots in Alpine?",
      "Can you recommend après-ski options near Alpine?",
      "Any good après-ski tours around Alpine?",
      "Tell me about après-ski experiences in Alpine",
      "Are there scenic or family-friendly après-ski areas near Alpine?"
    ],
    "response": "Here’s a local guide to après-ski around Alpine. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "après-ski"
    ],
    "tags": [
      "apres_ski",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best après-ski spots in Victor?",
      "Can you recommend après-ski options near Victor?",
      "Any good après-ski tours around Victor?",
      "Tell me about après-ski experiences in Victor",
      "Are there scenic or family-friendly après-ski areas near Victor?"
    ],
    "response": "Here’s a local guide to après-ski around Victor. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "après-ski"
    ],
    "tags": [
      "apres_ski",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best après-ski spots in Kelly?",
      "Can you recommend après-ski options near Kelly?",
      "Any good après-ski tours around Kelly?",
      "Tell me about après-ski experiences in Kelly",
      "Are there scenic or family-friendly après-ski areas near Kelly?"
    ],
    "response": "Here’s a local guide to après-ski around Kelly. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "après-ski"
    ],
    "tags": [
      "apres_ski",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best ice climbing spots in Jackson?",
      "Can you recommend ice climbing options near Jackson?",
      "Any good ice climbing tours around Jackson?",
      "Tell me about ice climbing experiences in Jackson",
      "Are there scenic or family-friendly ice climbing areas near Jackson?"
    ],
    "response": "Here’s a local guide to ice climbing around Jackson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "ice climbing"
    ],
    "tags": [
      "ice_climbing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best ice climbing spots in Driggs?",
      "Can you recommend ice climbing options near Driggs?",
      "Any good ice climbing tours around Driggs?",
      "Tell me about ice climbing experiences in Driggs",
      "Are there scenic or family-friendly ice climbing areas near Driggs?"
    ],
    "response": "Here’s a local guide to ice climbing around Driggs. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "ice climbing"
    ],
    "tags": [
      "ice_climbing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best ice climbing spots in Teton Village?",
      "Can you recommend ice climbing options near Teton Village?",
      "Any good ice climbing tours around Teton Village?",
      "Tell me about ice climbing experiences in Teton Village",
      "Are there scenic or family-friendly ice climbing areas near Teton Village?"
    ],
    "response": "Here’s a local guide to ice climbing around Teton Village. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "ice climbing"
    ],
    "tags": [
      "ice_climbing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best ice climbing spots in Snow King?",
      "Can you recommend ice climbing options near Snow King?",
      "Any good ice climbing tours around Snow King?",
      "Tell me about ice climbing experiences in Snow King",
      "Are there scenic or family-friendly ice climbing areas near Snow King?"
    ],
    "response": "Here’s a local guide to ice climbing around Snow King. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "ice climbing"
    ],
    "tags": [
      "ice_climbing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best ice climbing spots in Grand Targhee?",
      "Can you recommend ice climbing options near Grand Targhee?",
      "Any good ice climbing tours around Grand Targhee?",
      "Tell me about ice climbing experiences in Grand Targhee",
      "Are there scenic or family-friendly ice climbing areas near Grand Targhee?"
    ],
    "response": "Here’s a local guide to ice climbing around Grand Targhee. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "ice climbing"
    ],
    "tags": [
      "ice_climbing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best ice climbing spots in Hoback?",
      "Can you recommend ice climbing options near Hoback?",
      "Any good ice climbing tours around Hoback?",
      "Tell me about ice climbing experiences in Hoback",
      "Are there scenic or family-friendly ice climbing areas near Hoback?"
    ],
    "response": "Here’s a local guide to ice climbing around Hoback. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "ice climbing"
    ],
    "tags": [
      "ice_climbing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best ice climbing spots in Wilson?",
      "Can you recommend ice climbing options near Wilson?",
      "Any good ice climbing tours around Wilson?",
      "Tell me about ice climbing experiences in Wilson",
      "Are there scenic or family-friendly ice climbing areas near Wilson?"
    ],
    "response": "Here’s a local guide to ice climbing around Wilson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "ice climbing"
    ],
    "tags": [
      "ice_climbing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best ice climbing spots in Alpine?",
      "Can you recommend ice climbing options near Alpine?",
      "Any good ice climbing tours around Alpine?",
      "Tell me about ice climbing experiences in Alpine",
      "Are there scenic or family-friendly ice climbing areas near Alpine?"
    ],
    "response": "Here’s a local guide to ice climbing around Alpine. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "ice climbing"
    ],
    "tags": [
      "ice_climbing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best ice climbing spots in Victor?",
      "Can you recommend ice climbing options near Victor?",
      "Any good ice climbing tours around Victor?",
      "Tell me about ice climbing experiences in Victor",
      "Are there scenic or family-friendly ice climbing areas near Victor?"
    ],
    "response": "Here’s a local guide to ice climbing around Victor. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "ice climbing"
    ],
    "tags": [
      "ice_climbing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best ice climbing spots in Kelly?",
      "Can you recommend ice climbing options near Kelly?",
      "Any good ice climbing tours around Kelly?",
      "Tell me about ice climbing experiences in Kelly",
      "Are there scenic or family-friendly ice climbing areas near Kelly?"
    ],
    "response": "Here’s a local guide to ice climbing around Kelly. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "ice climbing"
    ],
    "tags": [
      "ice_climbing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Jackson Town Square spots in Jackson?",
      "Can you recommend Jackson Town Square options near Jackson?",
      "Any good Jackson Town Square tours around Jackson?",
      "Tell me about Jackson Town Square experiences in Jackson",
      "Are there scenic or family-friendly Jackson Town Square areas near Jackson?"
    ],
    "response": "Here’s a local guide to Jackson Town Square around Jackson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Jackson Town Square"
    ],
    "tags": [
      "jackson_square",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Jackson Town Square spots in Driggs?",
      "Can you recommend Jackson Town Square options near Driggs?",
      "Any good Jackson Town Square tours around Driggs?",
      "Tell me about Jackson Town Square experiences in Driggs",
      "Are there scenic or family-friendly Jackson Town Square areas near Driggs?"
    ],
    "response": "Here’s a local guide to Jackson Town Square around Driggs. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Jackson Town Square"
    ],
    "tags": [
      "jackson_square",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Jackson Town Square spots in Teton Village?",
      "Can you recommend Jackson Town Square options near Teton Village?",
      "Any good Jackson Town Square tours around Teton Village?",
      "Tell me about Jackson Town Square experiences in Teton Village",
      "Are there scenic or family-friendly Jackson Town Square areas near Teton Village?"
    ],
    "response": "Here’s a local guide to Jackson Town Square around Teton Village. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Jackson Town Square"
    ],
    "tags": [
      "jackson_square",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Jackson Town Square spots in Snow King?",
      "Can you recommend Jackson Town Square options near Snow King?",
      "Any good Jackson Town Square tours around Snow King?",
      "Tell me about Jackson Town Square experiences in Snow King",
      "Are there scenic or family-friendly Jackson Town Square areas near Snow King?"
    ],
    "response": "Here’s a local guide to Jackson Town Square around Snow King. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Jackson Town Square"
    ],
    "tags": [
      "jackson_square",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Jackson Town Square spots in Grand Targhee?",
      "Can you recommend Jackson Town Square options near Grand Targhee?",
      "Any good Jackson Town Square tours around Grand Targhee?",
      "Tell me about Jackson Town Square experiences in Grand Targhee",
      "Are there scenic or family-friendly Jackson Town Square areas near Grand Targhee?"
    ],
    "response": "Here’s a local guide to Jackson Town Square around Grand Targhee. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Jackson Town Square"
    ],
    "tags": [
      "jackson_square",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Jackson Town Square spots in Hoback?",
      "Can you recommend Jackson Town Square options near Hoback?",
      "Any good Jackson Town Square tours around Hoback?",
      "Tell me about Jackson Town Square experiences in Hoback",
      "Are there scenic or family-friendly Jackson Town Square areas near Hoback?"
    ],
    "response": "Here’s a local guide to Jackson Town Square around Hoback. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Jackson Town Square"
    ],
    "tags": [
      "jackson_square",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Jackson Town Square spots in Wilson?",
      "Can you recommend Jackson Town Square options near Wilson?",
      "Any good Jackson Town Square tours around Wilson?",
      "Tell me about Jackson Town Square experiences in Wilson",
      "Are there scenic or family-friendly Jackson Town Square areas near Wilson?"
    ],
    "response": "Here’s a local guide to Jackson Town Square around Wilson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Jackson Town Square"
    ],
    "tags": [
      "jackson_square",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Jackson Town Square spots in Alpine?",
      "Can you recommend Jackson Town Square options near Alpine?",
      "Any good Jackson Town Square tours around Alpine?",
      "Tell me about Jackson Town Square experiences in Alpine",
      "Are there scenic or family-friendly Jackson Town Square areas near Alpine?"
    ],
    "response": "Here’s a local guide to Jackson Town Square around Alpine. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Jackson Town Square"
    ],
    "tags": [
      "jackson_square",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Jackson Town Square spots in Victor?",
      "Can you recommend Jackson Town Square options near Victor?",
      "Any good Jackson Town Square tours around Victor?",
      "Tell me about Jackson Town Square experiences in Victor",
      "Are there scenic or family-friendly Jackson Town Square areas near Victor?"
    ],
    "response": "Here’s a local guide to Jackson Town Square around Victor. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Jackson Town Square"
    ],
    "tags": [
      "jackson_square",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Jackson Town Square spots in Kelly?",
      "Can you recommend Jackson Town Square options near Kelly?",
      "Any good Jackson Town Square tours around Kelly?",
      "Tell me about Jackson Town Square experiences in Kelly",
      "Are there scenic or family-friendly Jackson Town Square areas near Kelly?"
    ],
    "response": "Here’s a local guide to Jackson Town Square around Kelly. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Jackson Town Square"
    ],
    "tags": [
      "jackson_square",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best moose viewing spots in Jackson?",
      "Can you recommend moose viewing options near Jackson?",
      "Any good moose viewing tours around Jackson?",
      "Tell me about moose viewing experiences in Jackson",
      "Are there scenic or family-friendly moose viewing areas near Jackson?"
    ],
    "response": "Here’s a local guide to moose viewing around Jackson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "moose viewing"
    ],
    "tags": [
      "moose_wildlife",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best moose viewing spots in Driggs?",
      "Can you recommend moose viewing options near Driggs?",
      "Any good moose viewing tours around Driggs?",
      "Tell me about moose viewing experiences in Driggs",
      "Are there scenic or family-friendly moose viewing areas near Driggs?"
    ],
    "response": "Here’s a local guide to moose viewing around Driggs. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "moose viewing"
    ],
    "tags": [
      "moose_wildlife",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best moose viewing spots in Teton Village?",
      "Can you recommend moose viewing options near Teton Village?",
      "Any good moose viewing tours around Teton Village?",
      "Tell me about moose viewing experiences in Teton Village",
      "Are there scenic or family-friendly moose viewing areas near Teton Village?"
    ],
    "response": "Here’s a local guide to moose viewing around Teton Village. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "moose viewing"
    ],
    "tags": [
      "moose_wildlife",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best moose viewing spots in Snow King?",
      "Can you recommend moose viewing options near Snow King?",
      "Any good moose viewing tours around Snow King?",
      "Tell me about moose viewing experiences in Snow King",
      "Are there scenic or family-friendly moose viewing areas near Snow King?"
    ],
    "response": "Here’s a local guide to moose viewing around Snow King. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "moose viewing"
    ],
    "tags": [
      "moose_wildlife",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best moose viewing spots in Grand Targhee?",
      "Can you recommend moose viewing options near Grand Targhee?",
      "Any good moose viewing tours around Grand Targhee?",
      "Tell me about moose viewing experiences in Grand Targhee",
      "Are there scenic or family-friendly moose viewing areas near Grand Targhee?"
    ],
    "response": "Here’s a local guide to moose viewing around Grand Targhee. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "moose viewing"
    ],
    "tags": [
      "moose_wildlife",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best moose viewing spots in Hoback?",
      "Can you recommend moose viewing options near Hoback?",
      "Any good moose viewing tours around Hoback?",
      "Tell me about moose viewing experiences in Hoback",
      "Are there scenic or family-friendly moose viewing areas near Hoback?"
    ],
    "response": "Here’s a local guide to moose viewing around Hoback. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "moose viewing"
    ],
    "tags": [
      "moose_wildlife",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best moose viewing spots in Wilson?",
      "Can you recommend moose viewing options near Wilson?",
      "Any good moose viewing tours around Wilson?",
      "Tell me about moose viewing experiences in Wilson",
      "Are there scenic or family-friendly moose viewing areas near Wilson?"
    ],
    "response": "Here’s a local guide to moose viewing around Wilson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "moose viewing"
    ],
    "tags": [
      "moose_wildlife",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best moose viewing spots in Alpine?",
      "Can you recommend moose viewing options near Alpine?",
      "Any good moose viewing tours around Alpine?",
      "Tell me about moose viewing experiences in Alpine",
      "Are there scenic or family-friendly moose viewing areas near Alpine?"
    ],
    "response": "Here’s a local guide to moose viewing around Alpine. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "moose viewing"
    ],
    "tags": [
      "moose_wildlife",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best moose viewing spots in Victor?",
      "Can you recommend moose viewing options near Victor?",
      "Any good moose viewing tours around Victor?",
      "Tell me about moose viewing experiences in Victor",
      "Are there scenic or family-friendly moose viewing areas near Victor?"
    ],
    "response": "Here’s a local guide to moose viewing around Victor. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "moose viewing"
    ],
    "tags": [
      "moose_wildlife",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best moose viewing spots in Kelly?",
      "Can you recommend moose viewing options near Kelly?",
      "Any good moose viewing tours around Kelly?",
      "Tell me about moose viewing experiences in Kelly",
      "Are there scenic or family-friendly moose viewing areas near Kelly?"
    ],
    "response": "Here’s a local guide to moose viewing around Kelly. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "moose viewing"
    ],
    "tags": [
      "moose_wildlife",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best scenic turnouts spots in Jackson?",
      "Can you recommend scenic turnouts options near Jackson?",
      "Any good scenic turnouts tours around Jackson?",
      "Tell me about scenic turnouts experiences in Jackson",
      "Are there scenic or family-friendly scenic turnouts areas near Jackson?"
    ],
    "response": "Here’s a local guide to scenic turnouts around Jackson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "scenic turnouts"
    ],
    "tags": [
      "scenic_views",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best scenic turnouts spots in Driggs?",
      "Can you recommend scenic turnouts options near Driggs?",
      "Any good scenic turnouts tours around Driggs?",
      "Tell me about scenic turnouts experiences in Driggs",
      "Are there scenic or family-friendly scenic turnouts areas near Driggs?"
    ],
    "response": "Here’s a local guide to scenic turnouts around Driggs. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "scenic turnouts"
    ],
    "tags": [
      "scenic_views",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best scenic turnouts spots in Teton Village?",
      "Can you recommend scenic turnouts options near Teton Village?",
      "Any good scenic turnouts tours around Teton Village?",
      "Tell me about scenic turnouts experiences in Teton Village",
      "Are there scenic or family-friendly scenic turnouts areas near Teton Village?"
    ],
    "response": "Here’s a local guide to scenic turnouts around Teton Village. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "scenic turnouts"
    ],
    "tags": [
      "scenic_views",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best scenic turnouts spots in Snow King?",
      "Can you recommend scenic turnouts options near Snow King?",
      "Any good scenic turnouts tours around Snow King?",
      "Tell me about scenic turnouts experiences in Snow King",
      "Are there scenic or family-friendly scenic turnouts areas near Snow King?"
    ],
    "response": "Here’s a local guide to scenic turnouts around Snow King. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "scenic turnouts"
    ],
    "tags": [
      "scenic_views",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best scenic turnouts spots in Grand Targhee?",
      "Can you recommend scenic turnouts options near Grand Targhee?",
      "Any good scenic turnouts tours around Grand Targhee?",
      "Tell me about scenic turnouts experiences in Grand Targhee",
      "Are there scenic or family-friendly scenic turnouts areas near Grand Targhee?"
    ],
    "response": "Here’s a local guide to scenic turnouts around Grand Targhee. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "scenic turnouts"
    ],
    "tags": [
      "scenic_views",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best scenic turnouts spots in Hoback?",
      "Can you recommend scenic turnouts options near Hoback?",
      "Any good scenic turnouts tours around Hoback?",
      "Tell me about scenic turnouts experiences in Hoback",
      "Are there scenic or family-friendly scenic turnouts areas near Hoback?"
    ],
    "response": "Here’s a local guide to scenic turnouts around Hoback. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "scenic turnouts"
    ],
    "tags": [
      "scenic_views",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best scenic turnouts spots in Wilson?",
      "Can you recommend scenic turnouts options near Wilson?",
      "Any good scenic turnouts tours around Wilson?",
      "Tell me about scenic turnouts experiences in Wilson",
      "Are there scenic or family-friendly scenic turnouts areas near Wilson?"
    ],
    "response": "Here’s a local guide to scenic turnouts around Wilson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "scenic turnouts"
    ],
    "tags": [
      "scenic_views",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best scenic turnouts spots in Alpine?",
      "Can you recommend scenic turnouts options near Alpine?",
      "Any good scenic turnouts tours around Alpine?",
      "Tell me about scenic turnouts experiences in Alpine",
      "Are there scenic or family-friendly scenic turnouts areas near Alpine?"
    ],
    "response": "Here’s a local guide to scenic turnouts around Alpine. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "scenic turnouts"
    ],
    "tags": [
      "scenic_views",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best scenic turnouts spots in Victor?",
      "Can you recommend scenic turnouts options near Victor?",
      "Any good scenic turnouts tours around Victor?",
      "Tell me about scenic turnouts experiences in Victor",
      "Are there scenic or family-friendly scenic turnouts areas near Victor?"
    ],
    "response": "Here’s a local guide to scenic turnouts around Victor. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "scenic turnouts"
    ],
    "tags": [
      "scenic_views",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best scenic turnouts spots in Kelly?",
      "Can you recommend scenic turnouts options near Kelly?",
      "Any good scenic turnouts tours around Kelly?",
      "Tell me about scenic turnouts experiences in Kelly",
      "Are there scenic or family-friendly scenic turnouts areas near Kelly?"
    ],
    "response": "Here’s a local guide to scenic turnouts around Kelly. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "scenic turnouts"
    ],
    "tags": [
      "scenic_views",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Tetons photography spots in Jackson?",
      "Can you recommend Tetons photography options near Jackson?",
      "Any good Tetons photography tours around Jackson?",
      "Tell me about Tetons photography experiences in Jackson",
      "Are there scenic or family-friendly Tetons photography areas near Jackson?"
    ],
    "response": "Here’s a local guide to Tetons photography around Jackson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Tetons photography"
    ],
    "tags": [
      "photo_spots",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Tetons photography spots in Driggs?",
      "Can you recommend Tetons photography options near Driggs?",
      "Any good Tetons photography tours around Driggs?",
      "Tell me about Tetons photography experiences in Driggs",
      "Are there scenic or family-friendly Tetons photography areas near Driggs?"
    ],
    "response": "Here’s a local guide to Tetons photography around Driggs. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Tetons photography"
    ],
    "tags": [
      "photo_spots",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Tetons photography spots in Teton Village?",
      "Can you recommend Tetons photography options near Teton Village?",
      "Any good Tetons photography tours around Teton Village?",
      "Tell me about Tetons photography experiences in Teton Village",
      "Are there scenic or family-friendly Tetons photography areas near Teton Village?"
    ],
    "response": "Here’s a local guide to Tetons photography around Teton Village. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Tetons photography"
    ],
    "tags": [
      "photo_spots",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Tetons photography spots in Snow King?",
      "Can you recommend Tetons photography options near Snow King?",
      "Any good Tetons photography tours around Snow King?",
      "Tell me about Tetons photography experiences in Snow King",
      "Are there scenic or family-friendly Tetons photography areas near Snow King?"
    ],
    "response": "Here’s a local guide to Tetons photography around Snow King. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Tetons photography"
    ],
    "tags": [
      "photo_spots",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Tetons photography spots in Grand Targhee?",
      "Can you recommend Tetons photography options near Grand Targhee?",
      "Any good Tetons photography tours around Grand Targhee?",
      "Tell me about Tetons photography experiences in Grand Targhee",
      "Are there scenic or family-friendly Tetons photography areas near Grand Targhee?"
    ],
    "response": "Here’s a local guide to Tetons photography around Grand Targhee. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Tetons photography"
    ],
    "tags": [
      "photo_spots",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Tetons photography spots in Hoback?",
      "Can you recommend Tetons photography options near Hoback?",
      "Any good Tetons photography tours around Hoback?",
      "Tell me about Tetons photography experiences in Hoback",
      "Are there scenic or family-friendly Tetons photography areas near Hoback?"
    ],
    "response": "Here’s a local guide to Tetons photography around Hoback. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Tetons photography"
    ],
    "tags": [
      "photo_spots",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Tetons photography spots in Wilson?",
      "Can you recommend Tetons photography options near Wilson?",
      "Any good Tetons photography tours around Wilson?",
      "Tell me about Tetons photography experiences in Wilson",
      "Are there scenic or family-friendly Tetons photography areas near Wilson?"
    ],
    "response": "Here’s a local guide to Tetons photography around Wilson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Tetons photography"
    ],
    "tags": [
      "photo_spots",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Tetons photography spots in Alpine?",
      "Can you recommend Tetons photography options near Alpine?",
      "Any good Tetons photography tours around Alpine?",
      "Tell me about Tetons photography experiences in Alpine",
      "Are there scenic or family-friendly Tetons photography areas near Alpine?"
    ],
    "response": "Here’s a local guide to Tetons photography around Alpine. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Tetons photography"
    ],
    "tags": [
      "photo_spots",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Tetons photography spots in Victor?",
      "Can you recommend Tetons photography options near Victor?",
      "Any good Tetons photography tours around Victor?",
      "Tell me about Tetons photography experiences in Victor",
      "Are there scenic or family-friendly Tetons photography areas near Victor?"
    ],
    "response": "Here’s a local guide to Tetons photography around Victor. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Tetons photography"
    ],
    "tags": [
      "photo_spots",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best Tetons photography spots in Kelly?",
      "Can you recommend Tetons photography options near Kelly?",
      "Any good Tetons photography tours around Kelly?",
      "Tell me about Tetons photography experiences in Kelly",
      "Are there scenic or family-friendly Tetons photography areas near Kelly?"
    ],
    "response": "Here’s a local guide to Tetons photography around Kelly. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "Tetons photography"
    ],
    "tags": [
      "photo_spots",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best winter gear rentals spots in Jackson?",
      "Can you recommend winter gear rentals options near Jackson?",
      "Any good winter gear rentals tours around Jackson?",
      "Tell me about winter gear rentals experiences in Jackson",
      "Are there scenic or family-friendly winter gear rentals areas near Jackson?"
    ],
    "response": "Here’s a local guide to winter gear rentals around Jackson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "winter gear rentals"
    ],
    "tags": [
      "gear_rentals",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best winter gear rentals spots in Driggs?",
      "Can you recommend winter gear rentals options near Driggs?",
      "Any good winter gear rentals tours around Driggs?",
      "Tell me about winter gear rentals experiences in Driggs",
      "Are there scenic or family-friendly winter gear rentals areas near Driggs?"
    ],
    "response": "Here’s a local guide to winter gear rentals around Driggs. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "winter gear rentals"
    ],
    "tags": [
      "gear_rentals",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best winter gear rentals spots in Teton Village?",
      "Can you recommend winter gear rentals options near Teton Village?",
      "Any good winter gear rentals tours around Teton Village?",
      "Tell me about winter gear rentals experiences in Teton Village",
      "Are there scenic or family-friendly winter gear rentals areas near Teton Village?"
    ],
    "response": "Here’s a local guide to winter gear rentals around Teton Village. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "winter gear rentals"
    ],
    "tags": [
      "gear_rentals",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best winter gear rentals spots in Snow King?",
      "Can you recommend winter gear rentals options near Snow King?",
      "Any good winter gear rentals tours around Snow King?",
      "Tell me about winter gear rentals experiences in Snow King",
      "Are there scenic or family-friendly winter gear rentals areas near Snow King?"
    ],
    "response": "Here’s a local guide to winter gear rentals around Snow King. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "winter gear rentals"
    ],
    "tags": [
      "gear_rentals",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best winter gear rentals spots in Grand Targhee?",
      "Can you recommend winter gear rentals options near Grand Targhee?",
      "Any good winter gear rentals tours around Grand Targhee?",
      "Tell me about winter gear rentals experiences in Grand Targhee",
      "Are there scenic or family-friendly winter gear rentals areas near Grand Targhee?"
    ],
    "response": "Here’s a local guide to winter gear rentals around Grand Targhee. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "winter gear rentals"
    ],
    "tags": [
      "gear_rentals",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best winter gear rentals spots in Hoback?",
      "Can you recommend winter gear rentals options near Hoback?",
      "Any good winter gear rentals tours around Hoback?",
      "Tell me about winter gear rentals experiences in Hoback",
      "Are there scenic or family-friendly winter gear rentals areas near Hoback?"
    ],
    "response": "Here’s a local guide to winter gear rentals around Hoback. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "winter gear rentals"
    ],
    "tags": [
      "gear_rentals",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best winter gear rentals spots in Wilson?",
      "Can you recommend winter gear rentals options near Wilson?",
      "Any good winter gear rentals tours around Wilson?",
      "Tell me about winter gear rentals experiences in Wilson",
      "Are there scenic or family-friendly winter gear rentals areas near Wilson?"
    ],
    "response": "Here’s a local guide to winter gear rentals around Wilson. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "winter gear rentals"
    ],
    "tags": [
      "gear_rentals",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best winter gear rentals spots in Alpine?",
      "Can you recommend winter gear rentals options near Alpine?",
      "Any good winter gear rentals tours around Alpine?",
      "Tell me about winter gear rentals experiences in Alpine",
      "Are there scenic or family-friendly winter gear rentals areas near Alpine?"
    ],
    "response": "Here’s a local guide to winter gear rentals around Alpine. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "winter gear rentals"
    ],
    "tags": [
      "gear_rentals",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best winter gear rentals spots in Victor?",
      "Can you recommend winter gear rentals options near Victor?",
      "Any good winter gear rentals tours around Victor?",
      "Tell me about winter gear rentals experiences in Victor",
      "Are there scenic or family-friendly winter gear rentals areas near Victor?"
    ],
    "response": "Here’s a local guide to winter gear rentals around Victor. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "winter gear rentals"
    ],
    "tags": [
      "gear_rentals",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best winter gear rentals spots in Kelly?",
      "Can you recommend winter gear rentals options near Kelly?",
      "Any good winter gear rentals tours around Kelly?",
      "Tell me about winter gear rentals experiences in Kelly",
      "Are there scenic or family-friendly winter gear rentals areas near Kelly?"
    ],
    "response": "Here’s a local guide to winter gear rentals around Kelly. You’ll find practical tips, scenic suggestions, and gear info when available.",
    "keywords": [
      "winter gear rentals"
    ],
    "tags": [
      "gear_rentals",
      "jackson_driggs"
    ]
  }
]