[
  {
    "patterns": [
      "Is there road construction in Yellowstone?",
      "Is Yellowstone doing any road work?",
      "Should I expect construction delays in Yellowstone?"
    ],
    "response": "Yes, there's road construction in Yellowstone almost every year — it's how we keep this place safe and accessible for millions of visitors. In 2025, expect delays of up to 30 minutes in several areas due to bridge work, chip sealing, and realignment projects. Before you drive, check the official NPS construction updates at https://www.nps.gov/yell/planyourvisit/road-construction.htm or text 82190 to 888-777 to get real-time alerts to your phone.",
    "tags": [
      "road conditions",
      "trip planning",
      "seasonal travel"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "How long does Yellowstone road construction usually last?",
      "When will the road construction in Yellowstone be done?",
      "Are Yellowstone roads under construction all season?"
    ],
    "response": "Construction in Yellowstone generally runs from spring until late fall — but some projects carry over into the next year. Crews work through summer to avoid the harsh winter season. Timing varies by location, so always check the current project list here: https://www.nps.gov/yell/planyourvisit/road-construction.htm.",
    "tags": [
      "road conditions",
      "planning tips",
      "seasonal travel"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "Why is there so much construction in Yellowstone?",
      "What’s the purpose of all the Yellowstone road work?",
      "Why does the park always have construction?"
    ],
    "response": "Yellowstone is big — and old. Many roads, bridges, and pullouts were built decades ago and see millions of visitors a year. Construction protects you, preserves the park, and improves access to places like fishing pullouts, scenic overlooks, and trailheads. You can follow major projects at https://www.nps.gov/yell/planyourvisit/road-construction.htm.",
    "tags": [
      "infrastructure",
      "park maintenance",
      "visitor safety"
    ]
  },
  {
    "patterns": [
      "Will construction affect my Yellowstone visit?",
      "Should I plan around road work in Yellowstone?",
      "Can road work cause major delays in Yellowstone?"
    ],
    "response": "It can, especially during peak months (June–September). You might hit flagged zones with 15–30 minute delays or detours. Some trailheads or picnic areas may be closed near work zones. Plan ahead with updates at https://www.nps.gov/yell/planyourvisit/road-construction.htm and text alerts (text 82190 to 888-777).",
    "tags": [
      "trip planning",
      "road conditions",
      "seasonal info"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "Is Yellowstone open during construction?",
      "Can I still enter Yellowstone if there's road work?",
      "Are park entrances affected by construction?"
    ],
    "response": "Yes, all five park entrances generally stay open even when construction is underway. Occasional night paving may temporarily impact one-lane travel, but full closures are rare. If you're unsure, check live road status maps here: https://www.nps.gov/yell/planyourvisit/parkroads.htm or call (307) 344-2117.",
    "tags": [
      "park access",
      "visitor info",
      "seasonal updates"
    ]
  },
  {
    "patterns": [
      "How can I avoid construction zones in Yellowstone?",
      "Are there alternate routes to avoid construction?",
      "What’s the best way to drive around construction in the park?"
    ],
    "response": "There aren't many detours inside the park — most roads follow a Grand Loop. But you *can* time your drives to avoid peak hours (9am–3pm), or hit major routes early in the morning or just before sunset. Check daily alerts at https://www.nps.gov/yell/planyourvisit/road-construction.htm for project zones.",
    "tags": [
      "planning tips",
      "trip efficiency",
      "road conditions"
    ]
  },
  {
    "patterns": [
      "Are construction delays consistent in Yellowstone?",
      "How often do construction delays happen in the park?",
      "Can I predict Yellowstone road delays?"
    ],
    "response": "Delays are based on work schedules, weather, and even wildlife activity. Some days you’ll breeze through, other days you’ll wait. Park rangers recommend checking conditions the morning of your drive at https://www.nps.gov/yell/planyourvisit/parkroads.htm or texting 82190 to 888-777.",
    "tags": [
      "real-time info",
      "road conditions",
      "visitor tips"
    ]
  },
  {
    "patterns": [
      "Does construction affect parking in Yellowstone?",
      "Are pullouts closed due to construction?",
      "Will I still be able to park with construction happening?"
    ],
    "response": "Some construction zones do affect roadside pullouts or parking areas — especially near bridges or trailheads. If a scenic overlook is under construction, it’s best to use nearby alternatives. Park updates here: https://www.nps.gov/yell/planyourvisit/road-construction.htm.",
    "tags": [
      "parking",
      "road safety",
      "planning advice"
    ]
  },
  {
    "patterns": [
      "Where can I get updates on Yellowstone construction?",
      "How do I check road work in Yellowstone?",
      "What's the best source for construction alerts?"
    ],
    "response": "The official NPS road construction page is your best resource: https://www.nps.gov/yell/planyourvisit/road-construction.htm. For live road alerts, text 82190 to 888-777 or call (307) 344-2117 for recorded updates. Local visitor centers also post daily road info.",
    "tags": [
      "alerts",
      "mobile updates",
      "road conditions"
    ]
  },
  {
    "patterns": [
      "Are roads open 24 hours even with construction?",
      "Can I drive at night during construction?",
      "Do construction zones close Yellowstone roads overnight?"
    ],
    "response": "Yes, roads generally stay open 24/7 even during major projects. However, active construction zones may have temporary one-lane controls or equipment nearby — so keep headlights on, go slow, and expect loose gravel. Check current status at https://www.nps.gov/yell/planyourvisit/road-construction.htm.",
    "tags": [
      "night driving",
      "road safety",
      "travel tips"
    ]
  }
]