[
  {
    "patterns": [
      "What are the mountain stats for Jackson Hole?",
      "How big is Jackson Hole Mountain Resort?",
      "Tell me about the terrain difficulty at JHMR.",
      "How many trails does Jackson Hole have?",
      "What’s the vertical drop at Jackson Hole?"
    ],
    "response": "Jackson Hole Mountain Resort features over 2,500+ acres of terrain, with a vertical drop of 4,139 ft, 133+ trails, and terrain difficulty of 10% beginner, 40% intermediate, and 50% expert. Summit elevation is 10,450 ft.",
    "keywords": [
      "jackson hole",
      "mountain stats",
      "terrain",
      "trails",
      "elevation"
    ],
    "tags": [
      "ski",
      "resort",
      "terrain",
      "jackson"
    ]
  },
  {
    "patterns": [
      "Is the Ikon Pass accepted at Jackson Hole?",
      "Can I ski Jackson with my Ikon Base?",
      "Are there blackout dates for Jackson Hole?",
      "Can I use Ikon at JHMR?"
    ],
    "response": "Yes, the Ikon Pass is accepted, but access is limited to Ikon Base Plus or Full. Blackout dates include late December holidays, MLK weekend, and Presidents' Day weekend.",
    "keywords": [
      "ikon pass",
      "jackson",
      "blackout",
      "access"
    ],
    "tags": [
      "passes",
      "lift access",
      "jackson",
      "ski"
    ]
  },
  {
    "patterns": [
      "How much are day passes at Jackson Hole?",
      "Are there discounts for multi-day tickets at JHMR?",
      "What do lift tickets cost at Jackson Hole?",
      "Where can I buy Jackson Hole ski passes?"
    ],
    "response": "Day passes range from $189–$229 for adults and $85–$100 for kids. Multi-day and half-day options available. Buy online at https://www.jacksonhole.com/lift-tickets.html to avoid sell-outs.",
    "keywords": [
      "lift tickets",
      "day passes",
      "ski pricing",
      "jackson hole"
    ],
    "tags": [
      "tickets",
      "pricing",
      "jackson",
      "ski"
    ]
  },
  {
    "patterns": [
      "Where can I rent skis in Teton Village?",
      "Is there gear rental at Jackson Hole?",
      "Best place for snowboard demos near JHMR?",
      "Can I book ski rentals online for Jackson Hole?"
    ],
    "response": "Try JH Sports, Christy Sports, or Teton Village Sports for rentals. Gear includes skis, snowboards, helmets, boots, and more. Book online: https://www.jacksonhole.com/ski-rentals.html",
    "keywords": [
      "ski rental",
      "gear",
      "jackson",
      "teton village"
    ],
    "tags": [
      "rentals",
      "gear",
      "ski",
      "jackson"
    ]
  },
  {
    "patterns": [
      "Does Jackson Hole offer ski lessons?",
      "What programs are available for kids at JHMR?",
      "Can I take private ski lessons at Jackson Hole?",
      "Tell me about the Steep & Deep Camps"
    ],
    "response": "Yes, Jackson Hole offers private and group lessons, Steep & Deep Camps, and adaptive programs. Book early during holidays or powder weeks: https://www.jacksonhole.com/mountain-sports-school.html",
    "keywords": [
      "ski school",
      "lessons",
      "jackson",
      "steep and deep"
    ],
    "tags": [
      "ski school",
      "instruction",
      "jackson",
      "resort"
    ]
  },
  {
    "patterns": [
      "Any local tips for skiing Jackson Hole?",
      "What are the insider tricks for JHMR?",
      "How can I avoid lift lines at Jackson Hole?",
      "Where should I ski on powder days?",
      "When is the best time to ride the Tram?"
    ],
    "response": "Download the JH Insider app for lift and grooming updates. Ride the First Tram early on powder days. Avoid crowds by skiing Thunder and Sublette mid-morning. Apres ski at Spur or Mangy Moose. Mid-week skiing means fewer lines and fresher tracks.",
    "keywords": [
      "jackson hole",
      "ski tips",
      "local advice",
      "tricks",
      "powder"
    ],
    "tags": [
      "tips",
      "local",
      "ski",
      "jackson"
    ]
  },
  {
    "patterns": [
      "Where do I park for Jackson Hole skiing?",
      "Is there free parking at JHMR?",
      "How do I get to Teton Village without a car?",
      "Does the START Bus go to Jackson Hole Resort?",
      "Are there shuttles from Jackson to the ski area?"
    ],
    "response": "Free parking is available at the Ranch Lot with shuttle access—arrive early. Paid parking garages are under the Tram and Crystal Springs. START Bus offers frequent service from downtown Jackson to the resort. It's the easiest way to skip parking stress.",
    "keywords": [
      "parking",
      "transportation",
      "shuttle",
      "start bus",
      "jackson hole"
    ],
    "tags": [
      "transport",
      "parking",
      "access",
      "jackson",
      "ski"
    ]
  }
]