[
  {
    "patterns": [
      "What is the Teton Crest Trail like?",
      "Can you explain the Teton Crest Trail route?",
      "How far is the Teton Crest Trail?",
      "Where does the Teton Crest Trail start and end?"
    ],
    "response": "The Teton Crest Trail is a 39-mile point-to-point route starting at Phillips Pass (outside the park) and ending at String Lake. With over 9,000 feet of elevation gain, it typically takes 3–5 nights to complete. This trail passes through multiple mountain zones and is extremely popular late July through early September.",
    "keywords": [
      "teton crest",
      "trail",
      "route",
      "grand teton"
    ],
    "tags": [
      "grand_teton",
      "backcountry",
      "teton_crest"
    ]
  },
  {
    "patterns": [
      "Is there a shorter Teton Crest Trail hike using the tram?",
      "How do I take the tram to the backcountry?",
      "What are tram-assisted routes in Grand Teton?",
      "Can I start the Teton Crest Trail at Teton Village?"
    ],
    "response": "Yes, taking the aerial tram from Teton Village reduces elevation gain and distance. Popular tram-assisted options include:\n- Tram to Granite Canyon via Marion Lake: 15 miles (1 night)\n- Tram to Cascade Canyon: 28.6 miles\nA fee is charged for the tram. These are great options for shorter or more accessible starts.",
    "keywords": [
      "tram",
      "teton village",
      "marion lake",
      "short route"
    ],
    "tags": [
      "grand_teton",
      "backcountry",
      "tram_routes"
    ]
  },
  {
    "patterns": [
      "What are some popular backcountry loops in Grand Teton?",
      "Can I hike a loop instead of a point-to-point route?",
      "What loops include the Valley Trail?",
      "Tell me about Cascade/Death Canyon loops."
    ],
    "response": "Popular loop routes include:\n- Cascade Canyon/Paintbrush Loop: 19 miles\n- Granite Canyon/Open Canyon via Valley Trail: 20.2 miles\n- Cascade Canyon/Death Canyon via Static Peak: 25.8 miles (fee for ferry)\nThese offer flexibility and are often 1–2 nights in duration.",
    "keywords": [
      "loop",
      "valley trail",
      "circuit",
      "canyon hike"
    ],
    "tags": [
      "grand_teton",
      "backcountry",
      "loop_routes"
    ]
  },
  {
    "patterns": [
      "How do I choose between a camping zone and an individual site?",
      "What’s the difference between a zone and a site?",
      "Are camping zones marked?",
      "Should I pick a zone or an individual campsite?"
    ],
    "response": "Mountain Camping Zones allow you to camp anywhere within the designated area, often used along the Teton Crest Trail. Individual Sites are signed, designated spots, often with tent pads. Choose a zone if you're flexible; pick a site if you want structure or proximity to specific features.",
    "keywords": [
      "camp zone",
      "individual site",
      "camping",
      "selection"
    ],
    "tags": [
      "grand_teton",
      "backcountry",
      "camp_type"
    ]
  },
  {
    "patterns": [
      "Are campfires allowed in mountain zones?",
      "Can I have a fire in the backcountry?",
      "What are the fire rules in camping zones?",
      "Is cooking over fire allowed on the Teton Crest Trail?"
    ],
    "response": "Campfires are prohibited in all mountain camping zones. Use portable stoves for cooking. Fires are only allowed in designated lakeshore sites with metal grates.",
    "keywords": [
      "campfire",
      "fire rules",
      "cooking",
      "mountain zone"
    ],
    "tags": [
      "grand_teton",
      "backcountry",
      "fire_restrictions"
    ]
  },
  {
    "patterns": [
      "How do I plan daily mileage on the trail?",
      "How far can I hike in a day in the Tetons?",
      "What’s realistic hiking speed in the backcountry?",
      "How should I estimate my backpacking time?"
    ],
    "response": "Plan for about 2 miles per hour, adding 1 hour for every 1,000 feet of elevation gain. Avoid planning routes with more than one major pass per day. Use the backcountry mileage map to assist with realistic planning.",
    "keywords": [
      "mileage",
      "distance",
      "pace",
      "planning"
    ],
    "tags": [
      "grand_teton",
      "backcountry",
      "hiking_time"
    ]
  },
  {
    "patterns": [
      "What are Lakeshore Sites in Grand Teton?",
      "Can I camp on Jackson or Leigh Lake?",
      "Are there fires allowed at lakeshore sites?",
      "Do lakeshore camps have bear boxes?"
    ],
    "response": "Lakeshore Sites along Jackson and Leigh Lakes allow camping near the water. Many are boat-in only. Fires are allowed only in metal grates. Bear boxes are provided and food storage is strictly enforced. WAG bags are required for human waste.",
    "keywords": [
      "lakeshore",
      "jackson lake",
      "leigh lake",
      "boat-in"
    ],
    "tags": [
      "grand_teton",
      "backcountry",
      "lakeshore_sites"
    ]
  },
  {
    "patterns": [
      "What are the Northern Canyons like for backpacking?",
      "Is camping allowed in Berry or Owl Canyon?",
      "Can I camp in Moose Basin or Webb Canyon?",
      "What’s the northern backcountry like?"
    ],
    "response": "Northern Canyons like Berry, Owl, and Webb Canyon are remote and rugged, with high bear activity. Trails may be faint or cross unbridged streams. Hikers must be self-reliant with strong navigation skills. Permits are still required.",
    "keywords": [
      "northern canyons",
      "berry",
      "moose basin",
      "remote camping"
    ],
    "tags": [
      "grand_teton",
      "backcountry",
      "northern_routes"
    ]
  },
  {
    "patterns": [
      "What are group sites in the Grand Teton backcountry?",
      "How many people can camp in a group site?",
      "Do I need a special permit for large groups?",
      "What’s the limit for group camping?"
    ],
    "response": "Group sites are designated for parties of 7 or more. They are marked, have occupancy limits, and must be reserved in advance. Permits for group sites are separate from individual or zone permits.",
    "keywords": [
      "group",
      "large party",
      "permits",
      "camping"
    ],
    "tags": [
      "grand_teton",
      "backcountry",
      "group_sites"
    ]
  },
  {
    "patterns": [
      "Are pets allowed on Jackson Lake?",
      "Can I bring my dog in a boat?",
      "What are the pet rules for lakeshore camping?",
      "Are dogs allowed at Spalding Bay?"
    ],
    "response": "Pets are allowed in boats on Jackson Lake but are not allowed on the shore except at designated boat ramps and Spalding Bay campsites. Pets must be leashed (6 feet or less) and remain physically restrained at all times.",
    "keywords": [
      "pets",
      "dog",
      "jackson lake",
      "boat"
    ],
    "tags": [
      "grand_teton",
      "backcountry",
      "pet_rules"
    ]
  }
]