[
  {
    "patterns": [
      "When does the Craig Thomas Discovery and Visitor Center open?",
      "Is the visitor center in Moose open right now?",
      "What are the hours for Craig Thomas Visitor Center?",
      "Can I visit the Craig Thomas Center in fall?"
    ],
    "response": "The Craig Thomas Discovery and Visitor Center in Moose is open daily from May 1 through October 31. It offers visitor information, park film, exhibits, and a park store. Stop here for permits or planning help during your trip.",
    "keywords": [
      "craig thomas",
      "visitor center",
      "moose",
      "hours",
      "opening"
    ],
    "tags": [
      "grand_teton",
      "facilities",
      "moose",
      "visitor_services"
    ]
  },
  {
    "patterns": [
      "When is Signal Mountain Lodge open?",
      "Can I stay at Signal Mountain Lodge in September?",
      "Is the lodge at Signal Mountain available in May?",
      "What are the 2025 dates for Signal Mountain Lodge?"
    ],
    "response": "Signal Mountain Lodge is open from May 9 to October 12 for the 2025 season. This lakeside lodge provides lodging, dining, a general store, and access to the Signal Mountain Campground and marina.",
    "keywords": [
      "signal mountain",
      "lodge",
      "season",
      "open dates"
    ],
    "tags": [
      "grand_teton",
      "facilities",
      "signal_mountain",
      "lodging"
    ]
  },
  {
    "patterns": [
      "When does Jenny Lake Campground open?",
      "Can I camp at Jenny Lake in July?",
      "What’s the season for Jenny Lake Campground?",
      "Is Jenny Lake Campground open in spring?"
    ],
    "response": "Jenny Lake Campground opens on July 1 and closes September 28 for the 2025 season. This tents-only campground fills quickly and offers walk-in access to some of the park’s most popular trails.",
    "keywords": [
      "jenny lake",
      "campground",
      "camping",
      "season",
      "open dates"
    ],
    "tags": [
      "grand_teton",
      "camping",
      "jenny_lake",
      "facilities"
    ]
  },
  {
    "patterns": [
      "Is the Colter Bay Marina open in May?",
      "When does Colter Bay Marina open in 2025?",
      "What are the hours at Colter Bay Marina?",
      "Can I rent a boat at Colter Bay in spring?"
    ],
    "response": "Colter Bay Marina is scheduled to operate from May 23 to September 21, depending on water levels. This full-service marina includes boat rentals, slips, and nearby stores and restaurants.",
    "keywords": [
      "colter bay",
      "marina",
      "boat rental",
      "open",
      "season"
    ],
    "tags": [
      "grand_teton",
      "facilities",
      "colter_bay",
      "boating"
    ]
  },
  {
    "patterns": [
      "When can I visit the Laurance S. Rockefeller Preserve Center?",
      "Is the Rockefeller Preserve Center open in summer?",
      "What's the schedule for the LSR Preserve in 2025?",
      "Can I go to the preserve center in June?"
    ],
    "response": "The Laurance S. Rockefeller Preserve Center is open from June 2 to September 21. It offers quiet trails, immersive exhibits, and a peaceful setting south of the main Teton Park Road.",
    "keywords": [
      "rockefeller",
      "preserve",
      "laurance",
      "lsr",
      "open"
    ],
    "tags": [
      "grand_teton",
      "facilities",
      "rockefeller_preserve",
      "visitor_services"
    ]
  },
  {
    "patterns": [
      "Is the Jenny Lake Visitor Center open in August?",
      "When does the Jenny Lake Visitor Center close?",
      "Can I stop at the Jenny Lake Visitor Center in September?",
      "Is the visitor center at Jenny Lake operating this summer?"
    ],
    "response": "The Jenny Lake Visitor Center is open from May 14 through September 24. It provides visitor information, exhibits, and a park store. Rangers are available to help with planning hikes and backcountry trips.",
    "keywords": [
      "jenny lake",
      "visitor center",
      "hours",
      "season"
    ],
    "tags": [
      "grand_teton",
      "facilities",
      "jenny_lake",
      "visitor_services"
    ]
  },
  {
    "patterns": [
      "When does Colter Bay Campground open?",
      "Can I camp at Colter Bay in September?",
      "Is Colter Bay Campground open during fall?",
      "What's the closing date for Colter Bay Campground?"
    ],
    "response": "Colter Bay Campground operates from May 22 to September 28. It offers standard, group, hiker/biker, and electric hookup sites in a forested area with access to Jackson Lake and Colter Bay Village amenities.",
    "keywords": [
      "colter bay",
      "campground",
      "camping",
      "open dates"
    ],
    "tags": [
      "grand_teton",
      "camping",
      "colter_bay",
      "facilities"
    ]
  },
  {
    "patterns": [
      "What are the hours for the Colter Bay Visitor Center?",
      "Is the visitor center at Colter Bay open in October?",
      "Can I get permits at Colter Bay in September?",
      "When does the Colter Bay Visitor Center close?"
    ],
    "response": "The Colter Bay Visitor Center is open from May 9 through October 1. You can pick up permits, explore exhibits, talk to rangers, and meet Indigenous Arts Demonstration artists during the summer season.",
    "keywords": [
      "colter bay",
      "visitor center",
      "permits",
      "hours"
    ],
    "tags": [
      "grand_teton",
      "facilities",
      "colter_bay",
      "visitor_services"
    ]
  },
  {
    "patterns": [
      "When is the Headwaters Campground open?",
      "Can I stay at Headwaters Campground in June?",
      "What are the dates for the Flagg Ranch Campground?",
      "Is Headwaters Campground available this fall?"
    ],
    "response": "Headwaters Campground and RV Park at Flagg Ranch is open from May 9 through October 1. It offers full-hookup RV sites, tent camping, and camper cabins. Reservations are required and it’s a great midpoint between Yellowstone and Grand Teton.",
    "keywords": [
      "headwaters",
      "flagg ranch",
      "campground",
      "season"
    ],
    "tags": [
      "grand_teton",
      "facilities",
      "headwaters",
      "camping"
    ]
  },
  {
    "patterns": [
      "Can I take the Jenny Lake boat shuttle in May?",
      "When does the Jenny Lake boat service start?",
      "Is Jenny Lake boating open in September?",
      "What dates is the boat cruise available?"
    ],
    "response": "Jenny Lake Boating, including shuttle and scenic cruises, operates from May 15 through September 30, depending on lake ice conditions. Boats depart frequently from the east shore, providing quick access to Cascade Canyon Trail.",
    "keywords": [
      "jenny lake",
      "boat",
      "shuttle",
      "boating"
    ],
    "tags": [
      "grand_teton",
      "facilities",
      "jenny_lake",
      "boating"
    ]
  },
  {
    "patterns": [
      "When does Jackson Lake Lodge open in 2025?",
      "Is Jackson Lake Lodge open in May?",
      "What are the 2025 dates for Jackson Lake Lodge?",
      "Can I stay at Jackson Lake Lodge in September?"
    ],
    "response": "Jackson Lake Lodge is open from May 16 to October 5 in 2025. This full-service lodge offers lodging, dining, a gift shop, and sweeping views of the Teton Range. The Mural Room, Pioneer Grill, and Blue Heron Lounge are all available during the open season.",
    "keywords": [
      "jackson lake",
      "lodge",
      "season",
      "open dates"
    ],
    "tags": [
      "grand_teton",
      "facilities",
      "jackson_lake_lodge",
      "lodging"
    ]
  },
  {
    "patterns": [
      "When does Signal Mountain Marina close?",
      "Can I use the marina at Signal Mountain in September?",
      "Is Signal Mountain Marina open in summer?",
      "What are the hours for the marina at Signal Mountain?"
    ],
    "response": "Signal Mountain Marina is open from May 17 through September 14. Boaters can rent watercraft or launch their own from this marina on Jackson Lake. It is recommended to check water levels and regulations before arrival.",
    "keywords": [
      "signal mountain",
      "marina",
      "boating",
      "hours"
    ],
    "tags": [
      "grand_teton",
      "facilities",
      "signal_mountain",
      "boating"
    ]
  },
  {
    "patterns": [
      "Is the Gros Ventre Campground open now?",
      "When does Gros Ventre Campground open in 2025?",
      "Can I camp at Gros Ventre in spring?",
      "What are the dates for Gros Ventre Campground?"
    ],
    "response": "Gros Ventre Campground opens April 26 and closes October 10 in 2025. It’s one of the first campgrounds to open each year and offers easy access to the town of Jackson. Electric hookups are available at select sites.",
    "keywords": [
      "gros ventre",
      "campground",
      "dates",
      "rv"
    ],
    "tags": [
      "grand_teton",
      "facilities",
      "gros_ventre",
      "camping"
    ]
  },
  {
    "patterns": [
      "When is the Chapel of the Transfiguration open?",
      "Can I attend church at the chapel in summer?",
      "Is the Chapel of the Transfiguration open in winter?",
      "Are services held at the chapel in Moose?"
    ],
    "response": "The Chapel of the Transfiguration is open year-round, with Sunday services held June through September. This historic log chapel offers views of the Teton Range behind the altar and is located near the Moose entrance.",
    "keywords": [
      "chapel",
      "transfiguration",
      "church",
      "moose"
    ],
    "tags": [
      "grand_teton",
      "facilities",
      "chapel_transfiguration",
      "historic_sites"
    ]
  },
  {
    "patterns": [
      "What are the hours for the Colter Bay Laundry and Showers?",
      "Is there laundry at Colter Bay in September?",
      "When can I take a shower at Colter Bay?",
      "Are showers available at the Colter Bay Campground?"
    ],
    "response": "The Colter Bay Launderette and Showers are open from May 3 to October 10. These facilities are available to both campers and day visitors and are located near the Colter Bay General Store.",
    "keywords": [
      "colter bay",
      "showers",
      "laundry",
      "facilities"
    ],
    "tags": [
      "grand_teton",
      "facilities",
      "colter_bay",
      "camp_services"
    ]
  },
  {
    "patterns": [
      "When is the Jackson Hole Aerial Tram operating?",
      "Can I use the tram to access trails in Grand Teton?",
      "Is the tram open in July?",
      "What are the 2025 tram dates?"
    ],
    "response": "The Jackson Hole Aerial Tram runs from June 7 to September 7 in 2025. It offers access to high-elevation trails connecting into Grand Teton National Park from Teton Village. A fee is required for tram access.",
    "keywords": [
      "tram",
      "jackson hole",
      "teton village",
      "access"
    ],
    "tags": [
      "grand_teton",
      "facilities",
      "teton_village",
      "trail_access"
    ]
  },
  {
    "patterns": [
      "Can I visit the Cunningham Cabin Historic Site?",
      "Is the Cunningham Cabin open in 2025?",
      "What are the dates for the Cunningham Historic District?",
      "Is the site near Moran open this summer?"
    ],
    "response": "The Cunningham Cabin Historic District is open year-round for self-guided visits. Located near Moran Junction, this preserved homestead offers insights into the early settlement of Jackson Hole.",
    "keywords": [
      "cunningham",
      "cabin",
      "moran",
      "historic"
    ],
    "tags": [
      "grand_teton",
      "facilities",
      "cunningham_cabin",
      "historic_sites"
    ]
  },
  {
    "patterns": [
      "When can I eat at Leeks Pizzeria?",
      "Is Leeks Pizzeria open in fall?",
      "What are the 2025 dates for Leeks Marina?",
      "Can I launch a boat at Leeks in August?"
    ],
    "response": "Leeks Pizzeria and Leeks Marina are open from May 17 to September 14 and September 7 respectively. Located on the northern end of Jackson Lake, they offer dining and boat launch access with great lake views.",
    "keywords": [
      "leeks",
      "pizzeria",
      "marina",
      "jackson lake"
    ],
    "tags": [
      "grand_teton",
      "facilities",
      "leeks_marina",
      "dining"
    ]
  },
  {
    "patterns": [
      "What are the hours for Deadmans Bar?",
      "When can I launch a raft at Deadmans?",
      "Is Deadmans Bar boat launch open in May?",
      "What are the 2025 launch dates for Deadmans?"
    ],
    "response": "Deadmans Bar Snake River Launch opens April 1 and closes December 15. This is one of the most popular access points for Snake River float trips and rafting adventures. Be sure to follow AIS inspection and boating permit rules before launching.",
    "keywords": [
      "deadmans",
      "snake river",
      "rafting",
      "launch"
    ],
    "tags": [
      "grand_teton",
      "facilities",
      "deadmans_bar",
      "boating"
    ]
  },
  {
    "patterns": [
      "Can I get gas at Headwaters Lodge?",
      "Is there a convenience store at Flagg Ranch?",
      "When is the Headwaters gas station open?",
      "What are the services at Headwaters in fall?"
    ],
    "response": "The Headwaters Convenience Store and Gas Station is open from May 9 to October 19. Located along the Rockefeller Parkway, this stop provides fuel, groceries, and basic camping supplies. Gas pumps are self-service and available 24/7 during the season.",
    "keywords": [
      "headwaters",
      "flagg ranch",
      "gas",
      "store"
    ],
    "tags": [
      "grand_teton",
      "facilities",
      "headwaters",
      "convenience_store"
    ]
  }
]