[
  {
    "patterns": [
      "What makes Old Faithful so famous?",
      "Why is Old Faithful the most well-known geyser?",
      "What’s so special about Old Faithful in Yellowstone?",
      "Why do people visit Old Faithful?"
    ],
    "response": "Old Faithful is world-famous for its remarkably predictable eruptions—something very rare among geysers. It's one of six geysers that rangers can forecast reliably, drawing millions of visitors each year.",
    "keywords": [
      "Old Faithful",
      "geyser",
      "predictable",
      "famous"
    ],
    "tags": [
      "old_faithful",
      "geothermal",
      "history"
    ]
  },
  {
    "patterns": [
      "When does Old Faithful erupt next?",
      "How do I find the eruption schedule for Old Faithful?",
      "Where can I check the time of the next Old Faithful eruption?",
      "How often does Old Faithful erupt?"
    ],
    "response": "You can find the next predicted eruption time at the Old Faithful Visitor Education Center, posted in park lodges, or by checking the official NPS App. Intervals range from 60 to 110 minutes.",
    "keywords": [
      "Old Faithful",
      "eruption time",
      "prediction",
      "NPS app"
    ],
    "tags": [
      "old_faithful",
      "planning",
      "visitor_services"
    ]
  },
  {
    "patterns": [
      "Can I watch Old Faithful from a safe spot?",
      "Where’s the best place to watch Old Faithful erupt?",
      "Is there a viewing area for Old Faithful?",
      "Where should I stand to see Old Faithful?"
    ],
    "response": "Yes, the main Old Faithful viewing area offers a safe, clear vantage point. You can also watch from boardwalks that loop through the Upper Geyser Basin.",
    "keywords": [
      "Old Faithful",
      "viewing area",
      "boardwalk",
      "safe"
    ],
    "tags": [
      "old_faithful",
      "accessibility",
      "scenic"
    ]
  },
  {
    "patterns": [
      "Is Old Faithful part of a historic area?",
      "What is the Old Faithful Historic District?",
      "Are there historic buildings around Old Faithful?",
      "Why is Old Faithful Inn important?"
    ],
    "response": "Yes, Old Faithful lies within the Old Faithful Historic District, home to structures like the iconic Old Faithful Inn, built in 1904. It's a classic example of rustic National Park architecture.",
    "keywords": [
      "Old Faithful",
      "Historic District",
      "Old Faithful Inn"
    ],
    "tags": [
      "old_faithful",
      "historic",
      "lodging"
    ]
  },
  {
    "patterns": [
      "What else can I see near Old Faithful?",
      "Are there other geysers near Old Faithful?",
      "What hydrothermal features are nearby?",
      "Can I explore more geysers close to Old Faithful?"
    ],
    "response": "The Upper Geyser Basin is packed with hydrothermal features—Grand Geyser, Daisy Geyser, Grotto Geyser, Morning Glory Pool, and more—all within walking distance.",
    "keywords": [
      "hydrothermal",
      "Upper Geyser Basin",
      "near Old Faithful"
    ],
    "tags": [
      "old_faithful",
      "geothermal",
      "exploration"
    ]
  },
  {
    "patterns": [
      "Where can I stay near Old Faithful?",
      "Are there hotels or lodges at Old Faithful?",
      "Can I book a room close to Old Faithful?",
      "What are my lodging options at Old Faithful?"
    ],
    "response": "Old Faithful Inn, Old Faithful Lodge, and Old Faithful Snow Lodge are your best bets for staying nearby. Reservations are recommended, especially in peak season.",
    "keywords": [
      "Old Faithful",
      "lodging",
      "Inn",
      "Snow Lodge"
    ],
    "tags": [
      "old_faithful",
      "lodging",
      "visitor_services"
    ]
  },
  {
    "patterns": [
      "Is Old Faithful wheelchair accessible?",
      "Are there ADA paths to Old Faithful?",
      "Can people with disabilities visit Old Faithful safely?",
      "Is the boardwalk accessible for everyone?"
    ],
    "response": "Yes, Old Faithful’s main viewing area and nearby boardwalks are ADA-accessible. There are ramps, paved paths, and accessible facilities available.",
    "keywords": [
      "accessibility",
      "Old Faithful",
      "wheelchair"
    ],
    "tags": [
      "old_faithful",
      "accessibility",
      "planning"
    ]
  },
  {
    "patterns": [
      "How long does Old Faithful erupt?",
      "What’s the average eruption time?",
      "How high does Old Faithful shoot?",
      "How long will I wait for Old Faithful to erupt?"
    ],
    "response": "Eruptions typically last between 1.5 to 5 minutes, reaching heights of 100 to 180 feet. Most visitors wait 60 to 110 minutes between eruptions.",
    "keywords": [
      "Old Faithful",
      "eruption duration",
      "height"
    ],
    "tags": [
      "old_faithful",
      "geothermal",
      "visitor_info"
    ]
  },
  {
    "patterns": [
      "What causes Old Faithful to erupt?",
      "Why does Old Faithful go off regularly?",
      "What makes Old Faithful erupt?",
      "How does Old Faithful work?"
    ],
    "response": "Old Faithful erupts due to underground superheated water building pressure until it bursts through the surface. It’s part of a complex and still-active geothermal system.",
    "keywords": [
      "Old Faithful",
      "eruption cause",
      "volcanic",
      "geology"
    ],
    "tags": [
      "old_faithful",
      "geology",
      "science"
    ]
  },
  {
    "patterns": [
      "Has Old Faithful ever stopped erupting?",
      "Could Old Faithful stop someday?",
      "Has Old Faithful always erupted like this?",
      "Will Old Faithful always be reliable?"
    ],
    "response": "Old Faithful has remained active for centuries, but all geothermal systems evolve. Changes underground could someday affect its activity or cause it to stop altogether.",
    "keywords": [
      "Old Faithful",
      "eruption history",
      "geology"
    ],
    "tags": [
      "old_faithful",
      "geothermal",
      "climate"
    ]
  },
  {
    "patterns": [
      "Are there general stores at Old Faithful?",
      "Can I buy supplies at Old Faithful?",
      "Where can I get snacks or souvenirs near Old Faithful?",
      "Does Old Faithful have a gift shop?"
    ],
    "response": "Yes, there are two Old Faithful General Stores offering snacks, supplies, and souvenirs. They’re located near the lodges and visitor center.",
    "keywords": [
      "Old Faithful",
      "general store",
      "snacks",
      "souvenirs"
    ],
    "tags": [
      "old_faithful",
      "shopping",
      "visitor_services"
    ]
  },
  {
    "patterns": [
      "Where is the Old Faithful Visitor Center?",
      "What’s at the Old Faithful Visitor Education Center?",
      "Can I get info about geysers at the visitor center?",
      "Is there a place to learn about Yellowstone at Old Faithful?"
    ],
    "response": "The Old Faithful Visitor Education Center offers exhibits, ranger programs, and geyser eruption predictions. It’s a great stop for learning more about Yellowstone’s geothermal activity.",
    "keywords": [
      "Old Faithful",
      "Visitor Center",
      "education",
      "NPS"
    ],
    "tags": [
      "old_faithful",
      "education",
      "visitor_services"
    ]
  },
  {
    "patterns": [
      "Are there waterfalls near Old Faithful?",
      "Can I see any waterfalls around Old Faithful?",
      "Where’s the closest waterfall to Old Faithful?",
      "What are Kepler Cascades?"
    ],
    "response": "Kepler Cascades is just south of Old Faithful along the Grand Loop Road—a short drive and an easy viewpoint for dramatic cascading water.",
    "keywords": [
      "Old Faithful",
      "waterfalls",
      "Kepler Cascades"
    ],
    "tags": [
      "old_faithful",
      "waterfalls",
      "scenic"
    ]
  }
]