[
  {
    "patterns": [
      "What is the Garnet Hill Trail like?",
      "Can I hike Garnet Hill near Tower Junction?",
      "How long is the Garnet Hill Trail in Yellowstone?",
      "Is Garnet Hill Trail accessible right now?"
    ],
    "response": "The Garnet Hill Trail is a scenic 4–5 hour loop around Tower Junction, following an old stagecoach route through meadows and sagebrush. Parts of the trail may be inaccessible due to washouts—check Backcountry Conditions before hiking.",
    "keywords": [
      "Garnet Hill",
      "Tower Junction",
      "hiking",
      "trail conditions"
    ],
    "tags": [
      "tower_hikes",
      "trails",
      "day_hike"
    ]
  },
  {
    "patterns": [
      "Tell me about the Hellroaring Trail.",
      "Can I hike to Hellroaring Creek?",
      "How difficult is the Hellroaring Trail?",
      "Where does the Hellroaring Trail go?"
    ],
    "response": "Hellroaring Trail descends to the Yellowstone River, then crosses a plateau to Hellroaring Creek. It’s a 3–5 hour hike starting near Tower Junction, popular in summer and fall.",
    "keywords": [
      "Hellroaring",
      "Yellowstone River",
      "hiking",
      "Tower Junction"
    ],
    "tags": [
      "tower_hikes",
      "trails",
      "creek"
    ]
  },
  {
    "patterns": [
      "What can I see on the Lost Lake Trail?",
      "Is Lost Lake Trail family-friendly?",
      "How long does it take to hike Lost Lake Trail?",
      "Can I see wildlife at Lost Lake?"
    ],
    "response": "Lost Lake Trail is a 1–2 hour hike near Tower Junction, offering views of lily-covered lakes, wildflowers, sagebrush hills, and sometimes even black bears or beavers. It’s accessible year-round.",
    "keywords": [
      "Lost Lake",
      "wildlife",
      "black bears",
      "Tower Junction"
    ],
    "tags": [
      "tower_hikes",
      "trails",
      "wildlife"
    ]
  },
  {
    "patterns": [
      "What’s the Slough Creek Trail like?",
      "Is Slough Creek Trail good for a longer hike?",
      "How long is the Slough Creek Trail?",
      "Where is the Slough Creek Trailhead?"
    ],
    "response": "Slough Creek Trail follows an old wagon route through Northeast Yellowstone into the Absaroka-Beartooth Wilderness. It's a 2–5 hour hike with open meadows and wildlife views.",
    "keywords": [
      "Slough Creek",
      "Northeast",
      "wagon trail",
      "Absaroka"
    ],
    "tags": [
      "tower_hikes",
      "trails",
      "remote"
    ]
  },
  {
    "patterns": [
      "Tell me about Specimen Ridge Day Hike Trail.",
      "Can I get mountain views from Specimen Ridge?",
      "Is Specimen Ridge a hard hike?",
      "How long is the hike up Specimen Ridge?"
    ],
    "response": "The Specimen Ridge Day Hike Trail offers spectacular views of Slough Creek Valley and the Absaroka Range from a ridgeline. It’s a moderately strenuous 2–4 hour hike in Northeast Yellowstone.",
    "keywords": [
      "Specimen Ridge",
      "views",
      "Absaroka",
      "Slough Creek"
    ],
    "tags": [
      "tower_hikes",
      "trails",
      "scenic"
    ]
  },
  {
    "patterns": [
      "What is the Trout Lake Trail like?",
      "Can kids hike Trout Lake Trail?",
      "Is Trout Lake Trail open year-round?",
      "How long does it take to hike Trout Lake Trail?"
    ],
    "response": "Trout Lake Trail is a short 1–2 hour hike through Douglas-fir forest to a beautiful alpine lake. It’s accessible in all seasons and suitable for most hikers.",
    "keywords": [
      "Trout Lake",
      "short hike",
      "Douglas-fir",
      "kid-friendly"
    ],
    "tags": [
      "tower_hikes",
      "trails",
      "family"
    ]
  },
  {
    "patterns": [
      "Where is the Yellowstone River Picnic Area Trail?",
      "What can I see on the Yellowstone River trail?",
      "Is the Yellowstone River Picnic Area Trail easy?",
      "Can I see bighorn sheep on this trail?"
    ],
    "response": "This 2–3 hour trail follows the rim of the Yellowstone River valley with views of bighorn sheep, Overhanging Cliff, and Tower Fall formations. It’s best in summer and fall.",
    "keywords": [
      "Yellowstone River",
      "Picnic Area Trail",
      "bighorn sheep",
      "Tower Fall"
    ],
    "tags": [
      "tower_hikes",
      "trails",
      "wildlife"
    ]
  },
  {
    "patterns": [
      "Do I need reservations for day hikes in Tower area?",
      "Are permits required for Tower area hikes?",
      "Do I need to pay to hike in Northeast Yellowstone?",
      "Can I hike without a guide in Tower?"
    ],
    "response": "Reservations and activity fees are not required for day hikes in the Tower & Northeast area, though park entrance fees still apply. All hikes listed are self-guided and free to access.",
    "keywords": [
      "reservations",
      "permits",
      "fees",
      "Tower hiking"
    ],
    "tags": [
      "tower_hikes",
      "planning",
      "permits"
    ]
  },
  {
    "patterns": [
      "Are pets allowed on trails in Northeast Yellowstone?",
      "Can I bring my dog on Yellowstone hikes?",
      "Are there pet-friendly trails near Tower?",
      "Can I hike with a pet in Lamar Valley?"
    ],
    "response": "Pets are not allowed on hiking trails in Yellowstone, including those in the Tower and Northeast areas. They are only permitted in developed areas and must be leashed.",
    "keywords": [
      "pets",
      "dogs",
      "Yellowstone trails",
      "pet rules"
    ],
    "tags": [
      "tower_hikes",
      "accessibility",
      "pet_policy"
    ]
  },
  {
    "patterns": [
      "What’s the best season to hike in Tower area?",
      "Can I hike in winter near Tower Junction?",
      "Which trails are good in spring or fall?",
      "Are Tower hikes seasonal?"
    ],
    "response": "Many trails in the Tower & Northeast area are open year-round, including Garnet Hill and Lost Lake. Others like Specimen Ridge and Slough Creek are best in summer and fall—check trail conditions before you go.",
    "keywords": [
      "season",
      "trail conditions",
      "Tower hikes",
      "spring",
      "fall"
    ],
    "tags": [
      "tower_hikes",
      "seasonal",
      "trail_access"
    ]
  }
]