[
  {
    "intent": "yellowstone_campground_info",
    "patterns": [
      "Tell me about Madison Campground in Yellowstone",
      "Is Madison Campground good for RVs?",
      "Can I bring my dog to Madison Campground?"
    ],
    "response": "Madison Campground is centrally located near geyser basins and offers 270 sites suitable for tents and RVs (up to 40 ft). Reservations are required through Recreation.gov. Pets are allowed on leash but not on trails. No hookups. Open late spring to early fall. Use bear spray when hiking nearby, store food in bear lockers or vehicles, and never leave food in tents. Apple Maps: https://maps.apple.com/?q=Madison+Campground+Yellowstone."
  },
  {
    "intent": "yellowstone_campground_info",
    "patterns": [
      "What’s it like to camp at Canyon Campground?",
      "Is Canyon Campground good for families?",
      "Where is Canyon Campground located?"
    ],
    "response": "Canyon Campground is located near the Grand Canyon of the Yellowstone and has 270+ reservable sites with flush toilets, showers nearby, and dump stations. RVs welcome (up to 40 ft). Pets allowed on leash. Open June–Sept. Bears are active—use lockers and NEVER leave food out. Apple Maps: https://maps.apple.com/?q=Canyon+Campground+Yellowstone."
  },
  {
    "intent": "yellowstone_campground_info",
    "patterns": [
      "Is Grant Village Campground open year-round?",
      "Can I stay in an RV at Grant Village?",
      "Are reservations needed at Grant Village?"
    ],
    "response": "Grant Village Campground, on Yellowstone Lake’s west shore, offers 430 reservable sites, flush toilets, and water. RVs and trailers welcome. Open June–Sept. Reserve via Recreation.gov. Pets allowed on leash. Bear safety is critical: use lockers, no food in tents, carry bear spray on hikes. Apple Maps: https://maps.apple.com/?q=Grant+Village+Campground+Yellowstone."
  },
  {
    "intent": "yellowstone_campground_info",
    "patterns": [
      "What amenities are at Fishing Bridge RV Park?",
      "Is Fishing Bridge for RVs only?",
      "Does Fishing Bridge have hookups?"
    ],
    "response": "Fishing Bridge RV Park is for hard-sided RVs only (no tents), located near Yellowstone Lake. Full hookups available. Reservation required. Pets allowed inside RVs. Excellent for exploring east side of park. Bear activity high—store all attractants properly. Apple Maps: https://maps.apple.com/?q=Fishing+Bridge+RV+Park+Yellowstone."
  },
  {
    "intent": "yellowstone_campground_info",
    "patterns": [
      "Can I camp at Norris Campground?",
      "Is Norris Campground first-come?",
      "Is Norris open in 2025?"
    ],
    "response": "Norris Campground is currently closed for renovations (check NPS for updates). Historically first-come, near Norris Geyser Basin. Vault toilets, no hookups. Bear safety is mandatory. Store food in bear boxes. Apple Maps: https://maps.apple.com/?q=Norris+Campground+Yellowstone."
  },
  {
    "intent": "yellowstone_campground_info",
    "patterns": [
      "What’s Pebble Creek Campground like?",
      "Is Pebble Creek in Lamar Valley?",
      "Are there bears at Pebble Creek?"
    ],
    "response": "Pebble Creek is a small, scenic campground in Lamar Valley with 27 first-come sites. Vault toilets, no hookups. Open summer. Great wildlife viewing but bear frequent area. Never leave food or coolers unattended. Bear spray recommended. Apple Maps: https://maps.apple.com/?q=Pebble+Creek+Campground+Yellowstone."
  },
  {
    "intent": "yellowstone_backcountry_permits",
    "patterns": [
      "How do I get a backcountry permit in Yellowstone?",
      "Where can I pick up a backcountry permit?",
      "What are the rules for backcountry camping in Yellowstone?"
    ],
    "response": "Backcountry camping in Yellowstone requires a permit, which can be reserved online or picked up in person at ranger stations. You’ll need to specify your route, campsites, and group size. Food must be stored in bear-proof canisters or hung properly. Permits help track safety and protect wildlife. Details at: https://www.nps.gov/yell/planyourvisit/backcountryhiking.htm"
  },
  {
    "intent": "yellowstone_bear_spray_safety",
    "patterns": [
      "How do I use bear spray in Yellowstone?",
      "Where can I get bear spray?",
      "Do I need bear spray in Yellowstone?"
    ],
    "response": "Yes, carry bear spray when hiking or camping in Yellowstone. Keep it accessible on your belt—not in your pack. Use it only if a bear charges: spray a cloud in front of the bear. You can rent or buy bear spray in gateway towns like Gardiner and West Yellowstone. Never spray it on gear or tents."
  },
  {
    "intent": "yellowstone_food_storage_rules",
    "patterns": [
      "Can I store food in my tent in Yellowstone?",
      "What are the food rules in campgrounds?",
      "How do I keep food safe from bears?"
    ],
    "response": "Never store food or scented items in your tent. Use bear lockers provided at each campground or store food in a locked vehicle. Dispose of trash in bear-proof bins. Clean up thoroughly after cooking, even if only making coffee. These rules save lives—yours and the bear’s."
  },
  {
    "intent": "yellowstone_campground_reservations",
    "patterns": [
      "Which Yellowstone campgrounds need reservations?",
      "Can I walk into a Yellowstone campsite?",
      "How do I book a Yellowstone campground?"
    ],
    "response": "Most major Yellowstone campgrounds (e.g., Madison, Grant, Canyon, Bridge Bay) require reservations through Recreation.gov. Smaller sites like Pebble Creek and Slough Creek are first-come, first-served. Book early—sites fill quickly. Tent, RV, and trailer size limits apply."
  }
]
