{
  "intents": [
    {
      "intent": "yellowstone_flyfishing_may_hatches",
      "patterns": [
        "What hatches happen in Yellowstone in May?",
        "Best flies to use in May in Yellowstone",
        "What's biting in May for fly fishing?"
      ],
      "response": "In May, Yellowstone’s waters start waking up with Blue-winged Olives, Midges, and the occasional Skwala Stonefly in the mix. Look for surface activity on overcast days, and keep your drift light and natural.",
      "keywords": [
        "May",
        "hatches",
        "flies"
      ],
      "tags": [
        "spring",
        "hatch_chart",
        "yellowstone_fishing"
      ]
    },
    {
      "intent": "yellowstone_flyfishing_june_hatches",
      "patterns": [
        "Best flies to use in June",
        "What hatches are on in Yellowstone in June?",
        "What insects are active in June for fly fishing?"
      ],
      "response": "June brings heavy hatch activity, including Salmonflies, Golden Stoneflies, PMDs, and Caddis. Focus on the Firehole and Madison early in the month, then shift as runoff recedes.",
      "keywords": [
        "June",
        "Salmonfly",
        "Golden Stonefly"
      ],
      "tags": [
        "summer",
        "hatch_chart"
      ]
    },
    {
      "intent": "yellowstone_trout_loop",
      "patterns": [
        "Tell me about the Classic Yellowstone Trout Loop",
        "What's a good 3-day Yellowstone fly fishing trip?",
        "Yellowstone trout loop itinerary"
      ],
      "response": "The Classic Yellowstone Trout Loop is a 3-day tour of legendary waters: Day 1 hits the Madison near Madison Junction for evening risers, Day 2 puts you on the warm, productive Firehole near Midway Geyser Basin, and Day 3 wraps up on the Gibbon below the falls where browns and bows mix. Great mid-to-late June through early fall.",
      "keywords": [
        "Yellowstone",
        "trout loop",
        "itinerary"
      ],
      "tags": [
        "multi_day_trip",
        "yellowstone_fishing"
      ]
    },
    {
      "intent": "yellowstone_fishing_rules",
      "patterns": [
        "What are the Yellowstone fishing regulations?",
        "Do I need a permit to fish in Yellowstone?",
        "Are there fishing rules I should know?"
      ],
      "response": "Yes — you’ll need a Yellowstone National Park fishing permit (state licenses aren’t valid). Barbless hooks only, no bait or lead, and felt-soled boots are banned. Catch-and-release is mandatory for native species like cutthroat. Some rivers, like the Firehole, are fly-only, and the Lamar requires removal of non-native trout.",
      "keywords": [
        "rules",
        "regulations",
        "permit"
      ],
      "tags": [
        "safety",
        "fishing_access"
      ]
    },
    {
      "intent": "yellowstone_backcountry_challenge",
      "patterns": [
        "Tell me about a backcountry fly fishing itinerary in Yellowstone",
        "What’s the backcountry challenge fishing plan?",
        "Where can I hike and fish in Yellowstone?"
      ],
      "response": "The Backcountry Challenge is for anglers with stamina. Day 1, hike to Grebe Lake for rare grayling. Day 2, backpack to Slough Creek’s 2nd Meadow for classic cutthroat fishing and camp nearby. Day 3, fish the morning then pack out. You’ll need bear spray, a backcountry permit, and good legs — but the solitude is unbeatable.",
      "keywords": [
        "backcountry",
        "Slough Creek",
        "Grebe Lake"
      ],
      "tags": [
        "advanced",
        "multi_day",
        "remote"
      ]
    }
  ]
}