[
  {
    "patterns": [
      "Which campgrounds have showers in Yellowstone?",
      "Are there showers available at Yellowstone campgrounds?",
      "Can I take a shower at my Yellowstone campsite?"
    ],
    "response": "Showers are available at Grant Village and Canyon campgrounds, and at Fishing Bridge RV Park. They're seasonal and included with your reservation at most of those sites. Bring quarters just in case.",
    "tags": [
      "camping",
      "amenities",
      "kid-friendly",
      "park services"
    ],
    "tiers": [
      "free",
      "premium"
    ]
  },
  {
    "patterns": [
      "Do I need a reservation to camp in Yellowstone?",
      "Can I reserve a campsite in Yellowstone?",
      "How do I book a Yellowstone campground?"
    ],
    "response": "Yes, reservations are strongly recommended for all campgrounds in Yellowstone, especially during summer. Yellowstone National Park Lodges handles some, while others like Indian Creek and Slough Creek are on Recreation.gov.",
    "tags": [
      "camping",
      "trip planning",
      "park navigation"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "Which Yellowstone campground has hookups?",
      "Are there full hookup campgrounds in Yellowstone?",
      "Can I get electricity and water for my RV in Yellowstone?"
    ],
    "response": "Fishing Bridge RV Park is the only campground in Yellowstone that offers full hookups—electricity, water, and sewer. It’s for hard-sided RVs only, and reservations are essential.",
    "tags": [
      "RV",
      "camping",
      "accessibility"
    ],
    "tiers": [
      "free",
      "premium"
    ]
  },
  {
    "patterns": [
      "Where is the best campground for families in Yellowstone?",
      "Which Yellowstone campgrounds are kid-friendly?",
      "Good campgrounds for kids in Yellowstone?"
    ],
    "response": "Canyon and Grant Village are great for families, offering restrooms with flush toilets, easy access to services, and ranger programs nearby. Both have amphitheaters and good trail access.",
    "tags": [
      "camping",
      "kid-friendly",
      "family activity"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "Is there cell service at Yellowstone campgrounds?",
      "Can I get phone signal while camping in Yellowstone?",
      "What campgrounds in Yellowstone have cell coverage?"
    ],
    "response": "Cell service is spotty in Yellowstone. You’ll have the best luck at Canyon, Grant Village, and Fishing Bridge. Madison and Bridge Bay have limited to no signal. Don’t count on Wi-Fi.",
    "tags": [
      "camping",
      "connectivity",
      "trip planning"
    ]
  },
  {
    "patterns": [
      "Can I camp with a tent in Yellowstone?",
      "Are tents allowed in all Yellowstone campgrounds?",
      "Where can I pitch a tent in Yellowstone?"
    ],
    "response": "Tents are welcome at nearly all Yellowstone campgrounds—except Fishing Bridge RV Park, which is restricted to hard-sided units due to bear activity.",
    "tags": [
      "tent camping",
      "camping",
      "trail safety"
    ]
  },
  {
    "patterns": [
      "What’s the elevation at Canyon Campground?",
      "How high is the Canyon Campground?",
      "Is Canyon Campground at a high elevation?"
    ],
    "response": "Canyon Campground sits at 7,900 feet. Nights can get chilly, even in July. Pack warm layers and a good sleeping bag.",
    "tags": [
      "camping",
      "weather",
      "altitude"
    ]
  },
  {
    "patterns": [
      "Where can I find quiet camping in Yellowstone?",
      "Are there secluded campgrounds in Yellowstone?",
      "Less crowded Yellowstone campgrounds?"
    ],
    "response": "For quieter camping, try Indian Creek, Slough Creek, or Lewis Lake. They’re more primitive and away from the busiest parts of the park.",
    "tags": [
      "camping",
      "solitude",
      "trip planning"
    ]
  },
  {
    "patterns": [
      "Do Yellowstone campgrounds have food storage lockers?",
      "Are bear boxes available at Yellowstone campsites?",
      "How do I store food safely when camping in Yellowstone?"
    ],
    "response": "Most campgrounds in Yellowstone provide food storage lockers. Always store all food, scented items, and cooking gear inside these lockers or in your vehicle to avoid bear encounters.",
    "tags": [
      "camping",
      "wildlife safety",
      "bear safety",
      "kid-friendly"
    ]
  },
  {
    "patterns": [
      "Are generators allowed in Yellowstone campgrounds?",
      "Can I use a generator while camping in Yellowstone?",
      "What’s the rule on generators in Yellowstone?"
    ],
    "response": "Generators are allowed in designated loops during certain hours (usually between 8 a.m. and 8 p.m.) at campgrounds like Madison, Grant, and Canyon. Always check the posted rules.",
    "tags": [
      "camping",
      "RV",
      "noise",
      "accessibility"
    ]
  },
  {
    "patterns": [
      "Can I bring a bike to Yellowstone campgrounds?",
      "Are there biking trails near Yellowstone campgrounds?",
      "Is biking allowed in Yellowstone?"
    ],
    "response": "Yes, biking is allowed on park roads and some service roads. Many campgrounds have hiker-biker sites and access to scenic paved roads. Always wear a helmet and stay alert.",
    "tags": [
      "camping",
      "biking",
      "trail access",
      "kid-friendly"
    ]
  },
  {
    "patterns": [
      "What’s the max RV length in Yellowstone?",
      "Can big rigs fit in Yellowstone campgrounds?",
      "RV size limits in Yellowstone?"
    ],
    "response": "RV size limits vary. Fishing Bridge can accommodate rigs up to 95 feet. Madison and Bridge Bay allow up to 60 feet. Always check size limits when booking.",
    "tags": [
      "RV",
      "camping",
      "trip planning"
    ]
  },
  {
    "patterns": [
      "Can I camp year-round in Yellowstone?",
      "Is there winter camping in Yellowstone?",
      "Which campgrounds are open in winter?"
    ],
    "response": "Mammoth Campground is the only site open year-round. It’s first-come, first-served during the off-season. Be prepared for cold temps and snow.",
    "tags": [
      "camping",
      "winter",
      "accessibility"
    ]
  },
  {
    "patterns": [
      "Where can I dump RV waste in Yellowstone?",
      "Are there dump stations in Yellowstone?",
      "RV dump services in Yellowstone?"
    ],
    "response": "Dump stations are available at several campgrounds including Grant Village, Canyon, Madison, and Fishing Bridge. Hours may vary with weather.",
    "tags": [
      "RV",
      "camping",
      "park services"
    ]
  },
  {
    "patterns": [
      "What wildlife might I see near my campsite?",
      "Are there animals in Yellowstone campgrounds?",
      "Wildlife safety while camping?"
    ],
    "response": "Elk, bison, and even bears may wander near campgrounds. Always store food properly and give wildlife plenty of space. Never feed animals.",
    "tags": [
      "wildlife safety",
      "camping",
      "park safety",
      "kid-friendly"
    ]
  },
  {
    "patterns": [
      "Can I camp near Yellowstone Lake?",
      "Best campgrounds by Yellowstone Lake?",
      "Where to camp with lake views in Yellowstone?"
    ],
    "response": "Bridge Bay and Grant Village Campgrounds are both close to Yellowstone Lake, with scenic views and good access to water activities.",
    "tags": [
      "camping",
      "lake access",
      "scenic spots"
    ]
  },
  {
    "patterns": [
      "Are there group campsites in Yellowstone?",
      "Can I reserve a group campsite?",
      "How many people can stay at a Yellowstone site?"
    ],
    "response": "Group sites are available at Grant Village, Madison, and Bridge Bay. They're great for large families or organized groups. Reservations are required.",
    "tags": [
      "group camping",
      "trip planning",
      "camping"
    ]
  },
  {
    "patterns": [
      "Can I camp in the backcountry in Yellowstone?",
      "What’s the backcountry camping permit process?",
      "Do I need a permit for wilderness camping?"
    ],
    "response": "Yes, backcountry camping is allowed with a permit. You’ll need to plan your route, attend a safety orientation, and carry bear spray. Permits are limited.",
    "tags": [
      "backcountry",
      "camping",
      "trail safety",
      "wilderness"
    ]
  },
  {
    "patterns": [
      "What’s the earliest I can check in to a campsite?",
      "When can I check into Yellowstone campsites?",
      "Check-in times for Yellowstone camping?"
    ],
    "response": "Check-in is typically after 1 p.m. for Yellowstone campgrounds. Plan accordingly if you’re arriving early—visitor centers and nearby trails are good ways to pass time.",
    "tags": [
      "camping",
      "trip planning",
      "park navigation"
    ]
  },
  {
    "patterns": [
      "Can I bring firewood to my campsite?",
      "Firewood rules in Yellowstone?",
      "Can I collect wood in the park?"
    ],
    "response": "Do not collect firewood in the park. Firewood is sold at most campgrounds. Bringing firewood from outside the area is discouraged to prevent invasive species.",
    "tags": [
      "camping",
      "fire safety",
      "park rules"
    ]
  }
]