[
  {
    "patterns": [
      "Tell me about the Avalanche Peak Trail in Yellowstone",
      "Is Avalanche Peak a hard hike?",
      "What views can I expect from Avalanche Peak?"
    ],
    "response": "Avalanche Peak Trail is one of Yellowstone's most strenuous day hikes, but the effort pays off with panoramic views of the park’s tallest alpine peaks. The round trip takes 3–4 hours and is best done in summer or fall. Bring layers—it’s high elevation and can be windy at the top.",
    "tags": [
      "trail safety",
      "scenic spots",
      "high elevation",
      "day hikes"
    ],
    "tiers": [
      "free",
      "premium"
    ]
  },
  {
    "patterns": [
      "What is Elephant Back Mountain Trail like?",
      "Can I see Yellowstone Lake from Elephant Back?",
      "Is the Elephant Back trail family-friendly?"
    ],
    "response": "Elephant Back Mountain Trail is a moderately strenuous 2–3 hour hike that rewards visitors with sweeping views of Yellowstone Lake. The trail starts in Lake Village and gains elevation steadily. It's best for summer and fall. Wildlife sightings are common—bring bear spray.",
    "tags": [
      "scenic spots",
      "trail safety",
      "family-friendly",
      "wildlife viewing"
    ]
  },
  {
    "patterns": [
      "What can I see on the Mud Volcano Trail?",
      "Is the Mud Volcano Trail open in winter?",
      "Can I bring my dog to Mud Volcano Trail?"
    ],
    "response": "Mud Volcano Trail is open year-round and offers an easy 1–2 hour loop past boiling mud pots, steaming hillsides, and sulfuric features. The strange sights and smells make it one of Yellowstone’s most unique experiences. Pets are not allowed on the trail.",
    "tags": [
      "geothermal",
      "trail safety",
      "family-friendly",
      "winter access"
    ]
  },
  {
    "patterns": [
      "Where is the Natural Bridge Trail?",
      "How long is the hike to the Natural Bridge?",
      "What is the Natural Bridge made of?"
    ],
    "response": "The Natural Bridge Trail begins near Bridge Bay Marina and leads hikers along an old road to a rhyolite rock arch carved by Bridge Creek. The easy hike takes 1–2 hours and is best done in summer or fall. Look for wildlife in the forested areas.",
    "tags": [
      "geology",
      "trail safety",
      "scenic spots",
      "family-friendly"
    ]
  },
  {
    "patterns": [
      "What is the Pelican Creek Nature Trail like?",
      "Can I birdwatch on the Pelican Creek Trail?",
      "How long does the Pelican Creek hike take?"
    ],
    "response": "The Pelican Creek Nature Trail is a short 30–60 minute loop through forest and wetlands that ends at Yellowstone Lake. It’s an excellent spot for birdwatching and wildlife viewing. Perfect for families or anyone looking for a gentle hike.",
    "tags": [
      "wildlife viewing",
      "kid-friendly",
      "scenic spots",
      "short hikes"
    ]
  },
  {
    "patterns": [
      "Is Pelican Valley Trail safe?",
      "What wildlife is in Pelican Valley?",
      "How difficult is the Pelican Valley Trail?"
    ],
    "response": "Pelican Valley Trail is one of the best places in Yellowstone to see grizzlies in the wild. This 3–4 hour hike travels through prime bear habitat, so carry bear spray and hike in groups. It’s closed during early summer to protect wildlife. Day use only.",
    "tags": [
      "wildlife viewing",
      "trail safety",
      "backcountry",
      "bear country"
    ]
  },
  {
    "patterns": [
      "What is Storm Point Trail like?",
      "Can I see Yellowstone Lake from Storm Point?",
      "Is Storm Point a good wildlife hike?"
    ],
    "response": "Storm Point Trail is a 1–2 hour easy loop starting near Fishing Bridge. It leads through forest and out to the rocky shores of Yellowstone Lake. Watch for marmots sunning on the rocks and listen for songbirds in the trees. Great for families.",
    "tags": [
      "wildlife viewing",
      "scenic spots",
      "family-friendly",
      "lake access"
    ]
  }
]