[
  {
    "intent": "yellowstone_dining",
    "patterns": [
      "Where can I eat at Old Faithful?",
      "What restaurants are near Old Faithful?",
      "Does Old Faithful Inn have a restaurant?"
    ],
    "response": "Old Faithful Inn Dining Room offers classic Yellowstone lodge fare with views of the geyser. Signature dishes include bison short ribs and trout. Price tier: $$$. Family-friendly, not pet-friendly. Reservations highly recommended. Apple Maps: https://maps.apple.com/?q=Old+Faithful+Inn+Dining+Room."
  },
  {
    "intent": "yellowstone_dining",
    "patterns": [
      "Is there food at Lake Hotel?",
      "What’s on the menu at Lake Yellowstone Hotel?",
      "Can I dine at Lake Hotel without staying there?"
    ],
    "response": "Lake Hotel Dining Room serves upscale meals with a focus on trout and game meats. Elegant, $$$$ pricing. Family-oriented atmosphere, no pets. Reservations recommended. Apple Maps: https://maps.apple.com/?q=Lake+Yellowstone+Hotel+Dining+Room."
  },
  {
    "intent": "yellowstone_dining",
    "patterns": [
      "Can I get food at Canyon Village?",
      "Is there a grill or restaurant at Canyon Lodge?",
      "What food is available in Canyon?"
    ],
    "response": "Canyon Eatery in Canyon Village offers cafeteria-style American comfort food and grill items. Great for families, $$ tier. No reservations needed. Not pet-friendly. Apple Maps: https://maps.apple.com/?q=Canyon+Village+Yellowstone."
  },
  {
    "intent": "yellowstone_dining",
    "patterns": [
      "Where can I eat near Mammoth Hot Springs?",
      "Is there a restaurant at Mammoth Hotel?",
      "Can I eat outside at Mammoth?"
    ],
    "response": "Mammoth Dining Room features local fare including bison burgers and elk chili. $$$, casual but classy. Pet-friendly on patio (if open). Family-friendly. Reservations recommended. Apple Maps: https://maps.apple.com/?q=Mammoth+Hotel+Dining+Room."
  },
  {
    "intent": "yellowstone_dining",
    "patterns": [
      "What food is near Roosevelt Lodge?",
      "Where can I eat near Tower-Roosevelt?",
      "Does Roosevelt Lodge have a restaurant?"
    ],
    "response": "Roosevelt Lodge Dining Room is rustic and fun, known for Roosevelt beans and hearty skillet meals. $$ pricing. Family-oriented, pet-friendly patio when open. Reservations suggested. Apple Maps: https://maps.apple.com/?q=Roosevelt+Lodge+Dining+Room."
  },
  {
    "intent": "yellowstone_dining",
    "patterns": [
      "Where should I eat in West Yellowstone?",
      "Best food in West Yellowstone?",
      "Any good restaurants outside Yellowstone?"
    ],
    "response": "Try Firehole Bar-B-Que Co. in West Yellowstone — known for brisket, ribs, and house sauces. $$ tier. Family-oriented and casual, outdoor seating is pet-friendly. No reservations. Apple Maps: https://maps.apple.com/?q=Firehole+Bar-B-Que+Co."
  },
  {
    "intent": "yellowstone_dining",
    "patterns": [
      "Where can I eat in Gardiner, MT?",
      "Best restaurants in Gardiner near the park?",
      "Where can I grab food in Gardiner?"
    ],
    "response": "The Raven Grill in Gardiner offers locally sourced elk, trout, and vegetarian plates. $$$, good wine list. Pet-friendly patio. Reservations helpful in summer. Apple Maps: https://maps.apple.com/?q=The+Raven+Grill+Gardiner+MT."
  },
  {
    "intent": "yellowstone_dining",
    "patterns": [
      "Where can I eat in Cooke City?",
      "Best place to eat near Lamar Valley?",
      "Is there food in Cooke City, MT?"
    ],
    "response": "Beartooth Cafe in Cooke City is a solid choice — fish tacos, local beers, veggie-friendly. $$ pricing, family-style. Patio seating sometimes allows dogs. Apple Maps: https://maps.apple.com/?q=Beartooth+Cafe+Cooke+City."
  },
  {
    "intent": "yellowstone_dining",
    "patterns": [
      "Can I picnic in Yellowstone?",
      "Is it okay to bring my own food?",
      "Where can I get picnic supplies for Yellowstone?"
    ],
    "response": "Picnicking is one of the best ways to eat in Yellowstone! Pick up sandwich meat, cheese, and bread from Gardiner Market or Market Place in West Yellowstone. Many pullouts have picnic tables — just be sure to pack out all trash and store food properly. Bonus: no reservations, pet-friendly, and unbeatable views."
  },
  {
    "intent": "yellowstone_dining",
    "patterns": [
      "Where to get coffee or snacks inside the park?",
      "Any quick bites in Yellowstone?",
      "Best grab-and-go food options in Yellowstone?"
    ],
    "response": "Yellowstone General Stores (various locations) offer coffee, snacks, and sandwiches. Perfect for a quick stop or road lunch. $$ tier, no reservations, family and pet-friendly outside. Apple Maps: https://maps.apple.com/?q=Yellowstone+General+Store."
  }
]