{
  "¿Dónde es el mejor lugar para ver lobos?": "El mejor lugar para ver lobos en Yellowstone es el Valle de Lamar. A menudo se le llama 'el Serengeti de América' por su abundante vida salvaje. Las primeras horas de la mañana son ideales para ver lobos en acción.",
  "¿Qué es el géiser Old Faithful?": "Old Faithful es un famoso géiser cónico en el Parque Nacional Yellowstone. Entra en erupción aproximadamente cada 90 minutos y lanza agua hasta 55 metros de altura.",
  "¿Cuándo es la mejor época para visitar Yellowstone?": "La mejor época para visitar Yellowstone es de finales de mayo a principios de octubre. Junio y septiembre ofrecen buen clima y menos multitudes.",
  "¿Cómo llego al Valle de Lamar?": "El Valle de Lamar está en el noreste del parque. Desde Mammoth Hot Springs, toma la Grand Loop Road hacia el este hasta Tower Junction y continúa por la Northeast Entrance Road.",
  "¿Hay osos en Yellowstone?": "Sí, en Yellowstone viven osos grizzly y osos negros. Los visitantes deben llevar gas pimienta para osos y saber cómo almacenar alimentos de forma segura.",
  "¿Se puede nadar en Yellowstone?": "Solo se permite nadar en algunas zonas designadas como el Firehole Swim Area y el Boiling River (cuando está abierto). La mayoría de las fuentes termales son extremadamente peligrosas.",
  "¿Qué debo empacar para Yellowstone?": "Debes llevar ropa en capas, gas pimienta para osos, botas de senderismo, protector solar, botellas de agua, binoculares y una cámara. El clima puede cambiar rápidamente.",
  "¿Cuánto cuesta entrar a Yellowstone?": "El pase de entrada para vehículos privados cuesta $35 por 7 días. Motocicletas pagan $30 y peatones o ciclistas $20. También hay pases anuales y vitalicios.",
  "¿Se permiten mascotas en Yellowstone?": "Se permiten mascotas, pero solo en áreas desarrolladas, campamentos y dentro de los 30 metros de las carreteras. Deben ir siempre con correa y no pueden ir por senderos ni pasarelas.",
  "¿Cuáles son las atracciones más populares en Yellowstone?": "Las atracciones principales incluyen Old Faithful, Grand Prismatic Spring, el Gran Cañón de Yellowstone, el Valle de Lamar, Mammoth Hot Springs y el Lago Yellowstone.",
  "¿Puedo recorrer Yellowstone en un solo día?": "Sí, se puede recorrer en un día por la Grand Loop Road, pero solo verás lo más básico. Planea visitar 3 a 5 lugares importantes y conducir de 6 a 8 horas.",
  "¿Qué animales puedo ver en Yellowstone?": "Yellowstone alberga bisontes, alces, lobos, osos, alces americanos, berrendos, coyotes, águilas y más. El Valle de Lamar y el Valle Hayden son ideales para observar fauna.",
  "¿Dónde puedo ver la Grand Prismatic Spring?": "La Grand Prismatic Spring está en la zona de Midway Geyser Basin. Para una mejor vista, sube al mirador desde el estacionamiento de Fairy Falls.",
  "¿Es Yellowstone seguro para niños?": "Sí, Yellowstone es apto para niños, pero deben ser vigilados de cerca, especialmente cerca de géiseres, fuentes termales y animales salvajes.",
  "¿Hay restaurantes dentro de Yellowstone?": "Sí, hay opciones para comer en lugares como Old Faithful, Canyon Village, Mammoth Hot Springs y Lake Village. Algunas abren solo por temporada.",
  "¿Necesito reservación para entrar a Yellowstone?": "No necesitas reservación para ingresar al parque, pero los alojamientos y campamentos deben reservarse con mucha anticipación, especialmente en verano.",
  "¿Qué es el supervolcán de Yellowstone?": "Es una enorme cámara de magma subterránea. Aunque está activa, no hay señales de una erupción inminente.",
  "¿Dónde está Mammoth Hot Springs?": "Mammoth Hot Springs está cerca de la entrada norte del parque, justo al sur de Gardiner, Montana.",
  "¿Se puede visitar Yellowstone en invierno?": "Sí, es posible y mágico. El parque está abierto a vehículos especiales sobre nieve y se puede disfrutar de excursiones guiadas, esquí de fondo y menos multitudes.",
  "¿Qué son los programas de guardabosques en Yellowstone?": "Los programas dirigidos por guardabosques incluyen caminatas, charlas, observación de animales y presentaciones nocturnas. Se anuncian en los centros de visitantes en verano."
}
