[
  {
    "patterns": [
      "What are the seasonal closures for Mount Hunt and Static Peak?",
      "Are any summits closed in the winter?",
      "Can I hike to Prospectors Mountain in January?",
      "What peaks are closed from December to April?"
    ],
    "response": "The summits of Mount Hunt, Prospectors Mountain, and Static Peak are closed to all travel from December 1 through April 30 to protect wildlife and reduce human impact during winter months. Always check the Superintendent's Compendium for the latest restrictions.",
    "keywords": [
      "seasonal closure",
      "mount hunt",
      "static peak",
      "prospectors mountain"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "seasonal_closures"
    ]
  },
  {
    "patterns": [
      "When are Bighorn Sheep zones closed?",
      "Can I hike in bighorn sheep zones during winter?",
      "What are the voluntary closures for bighorn sheep?",
      "Is there a map of the sheep winter zones?"
    ],
    "response": "From December 1 to April 30, visitors are asked to voluntarily avoid Bighorn Sheep Winter Zones to protect sensitive habitat. A georeferenced map of these zones is available at tetonsheep.org.",
    "keywords": [
      "bighorn sheep",
      "winter closure",
      "voluntary",
      "wildlife"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "wildlife_protection"
    ]
  },
  {
    "patterns": [
      "What areas around the Snake River are closed?",
      "Is Kelly Warm Springs open in winter?",
      "When is the Snake River area off-limits?",
      "Are there closures near Buffalo Fork?"
    ],
    "response": "Areas around the Snake River, Buffalo Fork River, and Kelly Warm Springs are closed to public entry from December 15 through March 31 to protect wintering wildlife.",
    "keywords": [
      "snake river",
      "kelly warm springs",
      "winter closures",
      "buffalo fork"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "area_closures"
    ]
  },
  {
    "patterns": [
      "Is Grassy Lake Road closed in spring?",
      "When does Grassy Lake Road reopen?",
      "Why is Grassy Lake Road closed?",
      "Can I access Flagg Ranch via Grassy Lake Road in May?"
    ],
    "response": "Grassy Lake Road is closed from the end of Yellowstone’s winter season (around March 15) through May 31, or later depending on snow conditions. This closure protects wildlife and reduces road damage.",
    "keywords": [
      "grassy lake",
      "road closure",
      "spring",
      "flag ranch"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "road_closures"
    ]
  },
  {
    "patterns": [
      "Why is Willow Flats closed in early summer?",
      "When is Willow Flats open to hikers?",
      "Can I hike through Willow Flats in June?",
      "Is Willow Flats a seasonal closure?"
    ],
    "response": "Willow Flats is closed from May 15 to July 15 or when otherwise posted. This area is sensitive wildlife habitat, especially for nesting birds and calving moose. Respect closure signs.",
    "keywords": [
      "willow flats",
      "seasonal closure",
      "wildlife",
      "grand teton"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "wildlife_closures"
    ]
  },
  {
    "patterns": [
      "What are the hiking rules for bald eagle nesting areas?",
      "Are trails closed for eagle nesting?",
      "Can I hike near nesting birds?",
      "Where are the eagle closure zones?"
    ],
    "response": "Specific areas near rivers and lakes are closed during bald eagle and waterbird nesting seasons. Closures are posted along trails as needed. Always respect wildlife signage and detours.",
    "keywords": [
      "eagles",
      "nesting",
      "bird closures",
      "wildlife"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "avian_protection"
    ]
  },
  {
    "patterns": [
      "What is the Lakeshore Trail like?",
      "Can I do an easy hike with lake views?",
      "Where is the Lakeshore Trail located?",
      "Is Lakeshore Trail good for families?"
    ],
    "response": "The Lakeshore Trail near Colter Bay is an easy 1–2 hour hike with views of Jackson Lake and the Teton Range. It’s a great choice for a relaxing walk with scenic water and mountain backdrops.",
    "keywords": [
      "lakeshore trail",
      "colter bay",
      "easy hike",
      "lake views"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "easy_trail"
    ]
  },
  {
    "patterns": [
      "Where is the Taggart Lake hike?",
      "Is Taggart Lake trail open in winter?",
      "Can I do Taggart and Bradley as a loop?",
      "How long is the Taggart Lake trail?"
    ],
    "response": "Taggart Lake is a popular year-round trail starting at the Taggart Lake Trailhead. The easy hike to Taggart alone takes 1–2 hours. The moderate Taggart-Bradley Lake Loop takes 2–3 hours total.",
    "keywords": [
      "taggart lake",
      "bradley lake",
      "loop hike",
      "year round"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "moderate_trail"
    ]
  },
  {
    "patterns": [
      "Is Lunch Tree Hill an easy hike?",
      "Where can I hike near Jackson Lake Lodge?",
      "What’s the duration of Lunch Tree Hill trail?",
      "Does Lunch Tree Hill offer mountain views?"
    ],
    "response": "Lunch Tree Hill is a short 20–45 minute hike near Jackson Lake Lodge offering wide views of the Teton Range. It’s a perfect introductory trail for early risers or families.",
    "keywords": [
      "lunch tree hill",
      "jackson lake",
      "short hike",
      "scenic"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "short_walk"
    ]
  },
  {
    "patterns": [
      "What are the hiking safety tips for Grand Teton?",
      "Is it safe to hike alone in the Tetons?",
      "What do I need to bring on a hike?",
      "How should I prepare for backcountry hiking?"
    ],
    "response": "Hiking in Grand Teton requires preparation. Carry bear spray, a map, rain gear, food, and water. Avoid solo hiking. Tell someone your plan, and always hike in groups when possible. Be aware of elevation gain and sudden weather changes.",
    "keywords": [
      "safety",
      "preparation",
      "gear",
      "solo hiking"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "trail_safety"
    ]
  },
  {
    "patterns": [
      "Where is the Paintbrush-Cascade Canyon Loop?",
      "How long does the Paintbrush Loop take?",
      "Is Paintbrush Canyon a strenuous hike?",
      "What is the best strenuous hike in Grand Teton?"
    ],
    "response": "The Paintbrush-Cascade Canyon Loop is a challenging 11–14 hour hike (or overnight trip) covering alpine meadows and mountain passes. It begins at String Lake and offers stunning views of the Teton peaks. Snow may linger into mid-July—check conditions first.",
    "keywords": [
      "paintbrush",
      "cascade canyon",
      "loop hike",
      "strenuous"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "strenuous_loop"
    ]
  },
  {
    "patterns": [
      "Where can I hike to Lake Solitude?",
      "Is Lake Solitude an overnight hike?",
      "How long is the hike to Lake Solitude?",
      "Can I hike to Lake Solitude in a day?"
    ],
    "response": "Lake Solitude is a beautiful alpine lake accessed via Cascade Canyon. Expect 9–13 hours for a roundtrip hike from Jenny Lake. It’s possible as a long day hike, or you can camp with a permit.",
    "keywords": [
      "lake solitude",
      "cascade canyon",
      "alpine lake",
      "overnight"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "alpine_lake"
    ]
  },
  {
    "patterns": [
      "How difficult is Surprise and Amphitheater Lakes trail?",
      "Where do I start for Amphitheater Lake?",
      "Is this a good trail for alpine views?",
      "How long is the Surprise Lake hike?"
    ],
    "response": "Surprise and Amphitheater Lakes are accessed from the Lupine Meadows Trailhead. This strenuous hike gains significant elevation over 5–7 hours, offering excellent alpine views and wildflowers in summer.",
    "keywords": [
      "surprise lake",
      "amphitheater",
      "lupine meadows",
      "strenuous"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "strenuous_dayhike"
    ]
  },
  {
    "patterns": [
      "Where does the Hermitage Point Trail go?",
      "Is Hermitage Point a long hike?",
      "Can I camp at Hermitage Point?",
      "What’s the terrain like at Hermitage Point?"
    ],
    "response": "Hermitage Point is a moderately strenuous 4–7 hour hike from Colter Bay with lake and mountain views. Some hikers use it for overnight trips with a permit. The trail passes meadows and wetlands—wildlife sightings are common.",
    "keywords": [
      "hermitage point",
      "colter bay",
      "overnight",
      "lake views"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "moderate_distance"
    ]
  },
  {
    "patterns": [
      "Is the Forks of Cascade Canyon trail hard?",
      "How far into Cascade Canyon can I hike?",
      "Where does the Cascade Canyon trail start?",
      "How long is Forks of Cascade Canyon hike?"
    ],
    "response": "The Forks of Cascade Canyon hike begins at Jenny Lake and travels deep into the canyon, taking 5–9 hours roundtrip. The trail is moderately strenuous, with mountain scenery, waterfalls, and wildlife common along the route.",
    "keywords": [
      "cascade canyon",
      "forks",
      "moderate hike",
      "wildlife"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "moderate_to_strenuous"
    ]
  },
  {
    "patterns": [
      "What should I know about stream crossings?",
      "Is it safe to cross rivers in early summer?",
      "When do the streams run high in Grand Teton?",
      "Are there bridges on all hiking trails?"
    ],
    "response": "During spring and early summer, stream crossings can be dangerous due to snowmelt. Not all trails have bridges. Avoid risky crossings and turn back if needed. Plan ahead and check with rangers for conditions.",
    "keywords": [
      "stream crossings",
      "safety",
      "rivers",
      "bridges"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "stream_safety"
    ]
  },
  {
    "patterns": [
      "When do valley trails become snow-free?",
      "Are mountain passes clear in early June?",
      "What are trail conditions like in July?",
      "Is there snow on the trail in summer?"
    ],
    "response": "Valley trails are typically snow-free by mid-June, but mountain trails and passes may hold snow into late July. Use caution crossing snowfields, especially without experience or equipment.",
    "keywords": [
      "snow",
      "trail conditions",
      "valley trails",
      "mountain passes"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "seasonal_conditions"
    ]
  },
  {
    "patterns": [
      "Are dogs allowed on hiking trails?",
      "Can I hike with my pet in Grand Teton?",
      "Are pets permitted on backcountry trails?",
      "What are the pet restrictions in the park?"
    ],
    "response": "Pets are not allowed on any hiking trails or in the backcountry in Grand Teton National Park. This is to protect wildlife and visitor safety. Leashed pets are only permitted in parking lots, campgrounds, and along roads.",
    "keywords": [
      "pets",
      "dogs",
      "trails",
      "restrictions"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "pet_policy"
    ]
  },
  {
    "patterns": [
      "Where are good places to hike in fall?",
      "What are the best fall foliage hikes?",
      "Is hiking in autumn safe in the Tetons?",
      "Are trails open during fall?"
    ],
    "response": "Fall is an excellent time to hike in Grand Teton. Trails like Taggart Lake, Aspen Ridge, and Paintbrush Canyon offer vibrant foliage. Be prepared for cooler temperatures and fewer services. Trail conditions vary—check with visitor centers.",
    "keywords": [
      "fall",
      "autumn",
      "foliage",
      "seasonal hikes"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "fall_hikes"
    ]
  },
  {
    "patterns": [
      "Where do I park for popular hikes?",
      "When does parking fill at Jenny Lake?",
      "Are there parking tips for trailheads?",
      "What should I do if parking is full?"
    ],
    "response": "Trailhead parking at Jenny Lake, String Lake, and Lupine Meadows fills early—often before 9 AM. Start your hike early and have an alternate plan. Never park on vegetation, which can result in fines and fire risk.",
    "keywords": [
      "parking",
      "trailhead",
      "jenny lake",
      "tips"
    ],
    "tags": [
      "grand_teton",
      "hiking",
      "parking_info"
    ]
  }
]