[
  {
    "patterns": [
      "What is the Climbers' Ranch in Grand Teton?",
      "Tell me about the American Alpine Club Climbers' Ranch.",
      "Where can climbers stay in Grand Teton National Park?",
      "Is there a bunkhouse for climbers near the Tetons?"
    ],
    "response": "The American Alpine Club Grand Teton Climbers' Ranch is a rustic lodging option open mid-June to mid-September. Guests stay in co-ed bunk rooms and must bring their own sleeping mat and bedding. The ranch has showers, potable water, flush toilets, and a shared cooking shelter. No pets allowed. Reservations: https://americanalpineclub.org/grand-teton-climbers-ranch. Call 307-733-7271 (June 1–Sept 15) or 303-384-0110 otherwise.",
    "keywords": [
      "climbers",
      "ranch",
      "alpine",
      "bunkhouse",
      "grand teton"
    ],
    "tags": [
      "grand_teton",
      "lodging",
      "climbers_ranch"
    ]
  },
  {
    "patterns": [
      "What are Colter Bay Cabins like?",
      "Can I stay in a log cabin at Colter Bay?",
      "Where are the Colter Bay tent-cabins?",
      "Are there cabins near Jackson Lake?"
    ],
    "response": "Colter Bay Cabins, located near Jackson Lake, include 208 log cabins and tent-cabins. Open late-May to late-September. Nearby activities include horseback riding and marina access. Call 307-543-3100 or visit http://www.gtlc.com/lodges/colter-bay-village for reservations and unit descriptions.",
    "keywords": [
      "colter bay",
      "cabins",
      "jackson lake",
      "tent cabin",
      "lodging"
    ],
    "tags": [
      "grand_teton",
      "lodging",
      "colter_bay"
    ]
  },
  {
    "patterns": [
      "Where is Headwaters Lodge located?",
      "Tell me about Flagg Ranch lodging.",
      "Are there cabins near Yellowstone and Grand Teton?",
      "What is the Headwaters Lodge like?"
    ],
    "response": "Headwaters Lodge & Cabins at Flagg Ranch offers log-style lodging with two queen beds or one king, plus camper cabins. Located between Yellowstone and Grand Teton. Open early-June to late-September. Offers horseback riding, fishing, and floating. Reservations: http://www.gtlc.com/lodges/headwaters-lodge-at-flagg-ranch or call 307-543-2861.",
    "keywords": [
      "headwaters",
      "flagg ranch",
      "lodging",
      "cabins",
      "yellowstone access"
    ],
    "tags": [
      "grand_teton",
      "lodging",
      "headwaters_lodge"
    ]
  },
  {
    "patterns": [
      "What is Jackson Lake Lodge like?",
      "Can I stay at a hotel in Grand Teton?",
      "Where can I find full-service lodging in the Tetons?",
      "Tell me about rooms at Jackson Lake Lodge."
    ],
    "response": "Jackson Lake Lodge is a full-service resort in the heart of Grand Teton. It features 348 guest cottage rooms and 37 rooms in the main lodge, all with two double beds. Open mid-May to early-October. Includes dining, shopping, and activities like floating and horseback riding. Reservations: http://www.gtlc.com/lodges/jackson-lake-lodge or call 307-543-3100.",
    "keywords": [
      "jackson lake lodge",
      "resort",
      "full service",
      "lodging",
      "hotel"
    ],
    "tags": [
      "grand_teton",
      "lodging",
      "jackson_lake_lodge"
    ]
  },
  {
    "patterns": [
      "Where is Jenny Lake Lodge?",
      "What kind of lodging is at Jenny Lake?",
      "Are there cabins near Jenny Lake?",
      "Can I stay in luxury cabins in Grand Teton?"
    ],
    "response": "Jenny Lake Lodge is a luxurious and secluded lodging option featuring 37 cabins nestled in the forest near Jenny and String Lakes. Open early-June to early-October. A perfect base for quiet retreats or scenic hikes. Reservations: http://www.gtlc.com/lodges/jenny-lake-lodge or call 307-733-4647.",
    "keywords": [
      "jenny lake",
      "luxury cabins",
      "forest",
      "secluded",
      "grand teton"
    ],
    "tags": [
      "grand_teton",
      "lodging",
      "jenny_lake_lodge"
    ]
  },
  {
    "patterns": [
      "Tell me about Signal Mountain Lodge.",
      "Are there lakeside cabins at Signal Mountain?",
      "Where can I find cabins with fireplaces in Grand Teton?",
      "What activities are available at Signal Mountain?"
    ],
    "response": "Signal Mountain Lodge offers lakefront apartments, log cabins (some with fireplaces), and motel-style units beside Jackson Lake. Open early-May to mid-October. Activities include float trips, lake fishing, canoeing, and boat rentals. Multiple dining options onsite. Reservations: http://www.signalmountainlodge.com/lodging-and-cabin-rentals or call 307-543-2831.",
    "keywords": [
      "signal mountain",
      "jackson lake",
      "cabin rentals",
      "fishing",
      "lodging"
    ],
    "tags": [
      "grand_teton",
      "lodging",
      "signal_mountain"
    ]
  },
  {
    "patterns": [
      "What is Triangle X Ranch?",
      "Can I stay at a dude ranch in Grand Teton?",
      "Where can I go horseback riding and stay overnight?",
      "Tell me about western lodging near Grand Teton."
    ],
    "response": "Triangle X Ranch is a historic dude ranch offering weeklong stays on the American Plan. Guests enjoy horseback riding, fishing, cookouts, and dancing. Open mid-May to mid-October (with limited winter season). Visit http://www.trianglex.com/ or call 307-733-2183 for reservations.",
    "keywords": [
      "triangle x",
      "dude ranch",
      "horseback",
      "western",
      "grand teton"
    ],
    "tags": [
      "grand_teton",
      "lodging",
      "triangle_x"
    ]
  },
  {
    "patterns": [
      "When is lodging available in Grand Teton?",
      "What months can I stay overnight in the Tetons?",
      "Are park lodges open in winter?",
      "What’s the lodging season in Grand Teton?"
    ],
    "response": "Most lodging in Grand Teton National Park is open from mid-May through mid-October. Climbers' Ranch operates mid-June to mid-September. Triangle X Ranch is also open in winter for select bookings. Always check availability before visiting.",
    "keywords": [
      "lodging season",
      "open months",
      "grand teton",
      "availability"
    ],
    "tags": [
      "grand_teton",
      "lodging_info",
      "seasonal_availability"
    ]
  },
  {
    "patterns": [
      "Are pets allowed in Grand Teton lodging?",
      "Can I bring my dog to stay in a cabin?",
      "Do any park lodges allow pets?",
      "What are the pet policies for staying in the park?"
    ],
    "response": "Pets are not allowed at most Grand Teton lodging facilities, including Climbers’ Ranch. Some lodges may permit pets in specific units with advance notice. Always confirm with the property before booking.",
    "keywords": [
      "pets",
      "dog friendly",
      "lodging",
      "grand teton"
    ],
    "tags": [
      "grand_teton",
      "lodging_policy",
      "pet_rules"
    ]
  },
  {
    "patterns": [
      "Do any Grand Teton lodges have kitchens?",
      "Can I cook my own meals while staying in the park?",
      "Are there cabins with kitchenettes in Grand Teton?",
      "What are the self-catering options in Grand Teton?"
    ],
    "response": "Signal Mountain Lodge offers lakefront units with kitchenettes. The Climbers' Ranch has a communal cooking shelter, but guests must bring their own food and gear. Other lodges focus on full-service dining or American Plan arrangements.",
    "keywords": [
      "kitchen",
      "self-catering",
      "cook",
      "lodging",
      "grand teton"
    ],
    "tags": [
      "grand_teton",
      "lodging_features",
      "cooking"
    ]
  },
  {
    "patterns": [
      "What’s the most rustic lodging in Grand Teton?",
      "Is there a backcountry-style place to stay?",
      "Where can I stay that’s close to nature?",
      "Are there bunkhouses in Grand Teton?"
    ],
    "response": "The American Alpine Club Climbers’ Ranch is the most rustic option in Grand Teton. It features co-ed bunk rooms, shared facilities, and a community cooking area—perfect for minimalists and mountaineers.",
    "keywords": [
      "rustic",
      "bunkhouse",
      "backcountry",
      "grand teton"
    ],
    "tags": [
      "grand_teton",
      "lodging",
      "rustic_option"
    ]
  },
  {
    "patterns": [
      "What’s the most luxurious lodge in Grand Teton?",
      "Is there a high-end place to stay in the Tetons?",
      "Where can I stay in style near Jenny Lake?",
      "Are there premium cabins in the park?"
    ],
    "response": "Jenny Lake Lodge offers luxury accommodations in a secluded forest setting. The 37 individual cabins provide a unique upscale experience with proximity to iconic trails and lakes.",
    "keywords": [
      "luxury",
      "jenny lake",
      "premium",
      "high end",
      "grand teton"
    ],
    "tags": [
      "grand_teton",
      "lodging",
      "luxury_option"
    ]
  },
  {
    "patterns": [
      "Are there cabins close to Jackson Lake?",
      "What lodges are lakeside in Grand Teton?",
      "Can I stay near the lake in Grand Teton?",
      "Which lodge has views of Jackson Lake?"
    ],
    "response": "Colter Bay Cabins and Signal Mountain Lodge both offer accommodations close to Jackson Lake. Signal Mountain Lodge has lakefront cabins and boat rentals; Colter Bay includes log and tent-cabins with marina access.",
    "keywords": [
      "jackson lake",
      "lakefront",
      "cabin",
      "water access"
    ],
    "tags": [
      "grand_teton",
      "lodging",
      "lakeside"
    ]
  },
  {
    "patterns": [
      "Can I go horseback riding where I stay in Grand Teton?",
      "Do any lodges offer trail rides?",
      "Where can I stay and ride horses?",
      "Are there equestrian activities at lodges?"
    ],
    "response": "Yes. Triangle X Ranch specializes in horseback riding vacations. Headwaters Lodge and Jackson Lake Lodge also offer guided trail rides during the summer season.",
    "keywords": [
      "horseback",
      "trail rides",
      "lodging",
      "grand teton"
    ],
    "tags": [
      "grand_teton",
      "lodging_activities",
      "horseback"
    ]
  },
  {
    "patterns": [
      "Which lodging is closest to Yellowstone?",
      "Where should I stay near Yellowstone south entrance?",
      "What lodge connects Yellowstone and Grand Teton?",
      "Is there a lodge between the two parks?"
    ],
    "response": "Headwaters Lodge & Cabins at Flagg Ranch is centrally located between Yellowstone and Grand Teton, just south of Yellowstone’s entrance. It’s a perfect base for exploring both parks.",
    "keywords": [
      "yellowstone",
      "flagg ranch",
      "between parks",
      "grand teton"
    ],
    "tags": [
      "grand_teton",
      "lodging",
      "gateway_location"
    ]
  },
  {
    "patterns": [
      "Do any lodges offer fishing or boating?",
      "Where can I rent a boat and stay overnight?",
      "Are there fishing-friendly lodges?",
      "Can I stay by a marina in Grand Teton?"
    ],
    "response": "Signal Mountain Lodge has guided lake fishing, float trips, canoe, and boat rentals. Colter Bay Village has a full-service marina with rentals and boat tours. Both provide lodging nearby.",
    "keywords": [
      "fishing",
      "boating",
      "marina",
      "lodging",
      "grand teton"
    ],
    "tags": [
      "grand_teton",
      "lodging_activities",
      "boating_fishing"
    ]
  },
  {
    "patterns": [
      "Which lodges offer group or family-friendly stays?",
      "Where can large families stay in the park?",
      "Are there multiple-room options in Grand Teton lodging?",
      "What’s a good place for a family trip in Grand Teton?"
    ],
    "response": "Jackson Lake Lodge offers family-oriented accommodations, dining, and activities. Colter Bay Cabins and Signal Mountain Lodge also have options suitable for families and groups.",
    "keywords": [
      "family",
      "group lodging",
      "grand teton",
      "multiple rooms"
    ],
    "tags": [
      "grand_teton",
      "lodging",
      "family_friendly"
    ]
  },
  {
    "patterns": [
      "Do I need reservations to stay in Grand Teton?",
      "Can I walk in and get a cabin?",
      "Should I book Grand Teton lodging in advance?",
      "Are last-minute stays available in the park?"
    ],
    "response": "Reservations are strongly recommended, especially from late spring to early fall. Most lodges, including Jenny Lake, Jackson Lake, and Colter Bay, fill up quickly during peak season. Some same-day availability may be offered at lesser-known locations like Climbers’ Ranch.",
    "keywords": [
      "reservations",
      "booking",
      "lodging",
      "grand teton"
    ],
    "tags": [
      "grand_teton",
      "lodging_policy",
      "booking_required"
    ]
  },
  {
    "patterns": [
      "Where can I stay with minimal amenities?",
      "Is there a budget-friendly place in the park?",
      "Are there simple cabins or bunkhouses?",
      "What are the cheapest lodging options?"
    ],
    "response": "The American Alpine Club Climbers’ Ranch offers the most basic and affordable accommodations. Camp-style bunkrooms, shared facilities, and no frills—perfect for hikers and climbers on a budget.",
    "keywords": [
      "budget",
      "cheap lodging",
      "bunkhouse",
      "grand teton"
    ],
    "tags": [
      "grand_teton",
      "lodging",
      "budget_friendly"
    ]
  }
]