[
  {
    "patterns": [
      "Do I need a permit to boat in Grand Teton?",
      "What permits are required for kayaking?",
      "Do SUPs need a permit in the park?",
      "Is a Grand Teton boat permit mandatory?"
    ],
    "response": "Yes, all watercraft—including canoes, kayaks, drift boats, paddleboards, and motorboats—must have a valid Grand Teton Boat Permit. Permits are available on Recreation.gov or at Moose and Colter Bay visitor centers during summer. Motorized: $75, Non-motorized: $25.",
    "keywords": [
      "permit",
      "boating",
      "kayak",
      "sup",
      "grand teton"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "permit_requirements"
    ]
  },
  {
    "patterns": [
      "What is a Wyoming AIS decal?",
      "Do I need an AIS decal for my boat?",
      "Is AIS required for paddleboards?",
      "How do I get a Wyoming invasive species decal?"
    ],
    "response": "All watercraft must display a Wyoming Aquatic Invasive Species (AIS) decal, except non-motorized inflatables under 10 feet. Decals are available from the Wyoming Game and Fish website. Fees range from $5 to $30 depending on vessel type and residency.",
    "keywords": [
      "ais decal",
      "aquatic invasive species",
      "wyoming",
      "boat"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "ais_regulations"
    ]
  },
  {
    "patterns": [
      "What are the rules for AIS inspections?",
      "Does my boat need to be inspected?",
      "Where are AIS inspections done?",
      "Who needs to stop for AIS inspection?"
    ],
    "response": "All boats 10 feet or longer must stop for Aquatic Invasive Species (AIS) inspection before launching in the park. Out-of-state vessels must show proof of inspection. This includes canoes, kayaks, SUPs, and motorboats.",
    "keywords": [
      "ais inspection",
      "boat check",
      "aquatic invasive",
      "launch rules"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "inspection_rules"
    ]
  },
  {
    "patterns": [
      "Are there boating safety equipment requirements?",
      "What gear do I need on my boat?",
      "Do I need a life jacket in Grand Teton?",
      "Is a fire extinguisher required on boats?"
    ],
    "response": "Yes, boats must carry U.S. Coast Guard-approved PFDs for every person. Children under 13 must wear them at all times. Motorized boats must also carry navigation lights, a fire extinguisher, and a sound-producing device.",
    "keywords": [
      "safety gear",
      "pfd",
      "boat safety",
      "fire extinguisher"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "safety_requirements"
    ]
  },
  {
    "patterns": [
      "Are jet skis allowed in Grand Teton?",
      "Can I use a personal watercraft in the park?",
      "Is PWC use permitted on Jackson Lake?",
      "Are Jet Skis banned in Grand Teton?"
    ],
    "response": "No, Jet Skis and personal watercraft (PWC) are prohibited on all park waters, including Jackson Lake and the Snake River.",
    "keywords": [
      "jet ski",
      "pwc",
      "personal watercraft",
      "jackson lake"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "prohibited_watercraft"
    ]
  },
  {
    "patterns": [
      "Where can I use a sailboat in Grand Teton?",
      "Are sailboats allowed on park lakes?",
      "Can I windsurf on Jackson Lake?",
      "Is sailing permitted in the Tetons?"
    ],
    "response": "Sailboats and windsurfers are allowed only on Jackson Lake. They require both a Grand Teton Boat Permit and AIS decal. Starting in 2025, sailboats with gravity-fed ballasts must undergo a 30-day dry quarantine.",
    "keywords": [
      "sailboat",
      "windsurf",
      "jackson lake",
      "quarantine"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "sailing_rules"
    ]
  },
  {
    "patterns": [
      "Can I water ski in Grand Teton?",
      "Where is wakeboarding allowed in the park?",
      "Are there rules for towing skiers?",
      "What are the water skiing regulations?"
    ],
    "response": "Water skiing and wakeboarding are allowed on Jackson Lake only. Towing is permitted from sunrise to sunset with at least two people in the boat. Skiers must wear approved PFDs and stay 500 feet from beaches and moorings.",
    "keywords": [
      "water skiing",
      "wakeboarding",
      "tow",
      "pfd"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "water_sports"
    ]
  },
  {
    "patterns": [
      "Where can I launch a kayak in Grand Teton?",
      "Are there designated launch areas?",
      "Can I launch at the Snake River?",
      "Are there restrictions for launching boats?"
    ],
    "response": "Launch at designated landings along the Snake River or boat ramps on Jackson, Jenny, and Leigh Lakes. Motorized use is not allowed on the Snake River. All watercraft must stop at AIS inspection stations before launching.",
    "keywords": [
      "launch",
      "kayak",
      "boat ramp",
      "snake river"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "launch_sites"
    ]
  },
  {
    "patterns": [
      "Can I camp along the lakeshore?",
      "What are the camping rules for Jackson Lake?",
      "Is shore camping allowed in the park?",
      "Where can I camp by the water?"
    ],
    "response": "Camping is only allowed at designated numbered lakeshore sites on Jackson and Leigh Lakes. A backcountry camping permit is required. Maximum stay is 3 nights per site. Campfires are allowed only in metal grates.",
    "keywords": [
      "lakeshore camping",
      "jackson lake",
      "backcountry",
      "permits"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "lakeshore_camping"
    ]
  },
  {
    "patterns": [
      "Are pets allowed on boats?",
      "Can I bring my dog on the Snake River?",
      "Where are pets allowed on Jackson Lake?",
      "Can my dog camp with me by the lake?"
    ],
    "response": "Pets are allowed for day use in boats on Jackson Lake only. They are not permitted on the Snake River, on lakeshore campsites (except Spalding Bay), or on shorelines outside designated areas. Leashes under 6 feet are required.",
    "keywords": [
      "pets",
      "dogs",
      "jackson lake",
      "boat"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "pet_policy"
    ]
  },
  {
    "patterns": [
      "Can I anchor my boat overnight on Jackson Lake?",
      "Are anchored vessels allowed to overnight in the park?",
      "Do I need a permit to anchor off shore?",
      "What are the rules for sleeping on a boat?"
    ],
    "response": "Yes, anchored vessels can overnight on Jackson Lake without a permit. They must follow U.S. Coast Guard regulations. Anchoring is limited to 10 nights between June 1 and Labor Day and not more than 30 nights per year. No overnight camping on shore after anchoring.",
    "keywords": [
      "anchored boat",
      "overnight",
      "jackson lake",
      "permit"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "overnight_rules"
    ]
  },
  {
    "patterns": [
      "Can I park a trailer at a boat launch?",
      "Where is trailer parking available?",
      "Is there long-term parking for boats?",
      "Can I leave my trailer overnight?"
    ],
    "response": "Trailer parking is available at Snake River landings, Colter Bay, Signal Mountain, and Spalding Bay (with permit). Short-term parking has a 3-night limit; after 72 hours, trailers must be moved for at least 24 hours. Max 30 days per year.",
    "keywords": [
      "trailer",
      "parking",
      "launch",
      "boat ramp"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "trailer_parking"
    ]
  },
  {
    "patterns": [
      "What do I do after a boating accident?",
      "Do I have to report a boat collision?",
      "Who do I contact after a boating incident?",
      "What happens if my boat catches fire?"
    ],
    "response": "All boating accidents, collisions, and incidents resulting in injury or damage must be reported to a park ranger immediately. Operators must provide written contact and vessel details to affected persons and fulfill any state and federal reporting duties.",
    "keywords": [
      "accident",
      "collision",
      "report",
      "boating"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "incident_reporting"
    ]
  },
  {
    "patterns": [
      "Can I build a fire while boating or camping?",
      "Are fires allowed on the Snake River?",
      "Where can I have a fire near water?",
      "Can I use a campfire while camping by the lake?"
    ],
    "response": "Fires are prohibited along the Snake River. They are only allowed below the high water line on Jackson Lake in metal grates and are not permitted from Spalding Bay to Lizard Creek. Always fully extinguish fires before leaving.",
    "keywords": [
      "fire",
      "campfire",
      "snake river",
      "jackson lake"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "fire_regulations"
    ]
  },
  {
    "patterns": [
      "What is considered a water sport toy?",
      "Do I need a permit for inflatables?",
      "Are paddleboards considered watercraft?",
      "Are inflatable tubes regulated?"
    ],
    "response": "Non-motorized inflatables under 10 feet, including water sport toys and solid or inflatable paddleboards, are exempt from Wyoming AIS decals but still must stop for AIS inspections and require Grand Teton Boat Permits.",
    "keywords": [
      "water sport",
      "inflatable",
      "paddleboard",
      "toy"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "equipment_regulations"
    ]
  },
  {
    "patterns": [
      "What are the rules for floating the Snake River?",
      "Can I use a drift boat on the Snake River?",
      "Is rafting allowed in the park?",
      "What types of boats are allowed on the river?"
    ],
    "response": "Only human-powered vessels—rafts, drift boats, canoes, and kayaks—are allowed on the Snake River. Motorized boats, inner tubes, float tubes, and air mattresses are prohibited. Floating is not allowed within 1,000 ft of Jackson Lake Dam.",
    "keywords": [
      "snake river",
      "drift boat",
      "rafting",
      "non-motorized"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "snake_river_rules"
    ]
  },
  {
    "patterns": [
      "What does Clean Drain Dry mean?",
      "How do I prevent spreading invasive species?",
      "Why is cleaning boats important?",
      "What is the AIS prevention process?"
    ],
    "response": "Clean, Drain, Dry your equipment after each use to prevent the spread of Aquatic Invasive Species like zebra mussels. This applies to boats, trailers, waders, and all gear. Follow these steps every time you move between water bodies.",
    "keywords": [
      "clean",
      "drain",
      "dry",
      "ais prevention"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "ais_prevention"
    ]
  },
  {
    "patterns": [
      "Where can I boat with an electric motor?",
      "Can I use a small motor on Jenny Lake?",
      "Are there horsepower limits on park lakes?",
      "Which lakes allow motorized boats?"
    ],
    "response": "All motorized boats are permitted on Jackson Lake. Jenny Lake allows motorized boats with 10 HP or less. Other lakes like Leigh, Phelps, and String are limited to non-motorized use only.",
    "keywords": [
      "motor",
      "hp limit",
      "jenny lake",
      "motorized boats"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "motor_limits"
    ]
  },
  {
    "patterns": [
      "Can I boat on Pacific Creek or Cottonwood Creek?",
      "What waterways are closed to boats?",
      "Are there restricted areas for boating?",
      "Is the Gros Ventre River open to watercraft?"
    ],
    "response": "Waterways like Pacific Creek, Cottonwood Creek, Buffalo Fork, and the Gros Ventre River are closed to all watercraft. Boating is restricted to designated areas such as the Snake River and select lakes.",
    "keywords": [
      "restricted",
      "creek",
      "closed water",
      "grand teton"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "restricted_areas"
    ]
  },
  {
    "patterns": [
      "Do I need lights on my boat at night?",
      "Are navigation lights required after dark?",
      "What are the night boating rules?",
      "Is night boating allowed in Grand Teton?"
    ],
    "response": "All vessels must use navigation lights from sunset to sunrise. Night boating is permitted on Jackson Lake with required safety gear. Always carry a sound device and follow U.S. Coast Guard lighting standards.",
    "keywords": [
      "night",
      "lights",
      "navigation",
      "boating"
    ],
    "tags": [
      "grand_teton",
      "boating",
      "night_safety"
    ]
  }
]