{
  "intents": [
    {
      "patterns": [
        "Where should I go shopping in Bozeman?",
        "What are the top stores in Bozeman?",
        "Any good thrift shops in Bozeman?",
        "What are the best places to shop in Bozeman?",
        "Best grocery stores for travelers in Bozeman?",
        "Is there a mall in Bozeman?",
        "Are there local boutiques in Bozeman?",
        "Where do locals shop in Bozeman?",
        "Best places to grab supplies in Bozeman?",
        "What are the best thrift stores in town?"
      ],
      "response": "🛍️ **Bozeman Shopping Guide: Where to Thrift, Browse, and Stock Up**\n\n**Top Thrift Stores:** Sacks Thrift (Mendenhall), Twice Treasured, Nu2U, and Goodwill all offer affordable, organized gems with a local feel. Don’t miss Sack’s of Belgrade just outside town.\n\n**Local Shops & Boutiques:** Walk downtown for gems like Heyday, Root, The Montana Scene, and Schnee’s for western or outdoor gear. Don’t skip Round House for ski gear or Owenhouse Ace for classic Montana hardware.\n\n**Retail Hotspots:** Gallatin Valley Mall (recently refreshed) has REI, Athleta, Barnes & Noble, and food spots. Big box options like Target, Costco, and WinCo are convenient for travelers.\n\n**Best Grocery Stops:** Town & Country Foods (Main & West), the Community Co-op, Rosauers, and Joe’s Parkway give great local options. Costco is perfect for road trip stocking. Skip Walmart — Bozeman’s got better.\n\nLocals love the mix of charm, access, and quality — whether you’re in need of hiking socks or local huckleberry jam.",
      "keywords": [
        "shopping",
        "bozeman stores",
        "thrift shops",
        "bozeman grocery",
        "mall",
        "retail",
        "boutiques",
        "where to shop",
        "local stores"
      ],
      "tags": [
        "budget",
        "family_friendly",
        "travel_supplies",
        "local_gems",
        "bozeman"
      ]
    }
  ]
}