[
  {
    "patterns": [
      "How do I get to the Grand Canyon of the Yellowstone?",
      "Directions to Yellowstone Canyon from Canyon Village?",
      "What's the best way to reach Yellowstone Canyon?"
    ],
    "response": "From Canyon Village, turn left and go to the four-way intersection by the service station. Turn left again and follow signs for North Rim or South Rim Drives. North Rim includes Lookout and Inspiration Points. South Rim takes you to Artist Point and the Upper Falls viewpoints.",
    "tags": [
      "scenic spots",
      "park navigation",
      "trip planning"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "Where is the North Rim Drive?",
      "How do I get to Lookout Point in Yellowstone?",
      "Best place to park for Grand View Point?"
    ],
    "response": "North Rim Drive starts 1.5 miles from Canyon Village. Turn left at the sign and you’ll find parking for Lookout Point, Grand View, and Brink of the Lower Falls. These are some of the most popular views in the park.",
    "tags": [
      "scenic spots",
      "photography",
      "park navigation"
    ],
    "tiers": [
      "free",
      "premium"
    ]
  },
  {
    "patterns": [
      "What can I see from Artist Point?",
      "Is Artist Point worth visiting?",
      "How do I get to Artist Point in Yellowstone?"
    ],
    "response": "Artist Point offers a stunning view of the Lower Falls and the Yellowstone River as it cuts through the canyon. Drive 2 miles from Canyon Village and turn onto South Rim Drive. The road ends at the Artist Point parking area.",
    "tags": [
      "photography",
      "scenic spots",
      "geology"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "What’s the difference between the Upper and Lower Falls?",
      "How tall are Yellowstone’s waterfalls?",
      "Which is taller, the Upper or Lower Falls in Yellowstone?"
    ],
    "response": "The Upper Falls are 109 feet tall, while the Lower Falls are 308 feet. You can view both, but not at the same time due to the canyon bend. Great viewing spots include Brink of Upper Falls and Artist Point.",
    "tags": [
      "geology",
      "scenic spots",
      "trip planning"
    ],
    "tiers": [
      "free",
      "premium"
    ]
  },
  {
    "patterns": [
      "Is there a place to see both falls at once?",
      "Can I view the Upper and Lower Falls together?",
      "Best spot for viewing both Yellowstone waterfalls?"
    ],
    "response": "Unfortunately, due to a bend in the canyon, there is no single spot where both the Upper and Lower Falls are visible together. You'll need to visit viewpoints on both the North and South Rim to see each.",
    "tags": [
      "photography",
      "trip planning",
      "scenic spots"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "Where do I park for the Upper Falls Viewpoints?",
      "How do I reach the Upper Falls viewing area?",
      "Is there parking near Upper Falls?"
    ],
    "response": "To reach the Upper Falls Viewpoints, take South Rim Drive from Canyon Village. The first left off that road leads directly to the Upper Falls parking area.",
    "tags": [
      "park navigation",
      "trip planning",
      "scenic spots"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "Can I hike to the bottom of the canyon?",
      "Is there a trail that goes into Yellowstone Canyon?",
      "What’s the Seven Mile Hole Trail like?"
    ],
    "response": "The Seven Mile Hole Trail is the only official trail into the canyon. It's a strenuous 10.2-mile round trip with steep elevation change, recommended for experienced hikers only.",
    "tags": [
      "trail safety",
      "hiking",
      "geology"
    ],
    "tiers": [
      "premium"
    ]
  },
  {
    "patterns": [
      "How did the Grand Canyon of the Yellowstone form?",
      "What caused the Yellowstone Canyon?",
      "Geology behind Yellowstone Canyon?"
    ],
    "response": "Yellowstone Canyon was carved by the river after the last volcanic eruption 631,000 years ago. Hydrothermal activity weakened the rock, allowing erosion to create the deep canyon you see today.",
    "tags": [
      "geology",
      "educational",
      "scenic spots"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "Why are the rocks different colors in the canyon?",
      "What causes the yellow and red in Yellowstone Canyon?",
      "Is the canyon really rusting?"
    ],
    "response": "Yes! The colors in the canyon come from oxidized iron compounds in the hydrothermally altered rock. The yellow tones come from sulfur and iron reacting over time.",
    "tags": [
      "geology",
      "educational",
      "photography"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "How much water goes over the falls?",
      "What’s the flow rate of Yellowstone’s Lower Falls?",
      "Is the river always that powerful?"
    ],
    "response": "Water flow varies widely throughout the year. At peak runoff, around 63,500 gallons per second pour over the Lower Falls. In late fall, it can drop to just 5,000 gallons per second.",
    "tags": [
      "geology",
      "seasonal info",
      "scenic spots"
    ],
    "tiers": [
      "free"
    ]
  }
]