[
  {
    "patterns": [
      "Are there showers at Canyon Campground?",
      "Can I take a shower at Canyon Campground in Yellowstone?",
      "Do they have shower facilities at the Canyon Campground?"
    ],
    "response": "Yes, Canyon Campground offers paid shower and laundry facilities. These are available seasonally and included with your nightly stay at the campground. It's one of the more developed sites in the park.",
    "tags": [
      "camping",
      "amenities",
      "park services"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "Can I bring my tent to Fishing Bridge RV Park?",
      "Are tents allowed at Fishing Bridge RV Park?",
      "Why can't I camp in a tent at Fishing Bridge RV Park?"
    ],
    "response": "Tents and tent trailers are not allowed at Fishing Bridge RV Park due to frequent bear activity. This campground is reserved for hard-sided RVs only, with full hookups available.",
    "tags": [
      "camping",
      "wildlife safety",
      "RV camping"
    ],
    "tiers": [
      "free",
      "premium"
    ]
  },
  {
    "patterns": [
      "Is there cell service at Madison Campground?",
      "Can I get a signal at Madison Campground?",
      "Do phones work at Madison Campground in Yellowstone?"
    ],
    "response": "Madison Campground does not have reliable cell service. If you need a signal, you may have better luck in nearby areas like West Yellowstone. Plan ahead for offline navigation and communication.",
    "tags": [
      "camping",
      "communication",
      "trip planning"
    ]
  },
  {
    "patterns": [
      "How long is Grant Village Campground open?",
      "When does Grant Village Campground close for the season?",
      "What are the 2025 opening and closing dates for Grant Village?"
    ],
    "response": "For the 2025 season, Grant Village Campground is scheduled to open on June 6 and close on September 14. Be sure to book early—it's one of the most popular campgrounds near Yellowstone Lake.",
    "tags": [
      "seasonal info",
      "camping",
      "reservations"
    ]
  },
  {
    "patterns": [
      "Can I use a generator at Bridge Bay Campground?",
      "Is generator use allowed at Bridge Bay?",
      "When can I run a generator at Bridge Bay Campground?"
    ],
    "response": "Generators are allowed at Bridge Bay Campground during posted quiet hours. Always follow park regulations to minimize noise impact on wildlife and other visitors.",
    "tags": [
      "camping",
      "generator use",
      "park etiquette"
    ]
  },
  {
    "patterns": [
      "Does Indian Creek Campground have potable water?",
      "Can I fill up my water bottles at Indian Creek?",
      "Is drinking water available at Indian Creek Campground?"
    ],
    "response": "Yes, potable water is available seasonally at Indian Creek Campground. Keep in mind that the water may be turned off when temperatures drop in late fall.",
    "tags": [
      "camping",
      "water access",
      "seasonal info"
    ]
  },
  {
    "patterns": [
      "Is Lewis Lake Campground good for boating?",
      "Can I launch a kayak from Lewis Lake Campground?",
      "Where can I access Lewis Lake with my canoe?"
    ],
    "response": "Lewis Lake Campground is a short walk from the shore of Lewis Lake, and a boat ramp is available nearby. It's a great spot for kayaking, canoeing, and small motorboats—with a valid permit and inspection.",
    "tags": [
      "camping",
      "boating",
      "water activities"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "How do I reserve a group campsite in Yellowstone?",
      "Where can I book a group camping spot in the park?",
      "Can groups reserve sites in Yellowstone campgrounds?"
    ],
    "response": "Group campsites are available at select campgrounds like Bridge Bay, Grant Village, and Madison. You can reserve them through Yellowstone National Park Lodges or Recreation.gov, depending on the site.",
    "tags": [
      "camping",
      "group travel",
      "reservations"
    ]
  },
  {
    "patterns": [
      "Is there firewood available at Grant Village Campground?",
      "Where can I buy firewood in Grant Village?",
      "Can I collect wood for campfires at Grant Village?"
    ],
    "response": "Firewood is sold seasonally at Grant Village Campground. Gathering wood in the park is prohibited, so be sure to purchase your bundles at the designated campground store or vendor.",
    "tags": [
      "camping",
      "park regulations",
      "campfires"
    ]
  },
  {
    "patterns": [
      "Can I camp at Mammoth in winter?",
      "Is Mammoth Campground open year-round?",
      "Where can I camp in Yellowstone in the winter?"
    ],
    "response": "Mammoth Campground is the only Yellowstone campground open year-round. It's first-come, first-served in winter and offers basic amenities. Great for wildlife viewing and snowy solitude.",
    "tags": [
      "camping",
      "winter travel",
      "accessibility"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "Is there a campground with lake views?",
      "Where can I camp near Yellowstone Lake?",
      "Which campground has views of Yellowstone Lake?"
    ],
    "response": "Bridge Bay Campground offers scenic views of Yellowstone Lake and nearby access to boating and fishing. It’s one of the largest campgrounds in the park and fills up fast in summer.",
    "tags": [
      "camping",
      "scenic spots",
      "lake access"
    ]
  },
  {
    "patterns": [
      "Which campground is closest to the Grand Canyon of the Yellowstone?",
      "Can I walk to the canyon from a campground?",
      "Where should I stay near the Yellowstone Canyon?"
    ],
    "response": "Canyon Campground is located near the Grand Canyon of the Yellowstone. It's within walking or a short drive distance to several scenic overlooks and trailheads.",
    "tags": [
      "camping",
      "scenic spots",
      "trail access"
    ]
  },
  {
    "patterns": [
      "Are bikes allowed at Yellowstone campgrounds?",
      "Can I ride my bike in the campgrounds?",
      "Is it okay to bring bikes to Yellowstone for camping?"
    ],
    "response": "Most Yellowstone campgrounds allow bikes, and some even have dedicated biker sites. Just follow posted safety rules and yield to pedestrians and wildlife.",
    "tags": [
      "camping",
      "biking",
      "kid-friendly"
    ]
  },
  {
    "patterns": [
      "Are there bear boxes at Madison Campground?",
      "Where do I store food at Madison Campground?",
      "Is food storage available at Madison Campground?"
    ],
    "response": "Yes, Madison Campground has food storage lockers available. Always store all scented items securely to protect both you and the park’s wildlife.",
    "tags": [
      "camping",
      "bear safety",
      "park safety"
    ]
  },
  {
    "patterns": [
      "Can I walk in to camp without a reservation?",
      "Are there first-come, first-served campgrounds in Yellowstone?",
      "Is walk-in camping allowed at any sites?"
    ],
    "response": "Most Yellowstone campgrounds now require reservations, but some like Mammoth offer limited first-come, first-served spots during the off-season. Always check online before heading out.",
    "tags": [
      "camping",
      "reservations",
      "seasonal info"
    ]
  }
]