[
  {
    "patterns": [
      "Why is Biscuit Basin closed?",
      "What happened at Biscuit Basin?",
      "Is Biscuit Basin safe to visit right now?"
    ],
    "response": "Biscuit Basin is currently closed due to a hydrothermal explosion that occurred on July 23, 2024. This event has made the area unstable, and the parking lot, boardwalk, and Firehole River nearby are closed to all travel until further notice. The closure is a safety precaution in case another explosion occurs. Please check with the park's official website or a visitor center for updates.",
    "tags": [
      "geothermal",
      "trail safety",
      "closures"
    ],
    "tiers": [
      "free",
      "premium"
    ]
  },
  {
    "patterns": [
      "Are there fishing restrictions in Yellowstone?",
      "Why can't I fish on the Madison or Firehole River in the afternoon?",
      "What are the 2 p.m. fishing closures in Yellowstone?"
    ],
    "response": "Due to high water temperatures and low river flows, Yellowstone has implemented 2 p.m. daily fishing closures on the Madison River and tributaries, Firehole River and tributaries, and Gibbon River downstream of Norris Campground. These closures are to protect fish during vulnerable conditions. Fishing may resume at sunrise the following day. Always check local signage and park alerts before you fish.",
    "tags": [
      "fishing",
      "wildlife protection",
      "river safety"
    ],
    "tiers": [
      "free",
      "premium"
    ]
  },
  {
    "patterns": [
      "What should I do if I see an elk near Mammoth?",
      "Why are elk with calves dangerous?",
      "Is it safe to walk near elk at Mammoth Hot Springs?"
    ],
    "response": "Elk with calves are extremely protective and can be very aggressive, especially near Mammoth Hot Springs. Calves are often hidden near buildings or vehicles. Stay at least 25 yards away from elk at all times. If an elk acts agitated or charges, back away slowly and seek shelter. Avoid blind corners and always stay alert when walking in this area.",
    "tags": [
      "wildlife viewing",
      "park safety",
      "trail safety"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "Do I need a vehicle reservation to enter Yellowstone?",
      "Is an entrance pass enough for Yellowstone?",
      "Can I enter Yellowstone without booking ahead?"
    ],
    "response": "You do not need a vehicle reservation to enter Yellowstone National Park. However, an entrance pass is required. You can purchase a pass online in advance or at any park entrance station upon arrival. Purchasing ahead can save time during busy seasons.",
    "tags": [
      "fees",
      "park entry",
      "trip planning"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "Where are fishing closures in Yellowstone right now?",
      "Is the Firehole River open for fishing?",
      "Why is fishing banned in some Yellowstone rivers?"
    ],
    "response": "Fishing is currently closed after 2 p.m. on the Madison River, Firehole River, and Gibbon River (downstream of Norris Campground) due to warm water temperatures and low flows. These conditions stress fish populations, so closures help protect native species. Be sure to check current alerts daily when planning to fish.",
    "tags": [
      "fishing",
      "wildlife protection",
      "conservation"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "Can I still hike Biscuit Basin?",
      "Is Firehole River trail open?",
      "What's going on at Biscuit Basin?"
    ],
    "response": "No, hiking in Biscuit Basin is currently prohibited. The area has been closed due to a hydrothermal explosion and ongoing geothermal instability. All trails, boardwalks, and the Firehole River access at Biscuit Basin are closed until further notice. Use caution in the area and follow posted signage.",
    "tags": [
      "geothermal",
      "trail safety",
      "closures"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "What are the safety concerns with elk in Yellowstone?",
      "Have elk charged people near buildings?",
      "Why are elk hiding near cars in the park?"
    ],
    "response": "During calving season, elk may hide their young near cars, buildings, or around corners, especially near Mammoth. They're extremely protective and have been known to charge people. Stay aware, keep a wide berth, and give elk the space they need—especially in spring and early summer.",
    "tags": [
      "wildlife viewing",
      "trail safety",
      "seasonal alerts"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "Can I fish in Yellowstone all day?",
      "When do fishing closures happen?",
      "Are there fishing hours I should follow in Yellowstone?"
    ],
    "response": "Fishing is allowed only during designated hours and may be restricted due to environmental conditions. Currently, several rivers including the Madison, Firehole, and parts of the Gibbon are closed daily after 2 p.m. due to high water temperatures. Always check with the visitor center for the latest updates.",
    "tags": [
      "fishing",
      "conservation",
      "visitor guidelines"
    ],
    "tiers": [
      "free",
      "premium"
    ]
  },
  {
    "patterns": [
      "Are geysers safe to visit during explosions?",
      "How dangerous are hydrothermal areas?",
      "Should I be worried about geysers exploding?"
    ],
    "response": "Hydrothermal areas in Yellowstone can be unstable. Occasional explosions, like the one at Biscuit Basin, highlight the need for extreme caution. Always stay on designated boardwalks, obey closures, and never approach thermal features off-trail. If you're unsure, check alerts before heading out.",
    "tags": [
      "geothermal",
      "visitor safety",
      "park hazards"
    ],
    "tiers": [
      "free"
    ]
  },
  {
    "patterns": [
      "What time can I start fishing again after the closure?",
      "Is sunrise the earliest I can fish?",
      "When does fishing reopen each day?"
    ],
    "response": "Fishing on rivers with 2 p.m. closures reopens at sunrise the following day. This allows water temperatures to stabilize and reduces stress on fish. Be mindful of posted signs and be sure to respect these timing rules to help protect Yellowstone’s aquatic life.",
    "tags": [
      "fishing",
      "conservation",
      "rules"
    ],
    "tiers": [
      "free"
    ]
  }
]