[
  {
    "patterns": [
      "What are the best lodging options in Jackson or Driggs?",
      "Can you recommend lodging near downtown Jackson or Driggs?",
      "Are there good lodging options for families in Jackson or Driggs?",
      "Tell me about lodging around the national forest near Jackson or Driggs",
      "What lodging spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to lodging in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "lodging"
    ],
    "tags": [
      "lodging",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best camping options in Jackson or Driggs?",
      "Can you recommend camping near downtown Jackson or Driggs?",
      "Are there good camping options for families in Jackson or Driggs?",
      "Tell me about camping around the national forest near Jackson or Driggs",
      "What camping spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to camping in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "camping"
    ],
    "tags": [
      "camping",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best RVs options in Jackson or Driggs?",
      "Can you recommend RVs near downtown Jackson or Driggs?",
      "Are there good RVs options for families in Jackson or Driggs?",
      "Tell me about RVs around the national forest near Jackson or Driggs",
      "What RVs spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to RVs in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "RVs"
    ],
    "tags": [
      "rvs",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best skiing options in Jackson or Driggs?",
      "Can you recommend skiing near downtown Jackson or Driggs?",
      "Are there good skiing options for families in Jackson or Driggs?",
      "Tell me about skiing around the national forest near Jackson or Driggs",
      "What skiing spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to skiing in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "skiing"
    ],
    "tags": [
      "skiing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best snowshoeing options in Jackson or Driggs?",
      "Can you recommend snowshoeing near downtown Jackson or Driggs?",
      "Are there good snowshoeing options for families in Jackson or Driggs?",
      "Tell me about snowshoeing around the national forest near Jackson or Driggs",
      "What snowshoeing spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to snowshoeing in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "snowshoeing"
    ],
    "tags": [
      "snowshoeing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best winter hikes options in Jackson or Driggs?",
      "Can you recommend winter hikes near downtown Jackson or Driggs?",
      "Are there good winter hikes options for families in Jackson or Driggs?",
      "Tell me about winter hikes around the national forest near Jackson or Driggs",
      "What winter hikes spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to winter hikes in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "winter hikes"
    ],
    "tags": [
      "winter_hikes",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best summer hikes options in Jackson or Driggs?",
      "Can you recommend summer hikes near downtown Jackson or Driggs?",
      "Are there good summer hikes options for families in Jackson or Driggs?",
      "Tell me about summer hikes around the national forest near Jackson or Driggs",
      "What summer hikes spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to summer hikes in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "summer hikes"
    ],
    "tags": [
      "summer_hikes",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best coffee shops options in Jackson or Driggs?",
      "Can you recommend coffee shops near downtown Jackson or Driggs?",
      "Are there good coffee shops options for families in Jackson or Driggs?",
      "Tell me about coffee shops around the national forest near Jackson or Driggs",
      "What coffee shops spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to coffee shops in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "coffee shops"
    ],
    "tags": [
      "coffee_shops",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best pizza places options in Jackson or Driggs?",
      "Can you recommend pizza places near downtown Jackson or Driggs?",
      "Are there good pizza places options for families in Jackson or Driggs?",
      "Tell me about pizza places around the national forest near Jackson or Driggs",
      "What pizza places spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to pizza places in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "pizza places"
    ],
    "tags": [
      "pizza_places",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best fly fishing options in Jackson or Driggs?",
      "Can you recommend fly fishing near downtown Jackson or Driggs?",
      "Are there good fly fishing options for families in Jackson or Driggs?",
      "Tell me about fly fishing around the national forest near Jackson or Driggs",
      "What fly fishing spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to fly fishing in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "fly fishing"
    ],
    "tags": [
      "fly_fishing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best gear rentals options in Jackson or Driggs?",
      "Can you recommend gear rentals near downtown Jackson or Driggs?",
      "Are there good gear rentals options for families in Jackson or Driggs?",
      "Tell me about gear rentals around the national forest near Jackson or Driggs",
      "What gear rentals spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to gear rentals in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "gear rentals"
    ],
    "tags": [
      "gear_rentals",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best scenic drives options in Jackson or Driggs?",
      "Can you recommend scenic drives near downtown Jackson or Driggs?",
      "Are there good scenic drives options for families in Jackson or Driggs?",
      "Tell me about scenic drives around the national forest near Jackson or Driggs",
      "What scenic drives spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to scenic drives in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "scenic drives"
    ],
    "tags": [
      "scenic_drives",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best photo spots options in Jackson or Driggs?",
      "Can you recommend photo spots near downtown Jackson or Driggs?",
      "Are there good photo spots options for families in Jackson or Driggs?",
      "Tell me about photo spots around the national forest near Jackson or Driggs",
      "What photo spots spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to photo spots in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "photo spots"
    ],
    "tags": [
      "photo_spots",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best wildlife viewing options in Jackson or Driggs?",
      "Can you recommend wildlife viewing near downtown Jackson or Driggs?",
      "Are there good wildlife viewing options for families in Jackson or Driggs?",
      "Tell me about wildlife viewing around the national forest near Jackson or Driggs",
      "What wildlife viewing spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to wildlife viewing in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "wildlife viewing"
    ],
    "tags": [
      "wildlife_viewing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best guided tours options in Jackson or Driggs?",
      "Can you recommend guided tours near downtown Jackson or Driggs?",
      "Are there good guided tours options for families in Jackson or Driggs?",
      "Tell me about guided tours around the national forest near Jackson or Driggs",
      "What guided tours spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to guided tours in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "guided tours"
    ],
    "tags": [
      "guided_tours",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best whitewater rafting options in Jackson or Driggs?",
      "Can you recommend whitewater rafting near downtown Jackson or Driggs?",
      "Are there good whitewater rafting options for families in Jackson or Driggs?",
      "Tell me about whitewater rafting around the national forest near Jackson or Driggs",
      "What whitewater rafting spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to whitewater rafting in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "whitewater rafting"
    ],
    "tags": [
      "whitewater_rafting",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best bike trails options in Jackson or Driggs?",
      "Can you recommend bike trails near downtown Jackson or Driggs?",
      "Are there good bike trails options for families in Jackson or Driggs?",
      "Tell me about bike trails around the national forest near Jackson or Driggs",
      "What bike trails spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to bike trails in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "bike trails"
    ],
    "tags": [
      "bike_trails",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best snowmobiling options in Jackson or Driggs?",
      "Can you recommend snowmobiling near downtown Jackson or Driggs?",
      "Are there good snowmobiling options for families in Jackson or Driggs?",
      "Tell me about snowmobiling around the national forest near Jackson or Driggs",
      "What snowmobiling spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to snowmobiling in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "snowmobiling"
    ],
    "tags": [
      "snowmobiling",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best airports options in Jackson or Driggs?",
      "Can you recommend airports near downtown Jackson or Driggs?",
      "Are there good airports options for families in Jackson or Driggs?",
      "Tell me about airports around the national forest near Jackson or Driggs",
      "What airports spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to airports in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "airports"
    ],
    "tags": [
      "airports",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best transportation options in Jackson or Driggs?",
      "Can you recommend transportation near downtown Jackson or Driggs?",
      "Are there good transportation options for families in Jackson or Driggs?",
      "Tell me about transportation around the national forest near Jackson or Driggs",
      "What transportation spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to transportation in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "transportation"
    ],
    "tags": [
      "transportation",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best shuttle services options in Jackson or Driggs?",
      "Can you recommend shuttle services near downtown Jackson or Driggs?",
      "Are there good shuttle services options for families in Jackson or Driggs?",
      "Tell me about shuttle services around the national forest near Jackson or Driggs",
      "What shuttle services spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to shuttle services in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "shuttle services"
    ],
    "tags": [
      "shuttle_services",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best après ski options in Jackson or Driggs?",
      "Can you recommend après ski near downtown Jackson or Driggs?",
      "Are there good après ski options for families in Jackson or Driggs?",
      "Tell me about après ski around the national forest near Jackson or Driggs",
      "What après ski spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to après ski in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "après ski"
    ],
    "tags": [
      "après_ski",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best backcountry skiing options in Jackson or Driggs?",
      "Can you recommend backcountry skiing near downtown Jackson or Driggs?",
      "Are there good backcountry skiing options for families in Jackson or Driggs?",
      "Tell me about backcountry skiing around the national forest near Jackson or Driggs",
      "What backcountry skiing spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to backcountry skiing in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "backcountry skiing"
    ],
    "tags": [
      "backcountry_skiing",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best hot springs options in Jackson or Driggs?",
      "Can you recommend hot springs near downtown Jackson or Driggs?",
      "Are there good hot springs options for families in Jackson or Driggs?",
      "Tell me about hot springs around the national forest near Jackson or Driggs",
      "What hot springs spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to hot springs in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "hot springs"
    ],
    "tags": [
      "hot_springs",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best day trips options in Jackson or Driggs?",
      "Can you recommend day trips near downtown Jackson or Driggs?",
      "Are there good day trips options for families in Jackson or Driggs?",
      "Tell me about day trips around the national forest near Jackson or Driggs",
      "What day trips spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to day trips in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "day trips"
    ],
    "tags": [
      "day_trips",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best restaurant reservations options in Jackson or Driggs?",
      "Can you recommend restaurant reservations near downtown Jackson or Driggs?",
      "Are there good restaurant reservations options for families in Jackson or Driggs?",
      "Tell me about restaurant reservations around the national forest near Jackson or Driggs",
      "What restaurant reservations spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to restaurant reservations in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "restaurant reservations"
    ],
    "tags": [
      "restaurant_reservations",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best pet-friendly lodging options in Jackson or Driggs?",
      "Can you recommend pet-friendly lodging near downtown Jackson or Driggs?",
      "Are there good pet-friendly lodging options for families in Jackson or Driggs?",
      "Tell me about pet-friendly lodging around the national forest near Jackson or Driggs",
      "What pet-friendly lodging spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to pet-friendly lodging in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "pet-friendly lodging"
    ],
    "tags": [
      "pet-friendly_lodging",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best kid-friendly dining options in Jackson or Driggs?",
      "Can you recommend kid-friendly dining near downtown Jackson or Driggs?",
      "Are there good kid-friendly dining options for families in Jackson or Driggs?",
      "Tell me about kid-friendly dining around the national forest near Jackson or Driggs",
      "What kid-friendly dining spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to kid-friendly dining in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "kid-friendly dining"
    ],
    "tags": [
      "kid-friendly_dining",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best national forest access options in Jackson or Driggs?",
      "Can you recommend national forest access near downtown Jackson or Driggs?",
      "Are there good national forest access options for families in Jackson or Driggs?",
      "Tell me about national forest access around the national forest near Jackson or Driggs",
      "What national forest access spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to national forest access in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "national forest access"
    ],
    "tags": [
      "national_forest_access",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best emergency services options in Jackson or Driggs?",
      "Can you recommend emergency services near downtown Jackson or Driggs?",
      "Are there good emergency services options for families in Jackson or Driggs?",
      "Tell me about emergency services around the national forest near Jackson or Driggs",
      "What emergency services spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to emergency services in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "emergency services"
    ],
    "tags": [
      "emergency_services",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best trip planning options in Jackson or Driggs?",
      "Can you recommend trip planning near downtown Jackson or Driggs?",
      "Are there good trip planning options for families in Jackson or Driggs?",
      "Tell me about trip planning around the national forest near Jackson or Driggs",
      "What trip planning spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to trip planning in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "trip planning"
    ],
    "tags": [
      "trip_planning",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best snow conditions options in Jackson or Driggs?",
      "Can you recommend snow conditions near downtown Jackson or Driggs?",
      "Are there good snow conditions options for families in Jackson or Driggs?",
      "Tell me about snow conditions around the national forest near Jackson or Driggs",
      "What snow conditions spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to snow conditions in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "snow conditions"
    ],
    "tags": [
      "snow_conditions",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best avalanche safety options in Jackson or Driggs?",
      "Can you recommend avalanche safety near downtown Jackson or Driggs?",
      "Are there good avalanche safety options for families in Jackson or Driggs?",
      "Tell me about avalanche safety around the national forest near Jackson or Driggs",
      "What avalanche safety spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to avalanche safety in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "avalanche safety"
    ],
    "tags": [
      "avalanche_safety",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best weather updates options in Jackson or Driggs?",
      "Can you recommend weather updates near downtown Jackson or Driggs?",
      "Are there good weather updates options for families in Jackson or Driggs?",
      "Tell me about weather updates around the national forest near Jackson or Driggs",
      "What weather updates spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to weather updates in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "weather updates"
    ],
    "tags": [
      "weather_updates",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best clothing rental options in Jackson or Driggs?",
      "Can you recommend clothing rental near downtown Jackson or Driggs?",
      "Are there good clothing rental options for families in Jackson or Driggs?",
      "Tell me about clothing rental around the national forest near Jackson or Driggs",
      "What clothing rental spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to clothing rental in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "clothing rental"
    ],
    "tags": [
      "clothing_rental",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best souvenir shops options in Jackson or Driggs?",
      "Can you recommend souvenir shops near downtown Jackson or Driggs?",
      "Are there good souvenir shops options for families in Jackson or Driggs?",
      "Tell me about souvenir shops around the national forest near Jackson or Driggs",
      "What souvenir shops spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to souvenir shops in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "souvenir shops"
    ],
    "tags": [
      "souvenir_shops",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best grocery stores options in Jackson or Driggs?",
      "Can you recommend grocery stores near downtown Jackson or Driggs?",
      "Are there good grocery stores options for families in Jackson or Driggs?",
      "Tell me about grocery stores around the national forest near Jackson or Driggs",
      "What grocery stores spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to grocery stores in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "grocery stores"
    ],
    "tags": [
      "grocery_stores",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best horseback riding options in Jackson or Driggs?",
      "Can you recommend horseback riding near downtown Jackson or Driggs?",
      "Are there good horseback riding options for families in Jackson or Driggs?",
      "Tell me about horseback riding around the national forest near Jackson or Driggs",
      "What horseback riding spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to horseback riding in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "horseback riding"
    ],
    "tags": [
      "horseback_riding",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best wildflower walks options in Jackson or Driggs?",
      "Can you recommend wildflower walks near downtown Jackson or Driggs?",
      "Are there good wildflower walks options for families in Jackson or Driggs?",
      "Tell me about wildflower walks around the national forest near Jackson or Driggs",
      "What wildflower walks spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to wildflower walks in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "wildflower walks"
    ],
    "tags": [
      "wildflower_walks",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best alpine lakes options in Jackson or Driggs?",
      "Can you recommend alpine lakes near downtown Jackson or Driggs?",
      "Are there good alpine lakes options for families in Jackson or Driggs?",
      "Tell me about alpine lakes around the national forest near Jackson or Driggs",
      "What alpine lakes spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to alpine lakes in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "alpine lakes"
    ],
    "tags": [
      "alpine_lakes",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best local events options in Jackson or Driggs?",
      "Can you recommend local events near downtown Jackson or Driggs?",
      "Are there good local events options for families in Jackson or Driggs?",
      "Tell me about local events around the national forest near Jackson or Driggs",
      "What local events spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to local events in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "local events"
    ],
    "tags": [
      "local_events",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best park entrances options in Jackson or Driggs?",
      "Can you recommend park entrances near downtown Jackson or Driggs?",
      "Are there good park entrances options for families in Jackson or Driggs?",
      "Tell me about park entrances around the national forest near Jackson or Driggs",
      "What park entrances spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to park entrances in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "park entrances"
    ],
    "tags": [
      "park_entrances",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best accessibility options in Jackson or Driggs?",
      "Can you recommend accessibility near downtown Jackson or Driggs?",
      "Are there good accessibility options for families in Jackson or Driggs?",
      "Tell me about accessibility around the national forest near Jackson or Driggs",
      "What accessibility spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to accessibility in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "accessibility"
    ],
    "tags": [
      "accessibility",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best ranger programs options in Jackson or Driggs?",
      "Can you recommend ranger programs near downtown Jackson or Driggs?",
      "Are there good ranger programs options for families in Jackson or Driggs?",
      "Tell me about ranger programs around the national forest near Jackson or Driggs",
      "What ranger programs spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to ranger programs in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "ranger programs"
    ],
    "tags": [
      "ranger_programs",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best junior ranger options in Jackson or Driggs?",
      "Can you recommend junior ranger near downtown Jackson or Driggs?",
      "Are there good junior ranger options for families in Jackson or Driggs?",
      "Tell me about junior ranger around the national forest near Jackson or Driggs",
      "What junior ranger spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to junior ranger in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "junior ranger"
    ],
    "tags": [
      "junior_ranger",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best guide services options in Jackson or Driggs?",
      "Can you recommend guide services near downtown Jackson or Driggs?",
      "Are there good guide services options for families in Jackson or Driggs?",
      "Tell me about guide services around the national forest near Jackson or Driggs",
      "What guide services spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to guide services in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "guide services"
    ],
    "tags": [
      "guide_services",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best breakfast spots options in Jackson or Driggs?",
      "Can you recommend breakfast spots near downtown Jackson or Driggs?",
      "Are there good breakfast spots options for families in Jackson or Driggs?",
      "Tell me about breakfast spots around the national forest near Jackson or Driggs",
      "What breakfast spots spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to breakfast spots in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "breakfast spots"
    ],
    "tags": [
      "breakfast_spots",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best hiking gear options in Jackson or Driggs?",
      "Can you recommend hiking gear near downtown Jackson or Driggs?",
      "Are there good hiking gear options for families in Jackson or Driggs?",
      "Tell me about hiking gear around the national forest near Jackson or Driggs",
      "What hiking gear spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to hiking gear in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "hiking gear"
    ],
    "tags": [
      "hiking_gear",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best ski passes options in Jackson or Driggs?",
      "Can you recommend ski passes near downtown Jackson or Driggs?",
      "Are there good ski passes options for families in Jackson or Driggs?",
      "Tell me about ski passes around the national forest near Jackson or Driggs",
      "What ski passes spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to ski passes in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "ski passes"
    ],
    "tags": [
      "ski_passes",
      "jackson_driggs"
    ]
  },
  {
    "patterns": [
      "What are the best snowboard parks options in Jackson or Driggs?",
      "Can you recommend snowboard parks near downtown Jackson or Driggs?",
      "Are there good snowboard parks options for families in Jackson or Driggs?",
      "Tell me about snowboard parks around the national forest near Jackson or Driggs",
      "What snowboard parks spots are scenic and relaxing in Jackson or Driggs?"
    ],
    "response": "Here's a helpful guide to snowboard parks in Jackson or Driggs. Local favorites, seasonal tips, and directions are included to improve your experience.",
    "keywords": [
      "snowboard parks"
    ],
    "tags": [
      "snowboard_parks",
      "jackson_driggs"
    ]
  }
]