[
  {
    "patterns": [
      "What can I do at Mammoth Hot Springs?",
      "Things to see in Mammoth Hot Springs?",
      "Is Mammoth worth a stop in Yellowstone?"
    ],
    "response": "Mammoth is one of those spots locals always recommend. Start at the Albright Visitor Center to get your bearings, then stroll the boardwalks around the terraces — they’re constantly changing with the hot water flow. In summer, drive the Upper Terrace loop. In winter, you can snowshoe the same path with steam rising all around. It's classic Yellowstone.",
    "tags": [
      "geothermal",
      "visitor centers",
      "scenic spots",
      "kid-friendly"
    ]
  },
  {
    "patterns": [
      "Where can I learn about Yellowstone history in the park?",
      "Is there a museum in Yellowstone?",
      "What is the Albright Visitor Center?"
    ],
    "response": "The Albright Visitor Center in Mammoth is where you’ll find Yellowstone’s story told right. It’s inside one of the old Army buildings from Fort Yellowstone. You’ll get a solid intro to park wildlife, geology, and history — plus helpful rangers who’ll guide your day.",
    "tags": [
      "history",
      "visitor centers",
      "kid-friendly",
      "general info"
    ]
  },
  {
    "patterns": [
      "Where can I see Fort Yellowstone?",
      "Tell me about the old Army buildings in Yellowstone.",
      "Did the military ever manage Yellowstone?"
    ],
    "response": "Fort Yellowstone is right in Mammoth, and you can walk through it yourself. Back in the late 1800s, the Army was called in to protect the park — they built those sturdy red-roofed buildings still in use today. Interpretive signs explain how the soldiers tackled poaching and laid the groundwork for the Park Service.",
    "tags": [
      "history",
      "walking tours",
      "architecture"
    ]
  },
  {
    "patterns": [
      "Are there hiking trails near Mammoth?",
      "Where can I hike around the North Entrance?",
      "Best hikes near Mammoth Hot Springs?"
    ],
    "response": "There’s good hiking out of Mammoth. Bunsen Peak is a local favorite if you’re up for a climb — the views stretch for miles. For something mellow, the Beaver Ponds Trail is great for spotting wildlife. Swing by the visitor center first for trail conditions and bear updates.",
    "tags": [
      "trail safety",
      "hiking",
      "wildlife viewing",
      "scenic spots"
    ]
  },
  {
    "patterns": [
      "Can I see waterfalls near Mammoth?",
      "Are there any easy waterfalls to visit up north?",
      "Waterfalls in the Mammoth area?"
    ],
    "response": "Sure can. You’ve got Rustic Falls right along the road south of Mammoth. Undine Falls is another roadside stop with a big view. If you’re up for a short walk, hit Wraith Falls — it’s a gentle half-mile out and back.",
    "tags": [
      "scenic spots",
      "photography",
      "short hikes",
      "kid-friendly"
    ]
  }
]