[
  {
    "patterns": [
      "How long does it take to drive from Old Faithful to Canyon Village?",
      "Driving time between Old Faithful and Canyon Village?",
      "How far is Canyon from Old Faithful by car?"
    ],
    "response": "Driving from Old Faithful to Canyon Village takes about 1 hour and 15 minutes, covering approximately 41 miles. Allow extra time in summer for wildlife crossings and construction delays. The road is typically open late May through October.",
    "tags": [
      "directions",
      "drive time",
      "road status",
      "trip planning"
    ]
  },
  {
    "patterns": [
      "How far is West Yellowstone from Mammoth Hot Springs?",
      "Drive time from West Entrance to Mammoth?",
      "How long to drive from West Yellowstone to Mammoth?"
    ],
    "response": "From West Yellowstone to Mammoth Hot Springs via Madison and Norris Junctions, the drive takes about 1 hour and 45 minutes. That’s around 52 miles, but traffic and wildlife sightings can add time—especially in peak season.",
    "tags": [
      "directions",
      "drive time",
      "trip planning"
    ]
  },
  {
    "patterns": [
      "What’s the route from South Entrance to Yellowstone Lake?",
      "How long is the drive from South Entrance to Lake Village?",
      "Best way to reach Yellowstone Lake from the South?"
    ],
    "response": "From the South Entrance to Lake Village is about 60 miles and takes roughly 1 hour and 40 minutes. The road passes through Grant Village and follows the west side of the lake. Check conditions—this route opens mid-May, weather permitting.",
    "tags": [
      "directions",
      "drive time",
      "road status"
    ]
  },
  {
    "patterns": [
      "Can I get from Tower to Lake Village directly?",
      "Is there a direct road from Tower Junction to Yellowstone Lake?",
      "Best route from Tower Junction to Lake Village?"
    ],
    "response": "You’ll need to go from Tower Junction through Canyon Village to reach Lake Village—there’s no direct road. That drive is about 60 minutes in good conditions. The road over Dunraven Pass typically opens mid-June.",
    "tags": [
      "directions",
      "road status",
      "seasonal access"
    ]
  },
  {
    "patterns": [
      "How far is it from Norris to Madison?",
      "Driving time Norris to Madison Junction?",
      "How long does it take to get from Madison to Norris?"
    ],
    "response": "It’s about 14 miles from Norris to Madison Junction, and the drive usually takes around 30 minutes. Roads in this area are open to regular vehicles from late spring through fall. Wildlife sightings can slow traffic significantly.",
    "tags": [
      "drive time",
      "directions",
      "trip planning"
    ]
  },
  {
    "patterns": [
      "How long to drive from East Entrance to Canyon?",
      "Distance from East Entrance to Canyon Village?",
      "Is it a long drive from East Gate to Canyon?"
    ],
    "response": "From the East Entrance to Canyon Village is around 60 miles and takes about 1 hour and 45 minutes. The route follows the scenic Sylvan Pass, which typically opens by Memorial Day weekend. Always check road status before your visit.",
    "tags": [
      "directions",
      "road status",
      "drive time",
      "scenic drives"
    ]
  },
  {
    "patterns": [
      "Is the road from Canyon to Tower open now?",
      "When does Dunraven Pass open?",
      "Can I drive from Canyon Village to Tower Junction?"
    ],
    "response": "The road from Canyon to Tower crosses Dunraven Pass, which usually opens mid-June and closes in mid-October. Check current road conditions before travel. The drive takes about an hour in clear weather.",
    "tags": [
      "road status",
      "directions",
      "seasonal access"
    ]
  },
  {
    "patterns": [
      "Can I reach the Northeast Entrance from the North Entrance?",
      "How long is the drive from Gardiner to Cooke City?",
      "Route from Mammoth to Northeast Entrance?"
    ],
    "response": "Yes, you can drive from Gardiner to Cooke City year-round. It’s about 55 miles from the North Entrance to the Northeast Entrance via Lamar Valley and takes around 2 hours due to wildlife and narrow road sections.",
    "tags": [
      "year-round access",
      "directions",
      "wildlife viewing"
    ]
  },
  {
    "patterns": [
      "How do I get from Grant Village to Canyon?",
      "Drive time Grant Village to Canyon Village?",
      "Is there a road between Grant and Canyon?"
    ],
    "response": "Yes, the road connects through Lake Village. It’s about 40 miles from Grant to Canyon and takes roughly 1 hour and 15 minutes. Expect delays due to traffic, construction, or wildlife. This route typically opens in late May.",
    "tags": [
      "directions",
      "drive time",
      "trip planning",
      "road status"
    ]
  },
  {
    "patterns": [
      "Are there any fuel stations in the park?",
      "Can I get gas in Yellowstone?",
      "Where can I refuel inside Yellowstone?"
    ],
    "response": "Gas is available seasonally at Old Faithful, Canyon, Grant Village, Fishing Bridge, and Mammoth. Stations close in winter. Fill up before entering remote areas and don’t rely on cell coverage for locating them.",
    "tags": [
      "services",
      "fuel",
      "trip planning"
    ]
  }
]