{
  "module_title": "Yellowstone Wildlife Safety & Leave No Trace Onboarding",
  "sections": [
    {
      "title": "Bear Safety",
      "content": [
        "Carry bear spray and keep it accessible (not in your pack).",
        "Stay 100 yards away from bears at all times.",
        "If a bear charges: stand your ground and use bear spray between 30–60 ft.",
        "Never leave food unattended or in tents.",
        "Use bear-proof containers or properly hang food.",
        "Violating bear safety rules may result in fines, bans, or jail."
      ]
    },
    {
      "title": "Bison and Wildlife Safety",
      "content": [
        "Stay 25 yards from bison, elk, moose, and deer.",
        "Most injuries to visitors involve bison—keep your distance.",
        "Never approach wildlife for photos. If they notice you, you're too close.",
        "Stay 100 yards from wolves and bears.",
        "Feeding wildlife is illegal and dangerous."
      ]
    },
    {
      "title": "Legal Consequences of Unsafe Behavior",
      "content": [
        "Approaching or harassing wildlife is illegal under federal law.",
        "Fines for wildlife harassment can exceed $1,000.",
        "Feeding animals may lead to euthanization and criminal charges.",
        "Leaving boardwalks in thermal zones can result in death and prosecution.",
        "Drone use in the park is strictly prohibited and fined up to $5,000."
      ]
    },
    {
      "title": "Boardwalk and Trail Conduct",
      "content": [
        "Stay on designated trails and boardwalks.",
        "Thermal ground is fragile and may collapse under you.",
        "Do not throw anything into hot springs or geysers.",
        "Pack out all waste, including food and biodegradable trash."
      ]
    },
    {
      "title": "Food Storage & Pack-In/Pack-Out Rules",
      "content": [
        "All food must be stored in bear lockers or bear-proof containers.",
        "Never keep food or scented items in tents.",
        "Hang food 10 ft high and 4 ft from tree trunks if lockers unavailable.",
        "Dispose of wastewater 100 ft away from water sources.",
        "Pack out all trash—'Leave No Trace' applies to everything."
      ]
    },
    {
      "title": "Leave No Trace Principles",
      "content": [
        "1. Plan ahead and prepare.",
        "2. Travel and camp on durable surfaces.",
        "3. Dispose of waste properly.",
        "4. Leave what you find.",
        "5. Minimize campfire impact.",
        "6. Respect wildlife.",
        "7. Be considerate of other visitors."
      ]
    },
    {
      "title": "Final Reminder: This Land is for Everyone",
      "content": [
        "Yellowstone is not just yours—it's shared with future generations.",
        "Be a steward of the land so others can enjoy it too.",
        "Respect nature, wildlife, and people: leave Yellowstone better than you found it."
      ]
    }
  ]
}