[
  {
    "patterns": [
      "What’s the weather like in West Yellowstone in spring?",
      "Tell me about spring conditions in Yellowstone.",
      "What should I expect for weather and roads in spring?",
      "Is it good to visit West Yellowstone during the spring?",
      "What gear do I need for Yellowstone in the spring months?"
    ],
    "response": "Spring comes late and slow in West Yellowstone. Snow is common well into May, with many trails and roads still snow-covered through April. March: Highs 30s °F (-1 to 4°C), Lows teens °F (-10 to -5°C). April: Highs 40s °F (4–9°C), Lows 20s °F (-6 to -2°C). May: Highs 50s °F (10–16°C), Lows 20s–30s °F (-4 to 3°C).  Common alerts: Avalanche warnings (especially March), Park road opening delays, Sudden snow squalls and whiteouts.",
    "keywords": [
      "weather",
      "season",
      "climate",
      "spring",
      "west yellowstone"
    ],
    "tags": [
      "weather",
      "climate",
      "west_yellowstone",
      "spring"
    ]
  },
  {
    "patterns": [
      "What’s the weather like in West Yellowstone in summer?",
      "Tell me about summer conditions in Yellowstone.",
      "What should I expect for weather and roads in summer?",
      "Is it good to visit West Yellowstone during the summer?",
      "What gear do I need for Yellowstone in the summer months?"
    ],
    "response": "Cool mornings, sunny days, and low humidity define summer in West Yellowstone. Ideal for hiking and park touring. June: 60s °F (15–21°C), lows in 30s °F (1–4°C). July/August: 70s °F (21–26°C), lows in 30s–40s °F (1–7°C).  Common alerts: Red Flag Warnings for fire danger, Smoke-related Air Quality Alerts, Thunderstorm lightning advisories.",
    "keywords": [
      "weather",
      "season",
      "climate",
      "summer",
      "west yellowstone"
    ],
    "tags": [
      "weather",
      "climate",
      "west_yellowstone",
      "summer"
    ]
  },
  {
    "patterns": [
      "What’s the weather like in West Yellowstone in fall?",
      "Tell me about fall conditions in Yellowstone.",
      "What should I expect for weather and roads in fall?",
      "Is it good to visit West Yellowstone during the fall?",
      "What gear do I need for Yellowstone in the fall months?"
    ],
    "response": "Fall arrives quickly and early in West Yellowstone. First snows usually fall by October, with frost common in September. September: Highs in 60s °F (15–20°C), lows in 20s–30s °F. October: Highs in 40s–50s °F (4–11°C), lows in teens–20s °F. November: Highs in 30s–40s °F (0–6°C), lows in single digits.  Common alerts: First snow and freeze warnings, Road closures and seasonal shutdowns, Increased wildlife movement.",
    "keywords": [
      "weather",
      "season",
      "climate",
      "fall",
      "west yellowstone"
    ],
    "tags": [
      "weather",
      "climate",
      "west_yellowstone",
      "fall"
    ]
  },
  {
    "patterns": [
      "What’s the weather like in West Yellowstone in winter?",
      "Tell me about winter conditions in Yellowstone.",
      "What should I expect for weather and roads in winter?",
      "Is it good to visit West Yellowstone during the winter?",
      "What gear do I need for Yellowstone in the winter months?"
    ],
    "response": "West Yellowstone is one of the coldest towns in the U.S., with heavy snowfall and frequent sub-zero temperatures. A major hub for snowmobiling and Nordic skiing. high: 10s–20s °F (-12 to -5°C). low: -20 °F or colder (-29°C).  Common alerts: Winter Storm Warnings, Extreme Cold and Wind Chill Advisories, Avalanche forecasts for surrounding national forest.",
    "keywords": [
      "weather",
      "season",
      "climate",
      "winter",
      "west yellowstone"
    ],
    "tags": [
      "weather",
      "climate",
      "west_yellowstone",
      "winter"
    ]
  }
]