[
  {
    "patterns": [
      "What is the Duck Lake Trail like?",
      "Can I hike to Duck Lake from West Thumb?",
      "How long does it take to hike Duck Lake Trail?",
      "What can I see on Duck Lake Trail?"
    ],
    "response": "The Duck Lake Trail near West Thumb Geyser Basin is a 1–2 hour hike up a gentle hill. It offers views of Duck Lake, Yellowstone Lake, and the 1988 fire recovery zone.",
    "keywords": [
      "Duck Lake",
      "West Thumb",
      "1988 fire",
      "views"
    ],
    "tags": [
      "west_thumb",
      "trails",
      "fire_ecology"
    ]
  },
  {
    "patterns": [
      "What is the Lewis River Channel Trail?",
      "Can I hike the Dogshead Trail to Lewis Lake?",
      "Where does the Lewis River Channel Trail go?",
      "How long is the Lewis River and Dogshead Trail loop?"
    ],
    "response": "The Lewis River Channel and Dogshead Trails form a 5–8 hour loop through forest and alongside clear waters. Look for osprey and eagles fishing for trout in summer and fall.",
    "keywords": [
      "Lewis River",
      "Dogshead",
      "loop hike",
      "osprey"
    ],
    "tags": [
      "west_thumb",
      "trails",
      "wildlife"
    ]
  },
  {
    "patterns": [
      "How hard is the Riddle Lake Trail?",
      "Can I see wildlife on the Riddle Lake Trail?",
      "What’s the duration of the Riddle Lake hike?",
      "Is Riddle Lake near Grant Village?"
    ],
    "response": "The Riddle Lake Trail is a 2–4 hour hike through meadows and pine forest to a lily-covered lake near Grant Village. Elk and bird sightings are common.",
    "keywords": [
      "Riddle Lake",
      "Grant Village",
      "elk",
      "hike"
    ],
    "tags": [
      "west_thumb",
      "trails",
      "wildlife"
    ]
  },
  {
    "patterns": [
      "Where does the DeLacy Creek Trail go?",
      "Is DeLacy Creek Trail a long hike?",
      "What animals can I see on DeLacy Creek Trail?",
      "Can I hike to Shoshone Lake?"
    ],
    "response": "DeLacy Creek Trail is a 3–5 hour round trip to Shoshone Lake, Yellowstone’s largest backcountry lake. Look for sandhill cranes, moose, and waterfowl in the open meadows.",
    "keywords": [
      "DeLacy Creek",
      "Shoshone Lake",
      "wildlife",
      "moose"
    ],
    "tags": [
      "west_thumb",
      "trails",
      "backcountry"
    ]
  },
  {
    "patterns": [
      "Is the West Thumb Geyser Basin Trail easy?",
      "Can I hike the boardwalk at West Thumb?",
      "How long is the West Thumb trail?",
      "What do I see on the West Thumb Geyser Basin walk?"
    ],
    "response": "The West Thumb Geyser Basin Trail is a 30–60 minute walk on a boardwalk past colorful hot springs and dormant lakeshore geysers. It’s one of Yellowstone’s most scenic short walks.",
    "keywords": [
      "West Thumb",
      "geyser basin",
      "boardwalk",
      "short hike"
    ],
    "tags": [
      "west_thumb",
      "trails",
      "geothermal"
    ]
  },
  {
    "patterns": [
      "Where does the Yellowstone Lake Overlook Trail go?",
      "Can I hike to a viewpoint of Yellowstone Lake?",
      "What are the views from Yellowstone Lake Overlook?",
      "Is the Lake Overlook Trail steep?"
    ],
    "response": "The Yellowstone Lake Overlook Trail is a 1–3 hour hike from West Thumb Geyser Basin to a high meadow with panoramic views of Yellowstone Lake and the Absaroka Mountains.",
    "keywords": [
      "Lake Overlook",
      "views",
      "West Thumb",
      "Absaroka"
    ],
    "tags": [
      "west_thumb",
      "trails",
      "views"
    ]
  },
  {
    "patterns": [
      "Are pets allowed on West Thumb hiking trails?",
      "Can I hike with a dog in Grant Village area?",
      "Are there pet-friendly trails near West Thumb?",
      "Can I bring my dog on Yellowstone hikes?"
    ],
    "response": "Pets are not permitted on trails in Yellowstone, including those in West Thumb and Grant Village. They are allowed only in developed areas and must remain leashed.",
    "keywords": [
      "pets",
      "dogs",
      "trails",
      "rules"
    ],
    "tags": [
      "west_thumb",
      "accessibility",
      "pet_policy"
    ]
  },
  {
    "patterns": [
      "Are West Thumb trails good for kids?",
      "What are the easiest hikes near Grant Village?",
      "Can kids hike the West Thumb boardwalk?",
      "Are short hikes available in this area?"
    ],
    "response": "Yes, family-friendly hikes like the West Thumb boardwalk, Duck Lake Trail, and the Lake Overlook Trail are great options. These offer scenic views and short distances.",
    "keywords": [
      "family",
      "kids",
      "easy",
      "boardwalk"
    ],
    "tags": [
      "west_thumb",
      "accessibility",
      "family"
    ]
  },
  {
    "patterns": [
      "Are there trail maps at Grant Village?",
      "How do I get hiking info at West Thumb?",
      "Where can I find a trail guide in this area?",
      "Can I check trail conditions in Grant Village?"
    ],
    "response": "You can get updated trail maps and info at the Grant Village Visitor Center. They also provide advice on trail conditions, closures, and wildlife activity.",
    "keywords": [
      "maps",
      "trail info",
      "visitor center",
      "conditions"
    ],
    "tags": [
      "west_thumb",
      "planning",
      "visitor_services"
    ]
  },
  {
    "patterns": [
      "What wildlife might I see on West Thumb hikes?",
      "Can I see elk or bears on trails near Grant Village?",
      "Are birds common around Riddle or Duck Lake?",
      "Is there wildlife near Shoshone Lake?"
    ],
    "response": "Wildlife sightings include elk, black bears, moose, sandhill cranes, and eagles depending on the trail. Always maintain a safe distance and carry bear spray.",
    "keywords": [
      "wildlife",
      "elk",
      "bears",
      "birds"
    ],
    "tags": [
      "west_thumb",
      "trails",
      "wildlife"
    ]
  },
  {
    "patterns": [
      "Are there high elevation hikes near West Thumb?",
      "What’s the elevation at Yellowstone Lake Overlook?",
      "Do any trails climb to scenic viewpoints?",
      "Are there good sunrise spots near West Thumb?"
    ],
    "response": "The Yellowstone Lake Overlook Trail climbs to a high meadow for expansive views—ideal for sunrise. Elevation gain is moderate, but the scenery is unmatched.",
    "keywords": [
      "elevation",
      "views",
      "scenic",
      "sunrise"
    ],
    "tags": [
      "west_thumb",
      "trails",
      "views"
    ]
  },
  {
    "patterns": [
      "When is the best season for hiking near Grant Village?",
      "Can I hike West Thumb trails in fall?",
      "Are summer hikes safe in this area?",
      "What’s the hiking season for West Thumb?"
    ],
    "response": "Summer and fall are best for hiking near West Thumb and Grant Village. Trails like DeLacy Creek and Lewis River are dry and wildlife is active during these seasons.",
    "keywords": [
      "seasons",
      "summer",
      "fall",
      "hiking"
    ],
    "tags": [
      "west_thumb",
      "planning",
      "seasonal"
    ]
  },
  {
    "patterns": [
      "Can I paddle or kayak near Grant Village?",
      "Are there paddling tours from West Thumb?",
      "Is paddling allowed on Yellowstone Lake?",
      "Where do canoe trips launch in this area?"
    ],
    "response": "Yes, paddling is permitted on Yellowstone Lake. Guided kayak trips and private paddling launch from the Grant Village Marina. Always check safety regulations first.",
    "keywords": [
      "paddling",
      "kayak",
      "canoe",
      "Yellowstone Lake"
    ],
    "tags": [
      "west_thumb",
      "recreation",
      "water"
    ]
  },
  {
    "patterns": [
      "Are there any geothermal hikes near the lake?",
      "What trails explore hot springs at West Thumb?",
      "Can I walk near geysers and hot springs?",
      "Where do the geothermal trails start?"
    ],
    "response": "The West Thumb Geyser Basin Trail is a geothermal loop on the lake’s edge. It features hot springs, mudpots, and dormant geysers—great for learning about volcanic activity.",
    "keywords": [
      "geothermal",
      "West Thumb",
      "hot springs",
      "geyser basin"
    ],
    "tags": [
      "west_thumb",
      "trails",
      "geothermal"
    ]
  },
  {
    "patterns": [
      "What’s the trail with lake and forest scenery?",
      "Are there trails with both meadows and forests?",
      "Can I hike through forest to a lake in West Thumb?",
      "Which trail has diverse habitats?"
    ],
    "response": "Riddle Lake Trail and DeLacy Creek Trail both offer a mix of meadow, forest, and lake views. These hikes are excellent for varied scenery and wildlife observation.",
    "keywords": [
      "lake",
      "forest",
      "meadow",
      "scenery"
    ],
    "tags": [
      "west_thumb",
      "trails",
      "diverse"
    ]
  }
]