{
  "where is the best place to see a wolf?": "[ES] The best place to see a wolf in Yellowstone is Lamar Valley. It's often called 'America's Serengeti' because of its rich wildlife, and early mornings offer the best chance to spot wolves in action.",
  "what is old faithful?": "[ES] Old Faithful is a famous cone geyser in Yellowstone National Park. It erupts approximately every 90 minutes, sending water up to 180 feet in the air.",
  "when is the best time to visit yellowstone?": "[ES] The best time to visit Yellowstone is from late May to early October. June and September are ideal for avoiding peak crowds while still enjoying good weather and wildlife.",
  "how do i get to lamar valley?": "[ES] Lamar Valley is located in the northeastern section of Yellowstone. From Mammoth Hot Springs, take the Grand Loop Road east toward Tower Junction, then continue on the Northeast Entrance Road.",
  "are there bears in yellowstone?": "[ES] Yes, Yellowstone is home to both grizzly bears and black bears. Visitors should carry bear spray and know how to store food properly.",
  "can i swim in yellowstone?": "[ES] Swimming is only allowed in a few designated areas in Yellowstone, such as the Firehole Swim Area and Boiling River (when open). Most thermal features are extremely dangerous.",
  "what should i pack for yellowstone?": "[ES] Essentials include layered clothing, bear spray, hiking boots, sunscreen, water bottles, binoculars, and a camera. Weather can change quickly in the park.",
  "how much does it cost to enter yellowstone?": "[ES] A 7-day private vehicle pass is $35. Motorcycles are $30, and individuals on foot or bike are $20. Annual and lifetime passes are also available.",
  "are pets allowed in yellowstone?": "[ES] Pets are allowed in Yellowstone, but only in developed areas, campgrounds, and within 100 feet of roads. They must be leashed and are not allowed on trails or boardwalks.",
  "what are the most popular attractions in yellowstone?": "[ES] Top attractions include Old Faithful, Grand Prismatic Spring, Grand Canyon of the Yellowstone, Lamar Valley, Mammoth Hot Springs, and Yellowstone Lake.",
  "can i drive through yellowstone in one day?": "[ES] Yes, you can drive through Yellowstone in one day using the Grand Loop Road, but you'll only scratch the surface. Plan to stop at 3–5 major sights and expect 6–8 hours with minimal hiking.",
  "what wildlife can i see in yellowstone?": "[ES] Yellowstone is home to bison, elk, wolves, bears, moose, pronghorn, coyotes, eagles, and more. Lamar Valley and Hayden Valley are top wildlife viewing areas.",
  "where can i see the grand prismatic spring?": "[ES] The Grand Prismatic Spring is in the Midway Geyser Basin. For the best view, hike the overlook trail from the Fairy Falls parking area.",
  "is yellowstone safe for kids?": "[ES] Yes, Yellowstone is kid-friendly, but children must be closely supervised, especially near geysers, hot springs, and wildlife.",
  "are there restaurants in yellowstone?": "[ES] Yes, there are dining options at visitor hubs like Old Faithful, Canyon Village, Mammoth Hot Springs, and Lake Village. Some operate seasonally.",
  "do i need a reservation to enter yellowstone?": "[ES] No, you don't need a reservation to enter Yellowstone, but lodging and campsites should be reserved well in advance, especially in summer.",
  "what is the yellowstone supervolcano?": "[ES] The Yellowstone supervolcano is a massive underground magma chamber. While it's active, there are no signs of imminent eruption.",
  "where is mammoth hot springs?": "[ES] Mammoth Hot Springs is located near the north entrance of Yellowstone, just south of Gardiner, Montana.",
  "can i visit yellowstone in winter?": "[ES] Yes, winter visits are possible and magical. The park is open to oversnow vehicles, and you can enjoy guided tours, cross-country skiing, and fewer crowds.",
  "what are ranger programs in yellowstone?": "[ES] Ranger-led programs include walks, talks, wildlife watches, and evening presentations. Schedules are available at visitor centers during summer months."
}
