{
  "fallback_responses": {
    "en": [
      "I'm not sure I understand — could you try rephrasing that?",
      "Oops! I didn’t quite catch that. Try asking me in a different way.",
      "I can help with hikes, wildlife, safety tips, and more — want to ask about one of those?",
      "Hmm... that doesn’t ring a bell. Maybe try something like: 'Where can I see bison?'",
      "Looks like I need a little more info. Ask me about hiking, lodging, or park hours!",
      "That input seems off — maybe a typo? Try again and I’ll do my best.",
      "Still learning that one! Try asking in a way you might ask a local.",
      "I can help with directions, animals, or geysers — try a topic like that.",
      "If you're speaking another language, I may only support English, Spanish, French, or Hindi right now.",
      "Let’s simplify it: try a short question like 'Best hike near Old Faithful?'"
    ],
    "es": [
      "No estoy seguro de entender — ¿puedes reformular tu pregunta?",
      "¡Ups! No entendí bien eso. Intenta preguntarme de otra manera.",
      "Puedo ayudarte con caminatas, fauna, consejos de seguridad y más — ¿quieres preguntar sobre alguno de esos temas?",
      "Mmm... eso no me suena. Prueba con algo como: '¿Dónde puedo ver bisontes?'",
      "Parece que necesito un poco más de información. ¡Pregúntame sobre senderismo, alojamiento o horarios!",
      "Eso parece tener un error. Intenta escribirlo de nuevo.",
      "Todavía estoy aprendiendo eso. Intenta preguntar como si hablaras con un guía local.",
      "Puedo ayudarte con direcciones, animales o géiseres — prueba con uno de esos temas.",
      "Si estás usando otro idioma, por ahora solo entiendo inglés, español, francés o hindi.",
      "Simplifiquemos: intenta una pregunta corta como '¿Mejor caminata cerca de Old Faithful?'"
    ],
    "fr": [
      "Je ne suis pas sûr de comprendre — pouvez-vous reformuler ?",
      "Oups ! Je n’ai pas bien saisi. Essayez de poser la question autrement.",
      "Je peux vous aider pour les randonnées, la faune, les conseils de sécurité et plus encore — voulez-vous parler d’un de ces sujets ?",
      "Hmm... cela ne me dit rien. Essayez quelque chose comme : 'Où puis-je voir des bisons ?'",
      "J’aurais besoin de plus d’informations. Demandez-moi par exemple les horaires ou les meilleurs sentiers.",
      "Il semble y avoir une faute de frappe. Essayez à nouveau.",
      "Je suis encore en train d’apprendre cela. Essayez une question comme si vous parliez à un habitant.",
      "Je peux aider avec les directions, les animaux ou les geysers — essayez l’un de ces sujets.",
      "Si vous utilisez une autre langue, je ne comprends pour l’instant que l’anglais, l’espagnol, le français et l’hindi.",
      "Essayons plus simple : posez une question courte comme 'Randonnée facile près de Old Faithful ?'"
    ],
    "hi": [
      "माफ़ कीजिए, मैं पूरी तरह नहीं समझ पाया — क्या आप दोबारा पूछ सकते हैं?",
      "उफ़! लगता है मैं समझ नहीं पाया। कृपया सवाल को थोड़ा और स्पष्ट करें।",
      "मैं आपकी मदद कर सकता हूँ वाइल्डलाइफ़, हाइकिंग, सुरक्षा सलाह और बहुत कुछ में — क्या आप इनमें से कुछ पूछना चाहेंगे?",
      "हम्म... वो मुझे समझ में नहीं आया। कुछ ऐसा पूछें: 'मैं बाइसन कहाँ देख सकता हूँ?'",
      "थोड़ी और जानकारी की ज़रूरत है। ट्रेकिंग, लॉजिंग या पार्क के समय के बारे में पूछें!",
      "शायद उसमें टाइपो है। कृपया फिर से कोशिश करें।",
      "मैं अभी वो सीख रहा हूँ! कोई स्थानीय व्यक्ति जैसे पूछे वैसे पूछें।",
      "मैं दिशा, जानवरों या गीज़र के बारे में मदद कर सकता हूँ — उन्हीं में से कुछ पूछें।",
      "यदि आप कोई और भाषा बोल रहे हैं, तो अभी मैं केवल अंग्रेज़ी, स्पेनिश, फ्रेंच और हिंदी समझता हूँ।",
      "आसान रखें: छोटा सवाल पूछें जैसे 'Old Faithful के पास सबसे अच्छी हाइक कौन सी है?'"
    ]
  }
}
