[
  {
    "intent": "yellowstone_north_entrance",
    "patterns": [
      "What’s the North Entrance like?",
      "Can I enter through Gardiner?",
      "Is the North Entrance open year-round?"
    ],
    "response": "The North Entrance (Gardiner, MT) is Yellowstone’s only year-round entrance. It leads directly to Mammoth Hot Springs and is best for winter access. Services in Gardiner include gas, lodging, groceries. Roads can be icy in winter — drive cautiously. Apple Maps: https://maps.apple.com/?q=Gardiner+MT"
  },
  {
    "intent": "yellowstone_south_entrance",
    "patterns": [
      "Where is the South Entrance?",
      "Can I drive from Jackson into Yellowstone?",
      "Is the South Entrance open in early spring?"
    ],
    "response": "The South Entrance connects Yellowstone with Grand Teton via Jackson, WY. Open roughly May–October depending on snow. Beautiful scenic corridor with forested drives. Check seasonal road status before arriving. Apple Maps: https://maps.apple.com/?q=Yellowstone+South+Entrance"
  },
  {
    "intent": "yellowstone_east_entrance",
    "patterns": [
      "Is the East Entrance open in the spring?",
      "Can I enter Yellowstone from Cody?",
      "What is the road like from Cody to the park?"
    ],
    "response": "The East Entrance via Cody, WY is scenic but closes in winter. Open late May to early November. Drive along the Shoshone River with high canyon walls. Services available in Cody year-round. Apple Maps: https://maps.apple.com/?q=Yellowstone+East+Entrance"
  },
  {
    "intent": "yellowstone_west_entrance",
    "patterns": [
      "Where is the West Entrance?",
      "Is West Yellowstone the main entrance?",
      "When does the West Entrance open?"
    ],
    "response": "West Entrance (West Yellowstone, MT) is the busiest gate and opens mid-April through early November. Closest to Old Faithful and Norris. Arrive early to avoid long lines in peak season. Gas, groceries, and lodging available in town. Apple Maps: https://maps.apple.com/?q=West+Yellowstone+MT"
  },
  {
    "intent": "yellowstone_northeast_entrance",
    "patterns": [
      "How do I enter from Cooke City?",
      "Is the Beartooth Highway open?",
      "What’s the road like to the Northeast Entrance?"
    ],
    "response": "Northeast Entrance (via Cooke City) is the most remote. Open May–October. Access via Beartooth Highway (US 212), a high alpine route that often closes due to snow. Best entrance for quick access to Lamar Valley. Apple Maps: https://maps.apple.com/?q=Northeast+Entrance+Yellowstone"
  },
  {
    "intent": "yellowstone_grand_loop_drive",
    "patterns": [
      "What is the Grand Loop?",
      "How long does it take to drive Yellowstone’s loop?",
      "Should I go clockwise or counterclockwise?"
    ],
    "response": "The Grand Loop is Yellowstone’s figure-8 shaped road system (~142 miles). Driving the full loop takes 4–7 hours without stops. Counterclockwise helps avoid tour bus congestion. Stops include Old Faithful, Canyon, Hayden, Mammoth, Norris. Speed limit is 45 mph max — watch for wildlife!"
  },
  {
    "intent": "yellowstone_scenic_drives",
    "patterns": [
      "What’s the most scenic drive in Yellowstone?",
      "Best road for views?",
      "Where can I drive for great scenery?"
    ],
    "response": "Top scenic drives include Firehole Lake Drive (geothermal), Dunraven Pass (mountains), Lamar Valley Road (wildlife), and Yellowstone Lake shoreline. Early morning and golden hour offer the best light. Always carry water and check for temporary closures."
  },
  {
    "intent": "yellowstone_seasonal_closures",
    "patterns": [
      "What roads close in winter?",
      "Are there seasonal road closures?",
      "When do roads open in Yellowstone?"
    ],
    "response": "Most park roads close from early November through April due to snow. Dunraven Pass and Beartooth Highway often reopen in late May or June. The North Entrance remains open year-round. Always check road status here: https://www.nps.gov/yell/planyourvisit/parkroads.htm"
  },
  {
    "intent": "yellowstone_best_time_to_enter",
    "patterns": [
      "When should I enter the park?",
      "What time is best to avoid lines?",
      "How early should I arrive at the gate?"
    ],
    "response": "Arrive before 8:00 AM to avoid peak wait times, especially at the West and South Entrances. Traffic builds by 9:00 AM. Enter early for better parking, wildlife viewing, and cooler temps."
  },
  {
    "intent": "yellowstone_road_conditions_and_tips",
    "patterns": [
      "Any driving tips for Yellowstone?",
      "How are the road conditions?",
      "Do I need a 4WD vehicle?"
    ],
    "response": "Roads are paved and accessible for all cars in summer. Watch for wildlife and pullouts. No cell service in many areas — download offline maps. In spring/fall, icy conditions possible. In winter, only North Entrance to Mammoth to Lamar Valley remains open (4WD recommended)."
  }
]